{"id":"1", "text": "", "schema": "pure_display", "choices": ["<p>Hello dear participant, Your task is to highlight and identify text spans that correspond to verifiable claims. A post including its comments will be shown to you and you should highlight the verifiable claims in its comments. If a comment doesn't contain any relevant verifiable claims, you can simply move on to the next comment. There are three examples down below to help you understand the nature of these annotations, rationales behind annotating certain words in a certain way, and what we ideally expect from you.</p> <p>The data you'd be annotating is taken from Reddit and more specifically from type 1 diabetes subreddit which contains people's experiences with Diabetes. We aim to investigate whether medical misinformation about diabetes can be automatically identified, as misleading advice can harm patients. This dataset will help answer our research question.</p> <p>We give the details of the definitions about the task as follows: </p> <h4>Verifiable Claim:</h4> <p>A verifiable claim is a sentence claiming that something is true, and this can be checked using information such as statistics, personal testimony, or medical evidence, or by consulting medical professionals.</p> <p>Diabetic verifiable claims will be about: <ul> <li>Research activities</li> <li>Drugs and treatments</li> <li>Dietary and lifestyle effects</li> <li>Diabetes management</li> <li>Side effects of diabetes</li> </ul></p> <p>Diabetic verifiable claims can have the following properties: <ul> <li>Exhibits strong confidence that “X” will help “Y”.</li> <li>High confidence advice like Do “X” immediately after “Y”.</li> </ul></p> <h3>Task Summary</h3> <ol> <li><b>Read</b> the text carefully.</li> <li>Only <b>highlight</b> spans in the text corresponding to medically relevant verifiable claims about Diabetes. <b>To do this, make sure you first check the “verifiable claim” checkbox.</b></li> </ol> <h5>Remarks: </h5> <ol> <li>To <b>remove</b> the label from the highlighted text, click on the highlighted text.</li> <li>You may select 'No claim detected' in cases where there are no relevant spans to be marked.</li> </ol> <p>We share a video to show how you should highlight the detected claim. [<a href=\"https://drive.google.com/file/d/1qQmXve_V4rcXU_7m2FSvkDsqHxw9oK4V/view\" target=\"_blank\">Click here</a>]</p> <p style='border: 2px solid #FF0000; background-color: #FFFFE0; padding: 10px;'><b>Important Notice:</b> Due to high server traffic, you may occasionally experience issues loading the next page. Rest assured that your progress is saved automatically. If a page does not load, refresh it and if it does not work, try reopening the task link from Prolific page to continue where you left off. Thank you for your participation and understanding!</p> <h3>Examples</h3> <p> Now we provide you example posts with their comments: </p> <h4>Example 1: </h4> <p><strong>Post:</strong> Can a sudden change in management/A1C cause issues with my eyes?</p> <p><strong>Comment 1:</strong> To preface this: this might not be the best advice, but this is experiences I have had, and what I would do if I were you. Also I hope to calm some of your nerves.</p> <p>I went through a bad period of bad life circumstances, bad access to insulin, and depression. My bg was NOT good.</p> <p>Recently, I noticed periods of blurred vision and I developed spots in my vision. I had the same retinopathy fears. It was shocking because at every yearly exam I had healthy eyes. (Still do, yay!)</p> <p><span style='background-color:green;'>I went to the doc and found out I have vitreous floaters. My doc said there is no prevention or treatment. She told me it can just happen with age (I'm in my mid 30s; only had type 1 since 2013), but to look out for other issues with my eyes.</span></p> <p>I don't want to say you don't have retinopathy.... I don't know your eyes. But I just want to calm fears that this might have some other explanation. Like you said, it might just be a change in your vision.</p> <p><strong>Comment 2:</strong> I’m 18 diagnosed at the age of 4, the whole eye stuff definitely scares me. I hope everything works out for you.</p> <p style='border: 2px solid #FF0000; background-color: #FFFFE0; padding: 10px;'><b><em>The highlighted text from comment 1 is a verifiable claim since it contains a strong claim from the doctor that there is no prevention/treatment for vitreous floaters. So you should highlight it.</em></b></p><hr /><h4>Example 2:</h4><p><strong>Post:</strong> How do you have an oral surgery?</p><p>I was diagnosed last four months ago, but I’m supposed to have an impacted wisdom tooth taken out and I’m terrified. How does that work?</p><p><strong>Comment 1:</strong> <span style='color:red;'>I have been conscious every time. With a wackload of freezing. Wisdom teeth (2 impacted), pulled infected molar/implant install, root canal and crowns. The infected tooth was the worth. Everything else was not too bad, just the sound of them breaking up the bones for the impacted teeth or having it pulled it really weird.</span></p><p><strong>Comment 2:</strong> I removed all my 4 wisdom teeth and I didn’t have to do anything different on my routine. <span style='color:red;'>It’s a pretty straightforward surgery.</span> One of mine were infected and twisted so it took a while maybe 2 hours and recovery was painful and slow. Other 3 were around 30 mins and easy peasy recovery. I didn’t find my T1D influenced in any part of the procedures.</p><p style='border: 2px solid #FF0000; background-color: #FFFFE0; padding: 10px;'><b><em>The red text from comment 1 is a personal experience and not a verifiable claim. So you should not highlight it.</em></b></p><p style='border: 2px solid #FF0000; background-color: #FFFFE0; padding: 10px;'><b><em>The red text from comment 2 is <strong>NOT</strong> a verifiable claim and it is just a claim that cannot be fact-checked. So it is not relevant to our case and you should not highlight it..</em></b></p><hr /><h4>Example 3:</h4><p><strong>Post:</strong> Can mismanaging diabetes cause a puffy face?</p><p>My partner was diagnosed t1d 2 years ago and has struggled at times to manage her diabetes. She’s always been a very slim person and had a very prominent jaw line until she got sick and eventually diagnosed. Her face hasn’t looked the same in years. Of course, I would never say anything. But she has mentioned the change in her face to me many times before. She’s mentioned it to doctors. They have suggested it could be mismanagement or maybe even a skin issue as she has a rare type of eczema. Lately she’s been managing just fine and even started using a face cream to treat rosacea. But it’s made no difference. Is mismanagement really the cause?</p><p><strong>Comment 1:</strong> <span style='background-color:green;'>It can. My doctor can tell if my A1c went open just by looking at my hands (they tend to swell well before anything else on me)</span></p><p style='border: 2px solid #FF0000; background-color: #FFFFE0; padding: 10px;'><b><em>The highlighted text from comment 1 is a verifiable claim since it claims that mismanaging diabetes can cause a puffy face and the doctor can notice it just by looking at the hands. So you should highlight it.</em></b></p> <p>You always can check the annotation codebook from the link on the top of the page.</p>"]}