{"id": "15nz7pt", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can someone a bit smarter than me help me out!?\nHii! I’m just wondering if anyone can give me an answer as to why sometimes, I take a correctional dose before bed and it takes SOOO long to absorb into my system? Im pregnant (36w now) if that’ll help anyone figure this out for me! Is it something to do with combatting hormones in my body? The insulin still ends up working, but it takes 6 hours to absorb completely! I was under the impression novorapid’s effects stop around the 3-4 hour mark. It’s mainly an annoyance more than a concern, thanks for any answers lol. Type 1 pregnancy is a wild ride so I understand if nobody can answer this burning question xD</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I’ve (male, not pregnant) noticed this at times with novorapid too. Haven’t really figured out why, but sometimes I wonder if you take a small amount, if it takes longer to move from the small depot formed under the skin and into the blood stream. How much are you taking for this correction?<br><br>\n  <b>Comment 2:</b> Going to bed can make us more resistant to insulin. Lying still, with a lower heart rate is a recipe for slow absorption.<br><br>\n  <b>Comment 3:</b> I have the same issue, for me I find splitting my injection in 2. So if I'm doing 4units I'll do 2u in one spot and 2u in a different spot. Seems to make it \"activate\" a bit quicker. \nNot giving advice, just saying what works for me.<br><br>\n  <b>Comment 4:</b> I’m about a week behind you (35w) and the same thing happens to me! I’ve attributed it to lack of blood flow when I lay down from all the extra weight/baby taking up so much room. Also you have so many hormones in your system right now (as I’m sure you’ve already noticed 😂) that insulin just sometimes won’t work.<br><br>\n  <b>Comment 5:</b> Does it eventually work? Or are you requiring more and more to get the same correction?\n\nIf it’s a normal dose but just taking longer, not sure what to think of that. If you’re just requiring more, during pregnancy the placenta produces human placental lactogen — a fancy way of saying a hormone that makes you more insulin resistant. Especially during the third trimester — your insulin requirements can be up to 2x normal. It’s cool in theory — it allows the fetus to get more glucose by preventing mom from stealing all of it, but obviously not good for T1D mommas.<br><br>\n  <b>Comment 6:</b> This is gonna sound so stupidly simple, but taking a short walk after bolusing helps absorption - tremendously! And if you haven’t checked out yet, I invite you to visit r/Bumperswhobolus<br><br>\n"}
{"id": "14tk3g4", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can't get my T1D MIL transitional care because she has insulin pump\nSo my MIL is 64 and has had T1D since she was 5 and has been in great control using a dexcom and tandem pump for years. She recently fell due to some other health issues not related to her diabetes and she has been hospital for a few weeks. We are trying to get her into a skilled nursing facility for muscle strengthening before she is able to come home (house has a lot of stairs). The problem we are running into is that the facilities near us won't take her because she has an insulin pump. They said they would take her if she disconnected her pump and they did finger pokes and shots for insulin. My MIL is mentally still sound and able to make decisions about her diabetes with no issues, so we are concerned about her diabetes being in worse control if she doesn't have her pump. She really does need physical care due to the fall she had, so right now she is stuck at a hospital (mind you the hospital is totally fine with her using her pump). But obviously we don't want to have her at a hospital when she doesn't really need to be there. \n\nJust frustrated and looking for support or if anyone else has any advice on this kind of situation.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Most skilled nursing and rehab facilities have no idea what type 1 is. The will likely mess her up and she’ll end up in a hospital again. Your hospital should have a social worker who is looking into all the local facilities.<br><br>\n  <b>Comment 2:</b> Def access her endo and/or CDCES for assistance in finding the best local facility 🤞💙<br><br>\n  <b>Comment 3:</b> I truly hope you find the best situation for her, and her pump! Someone mentioned a social worker so that may be a good resource. \n\n\nAs an aside, as I’m falling quite into middle age, I can honestly say this is a question that comes to my mind often-if I end up in a senior home or care facility one day, I don’t know how I’d manage if someone took away my pump or my self care whether or not I had my mental faculty: I’m working on how to plan for this eventuality and I don’t want the route of someone who doesn’t know (medical staff I mean you) the difference between T1 and T2 (Kept at high levels and insulin given on some medieval sliding scale which makes your health fail).\n\n If I have my mental faculties and the ability to keep my pump, or even cgm plus injections but I was managing that on my own, then I’m fine with that. Im not fine with any other option. \n\nYour post has brought up a good question for all T1’s who will get to be seniors one day. This is why a advocacy is so important-advocate for those who cannot. Please keep us posted and use whatever resources you can get to help her stay safe and pumped.<br><br>\n  <b>Comment 4:</b> Would you take away her eyeglasses? Or a hearing aid? Or heart medication? ( you see what I’m saying.) Keep looking for a rehab facility. Maybe her endo can help. Congratulations to her for getting through the past 60 years in good health.<br><br>\n  <b>Comment 5:</b> Reach out to case management at the hospital. They are the ones with a vested financial interest in getting her into transitional care. They will also be much more intimately familiar with all the local rehab centers requirements for more advanced care restrictions, etc.<br><br>\n  <b>Comment 6:</b> It might be worth asking if they have a legal document or disclaimer that she can sign to state that she will be managing her diabetes herself and will take full responsibility for the management of it and any consequences that arise from it. I've had to sign a form a few times to say I'm self managing my diabetes in hospitals.<br><br>\n  <b>Comment 7:</b> We have had similar issues with my 70yo T1D father. He doesn't use a pump but does use dexcom. The rehab facility insisted their staff give injections. They also wouldn't accept the dexcom reading (the hospital did) and insist on finger sticks. They had his blood sugar over 400, he was really upset. Eventually they came to an agreement that he can do his own injections and determine the amount. But it's supervised, the supplies are locked in a box by his bed, he cannot access until they bring the key.<br><br>\n  <b>Comment 8:</b> \"Most skilled nursing and rehab facilities have no idea what type 1 is.\" Totally agree! And also add that most non-endo physicians and hospital staff know ZERO about T1D. They all think it's a prick and a pill or their own insulin shot if you insist! It's key that her endo gets involved and advocates for her devices to save her life.<br><br>\n"}
{"id": "ozo2o7", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to avoid nearly dying when drinking\nHi y'all I'm planning on going on a little bender this weekend for the hell of it but last time I did this my blood sugar went wild. Any tips to avoid?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> If you guys have a designated person usually they love doing all this medical stuff atleast my friends do hahaha. I usually tell them to give me 2 shots if my sugar is over 12 cause trying to stay tight never works.<br><br>\n  <b>Comment 2:</b> Check your blood sugar as often as possible. \n\nHave something to correct a low. Have at least one friend around who knows how to recognize and treat a low or severe high.\n\nBe willing to run a little high if necessary. A drunk night at 180-200 is better than risking a devastating low.\n\nBut really staying aware of your readings is most important. Even if you barely remember the next day, a low or high reading is probably going to trigger your drunk mind to either eat or bolus/inject as necessary.\n\nETA: Also consider what you’re drinking. Alcohol is different for everyone. For me beer raises my blood sugar, hard liquor has no impact (unless mixed with a sugary drink), and wine seems to lower my blood sugar.<br><br>\n  <b>Comment 3:</b> i personally avoid carby alcohol like beer and wine. if i go for cocktails, i dont give any insulin as the alcohol content will lower me while the sugar in the mixers will keep me higher.\nif mixing a spirit and diet mixer i make sure to keep snacking through the night (like small crisps or something)\n\nmake sure there's someone with you who knows how to look out for a hypo in you and keep checking sugars often.\n \ni went out the other day for cocktails but still had to suspend my basal a few hours later as the alcohol made me drop quite quick so watch out for that as well<br><br>\n  <b>Comment 4:</b> My nurse told me that after a night out, I should eat junk food and not shoot insulin for it. Works for me, but I only got really drunk a few times after diagnosis. Covid etc.\n\nLiver burns sugar when getting rid of alcohol. And it's too busy with the alcohol to release sugar to compensate for a low.<br><br>\n  <b>Comment 5:</b> I know this will get downvoted because it’s not what you want to hear, but you could try moderation. Just one or two drinks. \n\nYou could offer to be the designated driver! \n\nThat is the only sure way to drink safely as a person living with t1d. I learned that the hard way when I was in my 20’s. It’s been 20 years since I was drunk or high. I don’t miss it. At all. \n\nDon’t get me wrong, I still enjoy beer, wine, and the occasional high ball, but inebriation is just not an option. Gotta stay in control, you know? \n\nBe safe!<br><br>\n  <b>Comment 6:</b> Eat before. Test lots. Make sure you have a snack before bed (this one is the most important). From my own experience, I bolus for the first two beers max, but then don’t for any more. I usually stick with Gin and Soda as that keeps me stable, but after 5 I will start to trend down. Even if my sugars are on the higher side (8-9), I would have a peanut butter sandwich with no bolus before sleeping so that I don’t go low. \n\nWatch out for lows the next day! I usually only need minimal basal if any. Which is nice, especially if you want hungover chinese food.<br><br>\n  <b>Comment 7:</b> Eat<br><br>\n  <b>Comment 8:</b> Eat a solid meal beforehand. For me protien helps keep sugars up but not super high. 6 hours later is kind of a gamble.\n\nCheck your sugar as often as you can; the more you know the better. But in the end it's better to be high than low.\n\nHaving someone around who knows your T1D in case things go really wrong can be a good buffer. Like if you're getting really sloppy, they can check your BG and at least know you're drunk and not super low.\n\nParty On!<br><br>\n  <b>Comment 9:</b> Never drink on an empty stomach<br><br>\n  <b>Comment 10:</b> 1. Eat before (something substantial)\n\n2. Check sugars every 45-60mins if you remember. Don’t be to far away from quick acting carbs\n\n3. Have someone in the group know you have diabetes \n\n4. Have something to eat when you get home (best to make it before you go)\n\n5. Run sugars high overall for the night<br><br>\n"}
{"id": "102c4vq", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How many T1 diabetics in the world?\nI have seen different numbers been thrown about how many type 1 diabetics there are in the world. Of course, not everyone is diagnosed in time, some countries may not provide reliable statistics, etc. But it would be interesting to hear whether it is more like 5 million or 50 million. Surely someone has a pretty accurate estimate.\n\nDoes anyone have any believeable numbers? I have not been able to find any.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I'm here, checking in, so.... 1<br><br>\n  <b>Comment 2:</b> [https://www.news-medical.net/news/20220921/e2808be2808be2808be2808be2808be2808be2808bGlobal-burden-of-type-1-diabetes-likely-to-double-by-2040-study-predicts.aspx](https://www.news-medical.net/news/20220921/e2808be2808be2808be2808be2808be2808be2808bGlobal-burden-of-type-1-diabetes-likely-to-double-by-2040-study-predicts.aspx)\n\nedit: the google search to find out how many people have a condition is to use the word \"incidence\" so I searched \"incidence of type 1 diabetes globally\"<br><br>\n  <b>Comment 3:</b> I believe there are even dozens of us!\n\nHonestly don’t know, if we’re approx 5% of all people with diabetes then I’d find if possible a global average of “diabetes” and use 5% of that number. It’ll be impossible because no country has an exact count of type 1’s, and most data is lumped into all types.<br><br>\n  <b>Comment 4:</b> Approximately 34.75 million, give or take. That's taking the global diabetic population and multiplying by around 7.5%.<br><br>\n  <b>Comment 5:</b> Internation Diabetes federation indicates that 537,000,000 have diabetes and !0% of those are type one as of 2021. They have a lot of great info/stats on their site. \n\nhttps://idf.org/aboutdiabetes/what-is-diabetes/facts-figures.html<br><br>\n  <b>Comment 6:</b> About 10% of all diabetics is type 1, so that would make about 54mln in total worldwide (based on that IDF number).<br><br>\n  <b>Comment 7:</b> I don't believe them 100% because some people are misdiagnosed as type 2 when they are type 1 just because they are adult onset but they don't do the C-peptide test unless you ask.<br><br>\n  <b>Comment 8:</b> 8.1M<br><br>\n  <b>Comment 9:</b> Quality and availability of care in developing countries means that you can't calculate the number of type 1s based on total cases of diabetes. Most type 2s will survive for decades without medical intervention. I found a factsheet by the International Insulin Foundation that says that only 1% of children with type 1 currently survive 6 years in sub-Saharan Africa.<br><br>\n"}
{"id": "ynak1s", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can a low make you vulnerable enough to get high off of weed fumes?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Not likely.  Just sounds like a hypoglycemic episode.<br><br>\n  <b>Comment 2:</b> Sometimes lows do be that way.<br><br>\n  <b>Comment 3:</b> No. You should smoke some weed and you’ll see the difference<br><br>\n  <b>Comment 4:</b> There’d have to be a bunch of reggae fans with their hippie friends sitting at that table all smoking their blunts and collectively fogging up the entire joint (ya, pun intended) before you’d be at risk of 2nd hand highs. Sounds like you’ve dipped super low.<br><br>\n  <b>Comment 5:</b> Hypoglycaemia can result in behaviour that resembles drunkenness.<br><br>\n  <b>Comment 6:</b> It sounds like you got super stoned for the first time. Low BG for everything I've tried always hits me harder, or makes the trip way weirder.\n\nSource: am stoner<br><br>\n  <b>Comment 7:</b> Nah no chance. Although I regularly smoke weed and when I’m hypoglycaemic, the mind altering affects are WAY stronger than weed for me lol. Hypos are the real one<br><br>\n  <b>Comment 8:</b> I'm taking a bong rip for every downvote<br><br>\n  <b>Comment 9:</b> You literally described the symptoms of hypoglycemia. No, you weren’t high.<br><br>\n  <b>Comment 10:</b> Lol yes you can get high even if you’re low blood sugar<br><br>\n"}
{"id": "1bpwmkp", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to prep for physical activity/vaca\nMy kiddo is a teenager with newly diagnosed T1D. We're going on a previously planned vaca that will include sight seeing, walking around in towns and cities, and a couple days at a remote cabin with all day hiking/climbing/swimming in a national park. The cabin has facilities & a refrigerator. My child still wants to go and the Endo team told us we should absolutely still take the trip. \n\nI know we need to bring a lot of diabetes supplies for the trip (was planning on 150% to 200% of what i think we'll need, including both the gvokes we have), and I know we get an extra bag for med supplies which can include food. Also know kiddo needs to have high glucose when we set out in the a.m. for a physically active day (hiking), and we need to have lots of fruit, Gatorade, candy/quick sugar on hand all day. We are a sml group and can set our pace to meet my T1D's needs. Kiddo won't have a pump yet, but does have a cgm. I'm thinking I'll set the cgm so it alarms a low warning at 75 or 80 so we can catch it early.\n\nWhat else can you think of? Any suggestions?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> When I was young (dx age 13, 72 now) the endocrinologist said I shouldn't be afraid to make small changes in my insulin dose ahead of physical activity. Back then the insulins were different but the idea is the same.  Consider reducing the long acting dose (basal) and even eliminating or reducing bolus dose for all day outings. Be aware if the outdoor activities are such that they are a \"stress\" you may see blood glucose rise due to epinephrine > hepatic glucagon >>> glucose. Given the lag between sensor interstitial fluid glucose reading and actual blood glucose (up to 25 min.), set the alarm to no less than 80 mg/dL and, more importantly, make decisions based on the trend so you can intercept lows before they occur. Once you have a pump, this will be easier to navigate but still requires mindful choices (not mindless).\n\nMy sensor transmits to iPhone and I can see the reading and trend on Apple Watch. This makes an all day hike or bike ride a cake walk without hypoglycemia drama. Regarding food on an all day adventure, I always carry several peanut butter and jelly sandwiches so I don't have to \"feed that dumb \\[injected\\] insulin\" with candy, glucose, juice...\n\nWith Joy and Radiance, Live Long and Prosper<br><br>\n  <b>Comment 2:</b> Low warning earlier definitely is a good idea. For hiking I might consider even a higher alarm. For me personally this type of activities needs just extra carbs in between, so I might already eat my banana when I see I am trending in the lower hundreds. \n\nI would also reduce the basal around 10-20 percent and the bolus dose I would probably reduce even more drastic. Also after a day of activity and in the night less insulin would be needed. There is only trial and error to collect the needed experience but in general I would be quite conservative in my experiments. A higher level can be corrected easily with all the hiking and activity happening.\n\nDoubling the equipment is a good idea, I would also do it like this.<br><br>\n  <b>Comment 3:</b> I am also new to this… do longer acting carbs ( beans/pasta) first thing in am help with lows after activity or no carbs so no bolus given, therefore activity is being done just on basal?<br><br>\n  <b>Comment 4:</b> I used to work at a diabetes camp that did teen sessions with both hiking and multi day backpacking sessions in the high country, kids did fine! You don’t need to start the day high, just maybe slightly elevated, like 150. \n\nThings to consider: \n-you’ll most likely need to significantly decrease basal insulin by at least 1/3. Maybe even 1/2 if you’re hiking all day. Check with a CDE or your endo’s office. \n\n-take breaks while swimming, try to check blood sugar every hour. Make sure they have candy in a waist pouch/dry bag or something similar if your kid is swimming out into a lake or will be far from shore. \n\n-definitely print out some logbook pages/log in some way and try to write down all food and dosages so you can see how dosages are working, and be prepared to adjust as needed.\n\n-exercise can cause lows at night, so make sure your teen has low supplies by their bed, and make sure you’ll wake up if low alarms happen. \n\n-plan on having snacks without taking insulin, prepare with lots of low blood sugar supplies.\n\n-bring a cooler if you’re at the beach on the lake, to store insulin pens. Frio pouches are good for hikes if you’ll be somewhere hot. \n\n-will you be at altitude you’re not used to? Your child’s body will be working harder just to acclimate, so you may need to adjust basal based on that alone. If kid gets altitude sick, give them regular sugar Gatorade or sugar cubes to suck on. \n\nWould also highly recommend a week at a diabetes camp this summer, depending on your kid’s age! It can really help both technically (dialing in dosages) as well as socioemotionally.<br><br>\n  <b>Comment 5:</b> I find granola bars are good for when you’re super low - gets me up faster than any candy etc. \n\nYou’ll be fine. Sounds like you’re well prepared. It’ll get easier, trust me. I’ve traveled the world with type 1. A few crazy episodes but most of it was avoidable. Just have fun. And always bring more for lows than you think you’ll need. Have everyone with you being something (granola, gummies, glucose tablets etc). Nothing scarier than being in the middle of nowhere and realizing your blood is low and you got nothing. Extra, always. \n\nGood luck.<br><br>\n  <b>Comment 6:</b> Test more, carry snacks, you got it. You got the right idea setting the envelope higher on your cgm too. You'll probably want to spike the bs harder starting out, but you can shrink that pad as time passes and everyone gets more experience of what to expect in terms of how much drop associated with what kind of activity.  (Remember protein with snacks slows stuff down.)\n\nNot too much else going on. Remind the kid they can set their own pace. Remind them to have fun too. \nI hated the adjustment of having to do medical shit when I worked out, but i got used to it. \nThey can do most things that they want to, they just might have to make small adaptations.<br><br>\n"}
{"id": "1ccjjgl", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Candy for low blood sugar spells?\nThe doctors are still trying to find out what’s wrong with me but I go through times where i get super dizzy and my blood sugar drops. I’ve been keeping different candy’s on hand but I read that if you eat too much sugar that’s also bad. So i was wondering if anyone could share certain candy y’all eat for the spells and how many pieces? (Ex: 6 Swedish fish, 3 starburst, etc.)\n\n17F\n5’0\n77 lbs</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> 3 mini tootsie rolls (15 carbs) does it for me<br><br>\n  <b>Comment 2:</b> I eat 1 Fruit-to-Go bar. No counting while my brain is not at full capacity.<br><br>\n  <b>Comment 3:</b> Skittles are about 1g per and easy to count.  I stick to 15g if actually reading low and wait 15m before eating anything else, unless I know I missed.<br><br>\n  <b>Comment 4:</b> You really can’t figure this out yourself? Whatever candy you have just read the nutritional info and have the usual amount of carbs you have to treat lows..<br><br>\n  <b>Comment 5:</b> I usually use two SweetTarts or one HiChew. 2-4 grams of carbs is usually enough.<br><br>\n  <b>Comment 6:</b> Get a decent scale, and test in a flat daily moment. \n\nFor me each gram of sugar raises my BG x5 the weight, so 2 5g candies ( 10g total ) raise my BG roughly by 50mg/dL within 30 minutes. \n\nFor me, whenever I'm 85 trending down, that means it's time for a candy to keep it in range. \n\nIf you can find dextrose / fructose candies, that's always better than sucrose.<br><br>\n"}
{"id": "s2a099", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How did you find out your kid had diabetes? What were the symptoms and what were the sugar levels, etc.? I’m worried about my 4 year old</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Talk to your kids pediatrician. If they are having any symptoms, it may not be diabetes but may be just as serious.<br><br>\n  <b>Comment 2:</b> The symptoms of high blood sugar can be numerous but just vauge enough that they can be confused with other maladies or sometimes just normal ups and downs of kids.\n\nBut in general, they present themselves in the following ways:\n\n1. Thirst, often extreme. Kids being kids, their first intinct will often be to reach for a sugary drink to relieve the thirst, which makes it worse\n\n2. Frequent urination (sometimes, but not always, the urine will have a mildly sweet aroma)\n\n3. Fatigue, often extreme\n\n4. Headaches\n\n5. Feeling warm/sweaty without enviornmental trigger\n\n6. Ravenous hunger, often times not helped with food.\n\n7. Unexpected weight loss or inability to gain weight\n\nThese will often worsen or become more obvious as sugars move higher. In the most severe cases, diabetes needing immediate medical intervention will present with vomiting, shallow breathing, woozy ness, etc.\n\nIf your child has several of these symptoms regularly, then it would be wise to check with your doctor. It doesn't necessaril mean diabetes, but it could be or any other number of treatable conditions.\n\nFailing that, most drug stores now sell over the counter gluconeters and test strips that are not absurdly expensive and do not require a prescription. You can use one of those to check your kiddo's blood sugar a few times (make sure to read up on proper testing procedure first).\n\nIf their fasting glucose (not having esten for 8 hours) is under 70 or over 120 or if their post meal glucose is over 170-180, then that is awarning sign something is up and it's time to see the doctor immediately.\n\nBut beyond that my advice would be... don't panic, regardless of what you discover via symptoms and/or testing. They may be diabetic. They may very well not. But even if they are, while it isn't fun and presents many challenges, it is treatable and manageable. And as a parent you are doing the right thing and asking the right questions by checking now.<br><br>\n  <b>Comment 3:</b> I was 3. Very thirsty and peeing constantly for me<br><br>\n  <b>Comment 4:</b> With BG at 89, I’m not sure why you are worried about type 1 diabetes. Increased thirst and urination in t1d comes from BG being very high and your body trying to flush sugar and ketones.  If concerned (like you are)  I would always check with your doctor. I am not in the medical field or even qualified to give any advice, but I personally don’t see anything to be concerned with.  89 is an extremely healthy normal level for a child.<br><br>\n  <b>Comment 5:</b> Does he crave juices sugary snack and high carb foods? Has he lost weight? Those are big signs.<br><br>\n  <b>Comment 6:</b> I dropped 10 pounds in 2 weeks and would drink 2L of apple juice in a single go. Thats how i found out.<br><br>\n  <b>Comment 7:</b> I was diagnosed at 4. My mom said I used to be really bad with taking naps, never wanted to take them. One day when she went to put me down for a nap I was out. My grandmother mentioned it may be diabetes. Sure enough my mom took me to the doctor and I was diagnosed.<br><br>\n  <b>Comment 8:</b> When I was 10 I developed diabetes - extreme thirst, black coloring on tongue were two symptoms I remember, other than the couple days before where I felt sick as shit and eventually passed out<br><br>\n  <b>Comment 9:</b> My son was diagnosed at age 9. For several weeks before diagnosis he had a sweetly sick smell. At first I thought he was getting sick, since I would smell it before he had a sinus infection. His skin was super dry for 6 months. He started drinking water all the time, and peeing. He was always always hungry. And he was always tired. Then two nights in a row he pees in bed while sleeping. He had never done this. So then the third night I get him up to use the bathroom. But the following night he does it again. I googled the peeing in bed part, and it mentioned type 1. The next day his pediatrician orders blood work. Then we get it done the next morning, a Friday. And Saturday morning the doctor calls me telling me to get him to the children's hospital as quickly as possible. I apologize for the long answer 😅<br><br>\n  <b>Comment 10:</b> Kid was 4.  Constantly thirsty.  Constantly peeing.  The real banger is when I weighed and and she’d lost like 8% (I weighed often as I was shopping for new car seats.).if you google those symptoms you get diabetes. As we have a T1 friend we did a fingerstick and were like 380.<br><br>\n"}
{"id": "eyqw0v", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to better regulate sugar levels??\nNeed some advice for my brother. He is type one and having issues with keeping his sugars stable. Wakes up low, takes forever to come up then shoots high, tanks, shoots high. What can he do to keep his levels better sustained throughout the day? Diet plans? Exercise routine thats good? Anyone have anything theyve done that improved the struggle any?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> New to this, sorry if this is such an obvious answer question!<br><br>\n  <b>Comment 2:</b> Is he manually chwcking or does he have a cgm? I struggled checking manually, having the cgm leaves no room for guessing and has helped me take ownership of my levels in real time, rather than catching up, reacting late.\nAlso, I have realy started to focus on keto, as much as possible. I swap a lot out with cauliflower;pizza crust, rice, noodles, tator tots, etc. And have learned to love veggies more in general. Takes training and I am NOT a health nut.<br><br>\n  <b>Comment 3:</b> If he's waking up low then he needs to either eat more before bed or he needs to lower his nightly basal. He doesn't need to be on a diet, just eat well balanced meals. Has he gone through a type 1 diabetic class offered by the hospital? Also, if he's going low and then shooting high it means he's over correcting his lows- which is sometimes unavoidable but I'd tell him to get some glucose tabs and figure out what his ratio is to get him to a normal level. Everyone is different - so let's say he's at 64 - one person might need just 1 glucose tab to get them back in range while another person may need 2. After taking the glucose tabs he'll still want to watch himself until he's at a normal level because if he's dropping rapidly he may need more glucose tabs than normal. Also, staying hydrated can help keep sugar levels in range as well.<br><br>\n  <b>Comment 4:</b> Record blood sugars for a week.  Consult with endocrinologist.\n\nCould be as simple as his basal rate being too high.<br><br>\n  <b>Comment 5:</b> This is pretty common. It USUALLY starts when you overcompensate for a low blood sugar. For most Lows you only need 10-20g of carbs however, because your brain is telling you THIS IS AN EMERGENCY YOU ARE STARVING TO DEATH, people go overboard and eat WAY TOO MUCH. Then over a couple hours, blood sugar will rise. Trying to get the high to come down quicker, you'll take too much insulin and crash in a few hours and the cycle starts again. \n\nHe prob needs to lower his morning basel rate, stop that morning low and you'll stop the whole cycle. \n\nExercise and diet do help. But everyone is different so you'll have to see what foods effect his blood sugar. Generally speaking, high protein/fat foods paired with carbs can stabilize blood sugar (eggs and toast/ peanut butter and honey)<br><br>\n  <b>Comment 6:</b> A big problem with T1DM is that the sugar goes high and doesn't come down.\n\nHe needs to eat smaller, more frequent meals.\n\nAnd he needs to balance fat and protein with the carbs - which goes against what we've told everyone else for 50-60 years. Ironically, a croissant coated in fat and oil, with an egg, is better than a lone slice of bread.<br><br>\n  <b>Comment 7:</b> T1D here since 2011.    \nThis is a pretty common issue (one that I'd had myself in the past).  If he's waking up low there's a good chance he's using too much basal insulin.  It's hard for me to speculate further without knowing what insulin he's using, when he's injecting it, bodyweight, etc., since there are many factors that affect appropriate dosage between individuals.  The fact that his sugars take forever to come up strongly suggest to me that his basal dose is too high though.  If you have a properly titrated basal dose your sugars would theoretically be stable throughout the day if you ate nothing, and if you dropped low due to over-bolusing, it shouldn't take more than 10-15 minutes max. to come back up.  \n\nLikewise, the fact that it shoots high is likely due to his over-correcting due to the severity of the hypoglycaemia symptoms.  If it's then tanking again without him injecting more insulin, his basal insulin dose is **definitely** too high.  If he's using a CGM, then it makes it easier, but what he might want to do is fast for a day (no food or caloric drinks - best to avoid caffeine too) and see how his blood sugars move throughout the day.  If they're dropping, then he needs to reduce his basal dose.  Sadly, many endocrinologists and GPs don't try and educate patients on how to titrate their own doses and instead use the limited information on their hands to decide a dose for them - this is ineffective at best, and dangerous at worst.\n\nAs for management in general, and how to keep stabler blood sugars, in my opinion there's nothing better than low-carb/ketogenic eating.  I would highly recommend reading information such as Dr. Richard K. Bernstein's \"Dr. Bernstein's Diabetes Solution: The Complete Guide to Achieving Normal Blood Sugars\" as a starting point.  He's been T1D himself for many decades and is well into his 80's.  I use a heavily modified version of his low-carb routine/protocol to manage my own diabetes, and I can honestly say that it has saved my life and health.  I have stable and relatively normal blood sugars (a1c of 5.8 and dropping) and I use very little insulin to manage it, which helps to avoid large errors and swings.  It's hard to get into all the details of how to properly figure everything out, since entire essays (and indeed books) can be written on it, but yeah, that book is well worth the 10-15 bucks it costs on Amazon.  I've never felt as healthy as I do now with near-normal blood sugars.\n\nApologies for the long reply, but best of luck to you and your brother!  Feel free to DM me if you want more details etc.<br><br>\n"}
{"id": "17jc1rp", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can Type1s take Codeine without any issue?\nWas reading the back of a medication box (Paracetamol + Codeine) and it says to contact your doctor if you are diabetic, it doesn't say if it's specific to type 1 or type 2, I can't find anything on the internet to say there would be an issue and my only option at this time to contact a Dr is to hop on over to A&E and I'm not doing that..\n\nSo am I good taking this or is my pancreas gonna like explode or something?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Do you use a CGM? I avoid anything with paracetamol as it gives me false highs and then my closed loop pump will start correcting and cause a massive hypo. If I'm desperately in need of painkillers though I'll take the pump off auto mode for a few hours and test my BGLs with a fingerprick. \n\nI didn't know about this until my nurse flagged it!<br><br>\n  <b>Comment 2:</b> Definitely not a professional here, but they put that warning on a lot of things out of overcaution more than anything else. I've had it prescribed more than once, and looking it up I am not seeing any real contraindications connected to diabetes for either codeine or paracetamol. The only possibly related warning I can find is for people with kidney problems.\n\nThe paracetamol can mess with CGM readings for some people, so maybe that's what it is. I think that is more of a Dexcom issue, but I'm not sure. I have to take it pretty regularly, and it has never seemed to affect my Libre 2 readings at all.<br><br>\n  <b>Comment 3:</b> No clue why thats there. T1 for 31 years and never heard that once. Perhaps your country labels things like they do in California. Everything has risk of cancer. Anyways no clue. Use CGMS too etc etc.<br><br>\n  <b>Comment 4:</b> Lots of folks have been talking about the paracetemol, but I suspect the warning's more about the codeine. It's fine to take, short-term, but do be aware that it is likely to raise your blood sugar while you're on it.<br><br>\n  <b>Comment 5:</b> I have taken Codeine post-surgery before and had no problems. Just keep an eye on the blood sugar and treat accordingly if necessary.<br><br>\n  <b>Comment 6:</b> In general, it means it can mess with your sugars (or readings if you use a CGM, so use finger sticks to confirm)..<br><br>\n  <b>Comment 7:</b> I've taken these before and had nothing go wrong, but I didn't take them very often when I did. In my experience, no problems, but can't say about long term<br><br>\n  <b>Comment 8:</b> Opiates make me go low<br><br>\n  <b>Comment 9:</b> When I take Codeine, even if I take it with food, I am seriously nauseous all day. It makes it difficult to avoid lows unless you have something like ginger ale on hand.<br><br>\n  <b>Comment 10:</b> You can get hypos easier if getting high on opiates. Taking them in therapeutical dosages should be ok.<br><br>\n"}
{"id": "v544ew", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to help with lows while \"off the grid\"\nMy husband has type 1 and on our day to day we are a great team with managing his numbers. Soon, we are going on vacation to a very remote area with spotty cell service and will be hiking. I am getting very anxious because we have 2 youngish kids and a dog we are also taking and recently my husband has been experiencing quick drops and his CGM says he is in the 50s and sometimes 40s (his meter usually reads a bit higher). I am getting really anxious that something will happen while we are in the woods and I will not be able to help him (and the kids). I always have a \"crash stash\" and glucose tabs with me but these crashes have been happening so fast I am scared even after he corrects it will take to long to get back in range.\nDoes anyone have any advice or tips for this situation? I think I am especially nervous because early in our marriage we were on a hike and we ran out of the crash stash and he was losing his vision and stumbling and there was no one but me to help. Obviously it worked out fine but the anxiety surrounding this trip is extreme. I think having a solid plan in place will help. My husband keeps saying he will be fine and that he will tell me if he is dropping but I need a more concrete plan. Sorry to ramble on!</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> For me, hiking is a sugar drain and I have to adjust basal and lower my carb to insulin ratio.  If you are going to a higher elevation, that is going to make a difference as well   For emergencies, I recommend that you get a prescription for glucagon or something like it.  You can administer it for emergencies and will take him out of extreme low pretty quick.  Before going on the hike, get to know this stuff and how to administer it so you don't feel panicked and have to try to read the tiny print on how to use it!  I think there is an inhaled one now but I haven't had to use it so I don't know much about it.     \n\nHe will likely be fine but I have used this for a family member who also has T1, it's good to have on hand even when not going out off the grid.  It's literally a life saver!  With this in your pack at all times, you will have less to worry about, so you can enjoy more of the trip!<br><br>\n  <b>Comment 2:</b> Honey would be a great addition to your supplies. As well as the glucagon.<br><br>\n  <b>Comment 3:</b> In addition to the other tips, maybe for hiking, he could raise his low alert to warn before he’s low. I have mine at 75 during the day, so I can prevent a true low before it happens. For hiking, and quick drops, maybe a little higher than that would help.<br><br>\n  <b>Comment 4:</b> Decrease insulin/basal. Err on the side if high BG; for a few days with limited food I'd rather be 150-180 mg/dL than struggling to keep BG up. As mentioned above raise the \"low\" alarm. Eat food *before* you actually get low. Timing if food intake is just as important to BG management.\n\nVariety of sugars, quick acting stuff (gummies, liquids) and slow absorption whole wheats, protiens, etc. True preparation is at 50 - 100% more than you think you'll need. \n\nGlucogon can be used as a last resort if someone is unconscious, less risky than honey under the tounge or similar.\n\nCurious how this goes. Good on ya'll for getting out there with the family. The extra work of proper T1D managemant totally makes the experience extra rewarding!<br><br>\n  <b>Comment 5:</b> When I go on bike rides, I lower my basal and don't take bolus for food before the ride. For long rides I always take peanut butter and jelly sandwiches and dates sliced open with embedded walnuts.\n\nYou shouldn't need glucagon as it's intended for someone who is having insulin shock/seizure...\n\nLive Long and Prosper.<br><br>\n  <b>Comment 6:</b> Preload with lots of protein and fat. These are forms of long sustaining energy. Using just sugar or simple carbs will result in that roller coaster of blood glucose levels.<br><br>\n"}
{"id": "yalbm5", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Encapsulation\nHow many of you have heard of encapsulation? It is a functional cure for T1D that is in phase 1/2 trials without the need for immunosuppressive medicines. I feel like not many in our community know about this - this is where I put my hope.  \n\nMy apologizes, I am unable to link an article but I would suggest everyone look into it. It is the most promising research at this time.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> It is extremely promising! All things considered, we’re lucky we have technology that we do.<br><br>\n  <b>Comment 2:</b> It's a bit of a \"boy who cried wolf\" situation. I've lost track of how many promising studies and new technologies that have been sent to me. Each one more promising than the last. And each one has led to us still using the same mdi/pump system we've had for years. \n\nThe meme of a cure being just 10 years away has been around for decades. And a decade later, I have no doubt that we'll be here reading about the next promising study that definitely will work this time...\n\nIs it fair for me to judge this one based of the failure if others? Probably not... but thats life. Color me unimpressed until they have real products available for me to use and not just read about in an article\n\nIf I had a dollar for every promising study to cure diabetes, I'd finally be able to afford a pump...<br><br>\n  <b>Comment 3:</b> There was a Viacyte participant on the Juicebox podcast. She couldn’t really talk about outcomes, but she started her experience being a trial participant. Her story inspired me to finish my application for the Radiant trial (which is more about understanding atypical presentations of diabetes, but still a contribution to the future).<br><br>\n  <b>Comment 4:</b> Encapsulation has huge promise. There is two front runners, one in Miami and one in Canada. Encapsulation or gene edited cells will get a cure across the goal line. It’s not far away. Keep the faith 👍<br><br>\n  <b>Comment 5:</b> To the naysayers, we couldn't even grow beta cells properly in a lab 2 years ago. Any \"cure\" will require that at minimum. I don't know what doctors used to discuss when they mentioned a cure previously, but there was no base to start with.<br><br>\n  <b>Comment 6:</b> Have you searched the sub? “I feel like many in our community don’t know about this” and yet the number of posts on the subject (in this and other diabetes-related subs) is far from insignificant. \n\nNot disagreeing with you on the potential of the therapy, and yes, the broader T1 community may be ignorant of the progress being made, but people who are actively engaged In diabetes related online communities are significantly more aware of many things than the average T1D. We also have A1cs that are lower by a statistically significant margin, reflecting application of knowledge gained through participation and exchange of ideas, which goes hand-in-hand with following research and keeping up to date with the latest news/information/ideas.<br><br>\n  <b>Comment 7:</b> I first heard about this years ago (2016) where they were using seaweed to encapsulate the beta cells.  The issue comes down to the same thing, while it works it works well, but you have to be reinjected with new betas cells every 2-3 years, because our bodies destroy the ones we generate.  Like others have said if discovered it will be all over the news, no longer going to read the 100 plus  research papers, to have my hopes dashed again.  I put more hope in the new U-1000 insulin coming first.<br><br>\n  <b>Comment 8:</b> We'll be cured in 2 years<br><br>\n  <b>Comment 9:</b> Seriously I believe we might have a chance one day. If big pharma allows any diabetes to be cured it will be type 1 since only 1 out of 10 diabetics are type 1. They can charge a grip like they do with hep c but much more $$$$$$$ and insurance will pay it because of the cost benefit and big pharma will still have all the type 2's to milk for $$$$$$$<br><br>\n"}
{"id": "tzjazp", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How much do supplies cost for Tandem pump?\nHow much do you supplies cost per month for a tandem pump? I live in Canada and I have been thinking about getting a tandem, the dietician I am working with is concerned I won't be able to afford the supplies. Thanks!</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Fill out the form on Tandem’s website. It’s super easy to find. I did it just a few days ago and I’m already in a conversation with a Tandem rep who is helping me get a tslim and answering all my questions.<br><br>\n  <b>Comment 2:</b> The cartridges are cheap, I have found them for around 43$ for a pack of 10, that includes the syringes. The hitch is you have to have your doctor call in a prescription to wherever your buying them from.<br><br>\n  <b>Comment 3:</b> https://diabetesexpress.ca/\n\nThis is Tandem's partner in Canada. $195+$55=$250. 10 sets will last about a month, but you might need a bit more. Budgeting $300, is probably good.<br><br>\n  <b>Comment 4:</b> I thought Canada paid for things like these.  I thought we were the unlucky ones paying out of pocket in the states.  I guess I’m just more ignorant than I thought 😂<br><br>\n  <b>Comment 5:</b> American here. Surprisingly they cost me nothing. +1 for (really expensive) American healthcare.<br><br>\n  <b>Comment 6:</b> i'm in the US and it's like $400 or something every 3 months, with insurance. obviously not ideal but what can ya do.<br><br>\n"}
{"id": "8w2eok", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How do you act when your blood sugar is low?\nI am living with my SO who is type 1. He is such a raging douche in the morning when he has not eaten. Like he takes on other tasks before eating then yells at me for trivial things. Is this normal? How can I side step this issue in the future?\n\nThanks.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> He might need to have his basal rate changed. He shouldn’t be waking up low. \n\nOtherwise, maybe just like a shots worth of juice will give him enough of a boost to get him out of douchemode and can hold him over til breakfast. It’s quick and easy, I can understand if he doesn’t want to wake up and immediately eat. But some oj is no biggie and a small amount won’t spike his bg too much. <br><br>\n  <b>Comment 2:</b> What are his bg #s in the morning?  When your sugar gets low, things stop making sense.  Your brain isn’t firing on all cylinders, with low bg, and it  can become difficult communicating & understanding what someone is trying to do to help you.  I have “fought” a roommate who was trying to give me juice.  I keep the applesauce packs in a drawer by the bed, the ones that come with a lid and you suck them out of the packet like they make for kids, that helps me get 15g of carbs real quick & that allows me to at least be a active about it and not try to argue and fight over the juice.  Have you explained his behavior to him?  It is frustrating & baffling to us as well.  <br><br>\n  <b>Comment 3:</b> When i was around 60-70 in the mornings, i took 27 units of basal. I lowered it to 25 and it went up to around 80-90. So lower it but be careful. Drinking soda or juice as soon as possible is very helpful, you don't want to go too low for too long.<br><br>\n  <b>Comment 4:</b> T1 here and I can confirm that being low or really high can and does cause sometimes drastic mood shifts, they are terrible. However, with tighter BG control they can be much more easily managed. Talk to him about this in a constructive manner at some point in the day where you are both open to a difficult conversation. \n\nUltimately, it is his responsibility to manage this disease to the best of his abilities and there are hosts of resources available to assist him in doing so. Like I said, this happens to me as well, so my advice is coming from a place of sympathy. I’ve read lots of books on managing T1D and can recommend some of them to you if you like, but he needs to be ready to take on the responsibility of his diabetes which will, in the short and long term, dramatically enhance the quality of his life. <br><br>\n  <b>Comment 5:</b> I agree that he shouldn’t be waking up low, but yeah, the moods are reeeeeal. <br><br>\n  <b>Comment 6:</b> It may not be low blood sugar. It may just me hangry. I will get that way when I have not eaten for extended periods of time. Get him to snack on something when he gets up. It's like those snicker commercials. It's an actual thing! <br><br>\n  <b>Comment 7:</b> Moods are real. I’m a T1. It sucks. My SO deals with it amazingly by not shaming me. I have had the “diabetic talk” explaining how sugars affect me.  And he just knows when and knows there is nothing he can do to change things. I am also the kind where when it happens, I need to deal, let me rant and eat what I don’t want to. It fuckin sucks having your body control you in this way and having to take care of it or you die. That’s the basic underline of the shitty attitude. \n\n\nIf you can deal and let him rant. Deal and that’s great, but it’s gonna be life long and if you can’t, leave. Also, have a convo when things are normal in case he does realize what’s happening, it’s a relational disease, as sucky as that sounds. A lot of T1s (me included) hate acknowledging this bc it’s such a personal and lonely disease. <br><br>\n  <b>Comment 8:</b> Honestly that sounds exactly like how I act when my sugar gets low. Just the other night my sugar was low and I was trying to fix a drawer. My wife came to help and I instantly just got upset with her and flustered with the drawer I wasn't having any luck fixing. Doesn't help that my brain doesn't seem to process anything correctly when I am low either.\n\nIf that is a constant trend he should be able to talk to his doctor and they should be able to help him fix his morning sugar so he isn't always running low.<br><br>\n"}
{"id": "17leuih", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How do I get a second round out of my G6 sensor?\nY’all. I am traveling for work, and I thought I prepared. Alas, I forgot to bring a fresh sensor and it’s on the countdown to expire shortly. I need to get a second wind out of it, until I get back home on Saturday. When I have tried this before, it saw through my web of deception. How can I tell it I’m starting a new one, and re-use the same code? I feel like I’ve seen some of you talk about this hack before. Thank you!</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> You can reuse the same code but wait at least 5 - 10 min before reinserting the transmitter. If you skimp on the waiting it will yell at you.<br><br>\n  <b>Comment 2:</b> Use a test strip and unlock the transmitter out of the sensor.   Leave it out after the sensor is stopped for a good bit and then put it back in and start it like normal using the same code.<br><br>\n  <b>Comment 3:</b> [https://www.youtube.com/watch?v=tx-kTsrkNUM&t=158s](https://www.youtube.com/watch?v=tx-kTsrkNUM&t=158s)\n\nYou'll want to wait 25 minutes between popping out the transmitter and reinserting it. A credit card might be thin enough to pop it out. I've found guitar picks to work very well myself.\n\nAlso, if you can, see if you can get a cheap blood sugar meter at like CVS or Walgreens with a few test strips, because I've found when I do the restart a sensor it reads about 80 points higher than what it actually is, which will then tell my pump to release more insulin than is needed, resulting in lows. \n\nHave you done a manual calibration before?<br><br>\n  <b>Comment 4:</b> Just a warning that popping the transmitter out can be harder than some posts online suggest (at least that was my experience the first time I tried it), especially if it's in a hard to reach place. Getting someone to do it for you could help. Watch some YouTube videos to see how to do it. Good luck!<br><br>\n  <b>Comment 5:</b> Pop the transmitter out. I have found test strips to be the best at unhooking the little clips on the side. That’s your trickiest part. \n\nWait 20 minutes. \n\nPop the transmitter back in. \n\nEnter code. Doesn’t matter if it’s the same code; Dexcom reuses then all. \n\nWait 2 hours. \n\nCALIBRATE THE SHIT OUT OF IT!\n\nIt will be wonky initially, and you may need to beat it into submission to get it to read properly, but it will.<br><br>\n  <b>Comment 6:</b> You don’t have to pop out the transmitter. See the notch the transmitter slides into? Stick something long and not metal between the transmitter and the sensor. Take it out after 25 minutes. The readings will be accurate but you will notice times when you lose signal and it pops back up. Good luck. Use the same code<br><br>\n"}
