{"id": "dcq39k", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can I do A1c bloodwork with low blood sugar?\nJust woke up to get bloodwork done soonish - fasting for 10 hours. Blood sugar is low - 3.4 right now and falling. If I go to the clinic ASAP will they do my blood work with low blood sugar or can I consume anything that won’t affect my fast to raise my bg? Don’t have dex tabs rn. Thanks.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Treat your low. It won’t really affect your a1c. It’s Ana average number over 90 days. Just take care of yourself now.<br><br>\n  <b>Comment 2:</b> A1c isn’t a test you need to be fasting for. Treat the low!<br><br>\n  <b>Comment 3:</b> You dont have to be fasting for just a1c. Definitely treat your low, your dr will understand.<br><br>\n  <b>Comment 4:</b> I have taken it before with high blood sugar and my test for A1C still somehow came back in good standing. But please don't be doing anything with low blood sugar get that balanced please.<br><br>\n  <b>Comment 5:</b> If people could lower their A1C by going into the Doctors office with low blood sugar, we'd all be cured!<br><br>\n  <b>Comment 6:</b> HbA1c, or abbreviated A1c, is not just your average blood glucose of the last 90 days. It’s a little more complicated. It’s actually measuring how much your red blood cells are covered with a sugar layer. So, no even eating a whole meal before an A1c test shouldn’t raise your A1c. If I’m wrong here feel free to correct.<br><br>\n"}
{"id": "1bqkgdg", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to bring up Ozempic when talking to your doctor \nI have an upcoming appointment with my endocrinologist and I want to be put on Ozempic/other brands for weight loss and better control of my A1c. I am 23f and have been t1d since I was 9. I have gained a decent amount of weight in the last 1.5 year half even though I haven’t changed any eating/lifestyle habits that I am aware of. I use a lot of insulin daily for basal and bolus on my Omnipod, and I think Ozempic will help me both lose weight and manage my diabetes better. I am unsure of the best way to bring this up without sounding like everyone else begging for it or being dismissed. I have read mixed reviews, stating that it can help T1Ds but also ones that it can be harmful for them. What is the best way to talk to my doctor about this and what are your opinions on Ozempic while having t1d?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Hey doc. I'd like to try ozempic. <br><br>\n  <b>Comment 2:</b> Exactly like you just did in this post!<br><br>\n  <b>Comment 3:</b> I’m a type 1 on mounjaro. My dr actually recommended it to me to help with peaks after eating. I’m 165 lbs so not really overweight but it has helped me control that also. \nI should add I’m honeymooning so mounjaro has replaced my need for meal time insulin. I’m taking long acting still.<br><br>\n  <b>Comment 4:</b> Bring up insulin resistance more than weight if you think that might be the best angle for you. My endo actually brought ozempic up to me 3 1/2 years ago for weight loss *because I was using so much insulin* that she thought it could only help. In 3 1/2 years I’ve lost 115lbs and it’s truly game changing.<br><br>\n  <b>Comment 5:</b> I took Ozempic for 9 months until I couldn’t find it anymore and then I switched to a compounded Mounjaro. I got it through telehealth because I was embarrassed to ask my endo for it. Ironically when I went for an appt about 3 months after starting, he said “you are the only person today who hasn’t asked me for Mounjaro.” I didn’t fess up to being on it already. He said “just message me if you want to try it. It’s amazing” and while I appreciate that, I don’t think I was THAT fat to warrant him straight up offering but here we are. I’m 53lbs smaller now and no longer obese. 🤣 \nAll that to say, everyone is asking them for it all day long. Just ask!<br><br>\n  <b>Comment 6:</b> I'm on Ozempic, prescribed by my endo and fully covered by my insurance. When I asked her if I could try it, I explained I had great success taking Symlin for about a year a long time ago to help with meal spikes, but it burned like crazy and my legs were so beat up that I stopped. It also had some pretty negative hypoglycemia aspects, which is why it's a banned med for pilots.\n\nAnyway, my endo said she would put all her type 1s on Ozempic if she could, but she doesn't suggest it for everyone  yet because people are still struggling with insurance coverage.<br><br>\n  <b>Comment 7:</b> Two weeks ago I emailed my doctor, asking for help with losing weight. I quit smoking and gained 25 pounds, I was already 20 pounds overweight. She responded she sent prescription for ozempic to pharmacy. That easy<br><br>\n  <b>Comment 8:</b> You have no idea how happy I am to have found this post. I was going to make one just like it and our backgrounds are literally the same. I have been using so much more insulin lately and it is scaring me. I also gained so much weight in the last 2 years and I don't really know why. I have an appointment in a week and hopefully, my doctor is willing to prescribe this for me.<br><br>\n"}
{"id": "bqbktg", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How much does working out help?\nI’ve been living with T1D since I was 16 (23 now) and was always active in high school and even post school, but now that I’m working and married I don’t have much time to work out. I have always been good about my levels I shoot for 130 as a goal and absolutely fall apart if my sugar gets above 230. I feel like I’ve been  injecting so much just to keep it in check. I swear I eat a sandwich and chips and I’m having to take 15 units of novalog just to not sky rocket!  I’m thinking is it because of my body just not breakdown anything because of the lack of exercise? How often should I be going to the gym a week/what exercises? Any help would be greatly appreciated.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Working out definitely helps alot! The more you exercise you can help increase your insulin sensitivity for the hours afterwards and thus you would probably need to be using less insulin per day. However, some people do tend to see BG raises during workouts because of the stress it puts on your body, Id definitely recommend beginning a workout program, starting off slow at 2-3 times per week until you start to get more used to it . It will definitely be beneficial in the long run.<br><br>\n  <b>Comment 2:</b> Working out helps a lot with insulin resistance. I recommend just starting out with cardio. Start with something that keeps your heart rate between 130-160 for 30 minutes to 1 hour. Weight lifting is also good and can actually sometimes increase your blood sugar due to your muscles needing more glucose. As I’m sure you know, routines are a great thing when it comes to diabetes management. If you can work out consistently, that will help too. The most important thing I can tell you is to check your blood sugar before and after a workout. Don’t be shy to even check during your workout. Reach out to a personal trainer for whatever your goal is specifically. But any workout of any kind should help with your problem, good luck!<br><br>\n  <b>Comment 3:</b> Walking 15000 steps a day definitely helps keep my blood sugar in check.  I also eat a vegan starch centered whole foods eating choice.  Processed foods  wreck havoc on my blood sugars.<br><br>\n  <b>Comment 4:</b> An insane amount. Always be in good shape with type 1. If I work out a lot my BS is solid 100 a lot.<br><br>\n  <b>Comment 5:</b> When I work out it definitely helps with insulin sensitivity although I usually have to inject before a workout. \nI also low carb and there is no way on earth that only 15 units would ever even come close to covering a sandwich and a bag of chips! Ditch the carbs! If we already can’t process sugar like normal people why would you put sugar into your body and not expect a disaster?<br><br>\n  <b>Comment 6:</b> So so so much. It is night and day for me. Working out helps with insulin sensitivity and blood sugars but also with the stuff that can come along with diabetes (depression, anxiety, weight issues). I consider my gym membership to be part of my “non-negotiable” must-haves for this reason. I personally work out hard four days a week (Orangetheory) and stay fairly active the other days (long walks, chasing my toddler around, etc.) the other days. The best exercise plan is one you enjoy and stick with over time!<br><br>\n"}
{"id": "usjtul", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to get lower Blood Sugar levels before meals?\nAs you know Blood Sugar is important to maintain in the 80-130/150 range. I heard you shouldn't hit above 180 after you eat ideally. So how do I lower my blood sugars before I eat?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Well it starts off with having good sugar to start with. \n\nWhat also helped me combat this was pre-bolusing. Say I were to sit and eat rice and chicken and take my insulin right then and there, I’ll shoot up right after. However, If I take my insulin 10 minutes before, I start descending which then lets me to eat and keep my sugars stable.<br><br>\n  <b>Comment 2:</b> Having the right amount of basal insulin to start with should help a lot.<br><br>\n  <b>Comment 3:</b> Besides prebolusing long enough in advance and making sure your basal is right, as already mentioned? If it hasn't come back down to where you would prefer to have it before you eat yet, it should be totally fine to bolus a little extra to help cover the difference, for sort of a modified sliding scale type approach. I will do that sometimes, if I need to eat again sooner or the previous meal sent it up for longer than expected.\n\n**Much** easier (and safer!) to judge appropriate timing and so forth with this stuff, if you do have CGM data to keep an eye on. Better when you can readily see when your blood sugar does start going down after a bolus, to start eating then. Definitely recommended for a useful overview: Steven Ponder's *Sugar Surfing*. Taking more that kind of approach has really helped get mine on a more even keel.<br><br>\n  <b>Comment 4:</b> Pregame!! Check your levels an hour before, correct for your sugars. Bolus for your meal before you eat to cancel out the time it takes your insulin to kick in then check about 30-45 minutes after.<br><br>\n  <b>Comment 5:</b> Some foods like that wonder white bread will spike your sugar much faster than insulin can lower it. Look up the Glycemic Index.<br><br>\n  <b>Comment 6:</b> If I understand the question, you certainly can take correction doses as needed, and even wait for sugars to come down before eating/bolusing for food. Of course don't stack insulin or have too much lead time.<br><br>\n  <b>Comment 7:</b> Here is an article shows how to lower your blood sugar levels.\r  \n\r[https://facebook.santhosh.com/article/how-achieve-healthy-blood-sugar-levels](https://facebook.santhosh.com/article/how-achieve-healthy-blood-sugar-levels)<br><br>\n  <b>Comment 8:</b> I tried intermittent fasting and followed the 16:8 and on TMAD or two meals a day. It's a slow process but guaranteed effective. I feel more energized even without eating rice or sweets. Because naturally when you are on intermittent fasting, your energy is fueled by your own fats. Still, I try not to deprive myself and still indulge in desserts that are keto approved. I must say that nutrition and lifestyle change greatly help. May I also add that GLUCONIZE helped me a lot too! It gave me customized solution to diabetes which I tried personally and it worked for me.<br><br>\n"}
{"id": "idjj2i", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How do you all lose weight?\nI’ve tried many different diets for weight loss but I feel like every time I even slightly cut carbs my body is constantly in the 70-90 zone. I’m trying to lose about twenty pounds and I’ve taken up running to help. But still I need to find a way to have a better diet. With out constantly crashing my BG. Could I replace carbs with things like honey?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> The 70-90 zone is perfect. That is nearly exactly where a non-diabetic’s blood sugar resides and a great goal. I follow Dr Bernstein’s Diabetes Solution as closely as possible which is low carb with basically that blood sugar range as the goal.<br><br>\n  <b>Comment 2:</b> Honey is a carb. It's literally sugar.\n\n70-90 is perfectly fine and once you adjust to having a lower baseline, you won't feel \"low,\"\n\nBasically, losing weight is the same as for anyone else; use more calories than you take in. But with diabetes, you have another way to look at it that I've found helpful: Anything that lets you use less insulin while keeping your blood sugars in range will help. Moving more, eating fewer empty carbs and drinking adequate water in combination will help you eventually shed pounds. Add some weight lifting if you want to see an improvement in insulin sensitivity too.<br><br>\n  <b>Comment 3:</b> I did weight watchers for a bit and it worked wonderfully! It kept my numbers in a great range and it helped me lose some stubborn weight. Because of the great options for fruits and veggies that you can have I found that I was able to stay away from going low too frequently<br><br>\n  <b>Comment 4:</b> Have you adjusted your basal down a tad if you’re constantly eating less and exercising?<br><br>\n  <b>Comment 5:</b> You're on the right track! But you have to lower you basal insulin to prevent the blood sugar crashes.<br><br>\n  <b>Comment 6:</b> 👏send 👏yourself 👏into 👏dka 👏it 👏isn’t 👏that 👏hard 👏 jk<br><br>\n"}
{"id": "rp46go", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can't wait for tomorrow. to see what the fuck happens when I sleep .First time using dexom ,been using libre forever. I couldn't get the first one right . random tips are welcomed</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Why did you redact your bellybutton?_ I don't think anyone on the internet is gonna identify you by your bellybutton<br><br>\n  <b>Comment 2:</b> If you sleep on your side, beware of compression lows. Apparently, this happens, when the sensor gets pushed against the body which results to false low reading in reader/app\n\nHence why it's called compression lows<br><br>\n  <b>Comment 3:</b> Dirty belly button? Ugly belly button? Shy about posting your belly button?<br><br>\n  <b>Comment 4:</b> The first 6 hours after the first warm up are trash. They are wildly inaccurate. Try to calibrate it first thing in the morning before food!<br><br>\n  <b>Comment 5:</b> Another tip that came to my mind, if you want more accurate readings, \n\nPut a new sensor in 24 hrs before the current one expires. Once the main one expires start the other sensor that you inserted earlier.<br><br>\n  <b>Comment 6:</b> calabrate once a day. try not to sleep directly on it. my daughters gets extremely false lows due to where we originally placed it<br><br>\n  <b>Comment 7:</b> Presoaking sensors is the only way I can get mine accurate. I insert a sensor the night before I’m going to activate it so it’s in my body for 8 hours, then I activate it the next morning. I learned that from this sub a while ago.<br><br>\n"}
{"id": "y9cvdp", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Explaining the honeymoon\nHow does one explain going into a honeymoon phase?  I was diagnosed two months ago, but now I’m off all insulin-which is great-but no one seems to understand.  Mostly I’m getting “so you’re not diabetic anymore” or “ I knew that you were just being dramatic about Covid giving you diabetes. Your diagnosis was clearly a mistake.”</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I’d stop trying to explain things to people who aren’t listening.<br><br>\n  <b>Comment 2:</b> When you are first diagnosed your pancreas usually still has some beta cells left. But they are usually almost burned out because they were working in overdrive trying to keep your blood sugar in check. When you introduce artificial insulin, you basically give those remaining beta cells a break and they \"rally\" a bit and start working again. But over time, the process that destroyed the other beta cells will continue to destroy the remaining ones. So this little breather where you aren't on insulin probably won't last forever.\n\nMy daughter also came off insulin for a couple of months after diagnosis. We left the hospital needing 5 units of lantus a day and a tiny amount of bolus insulin for meals. We slowly had to drop the lantus all the way down to zero and it stayed there for a couple of months. But as the final beta cells died off, we slowly had to increase the basal insulin and it has done nothing but rise ever since. We currently use \\~25-30 units of basal insulin a day.\n\nThe people saying shit don't understand what is going on and some of them never will. People like to be ignorant of facts for some reason. I would try to educate them a little, but at some point it isn't worth it and you should save your breath. Some people are especially unwilling to learn and accept that their position is wrong, so I just cut them out of my life entirely. I don't care if they are family or not. Willful ignorance is painful to deal with and I don't have time for that kind of stupidity.<br><br>\n  <b>Comment 3:</b> I was on insulin my first 4 months, I’ve been off completely for almost a year.<br><br>\n  <b>Comment 4:</b> \"Not all my islet cells have been destroyed yet, it takes some time\"<br><br>\n  <b>Comment 5:</b> If your honeymoon is that extreme I highly reccomend looking into the DREAMT or TOPPLE study<br><br>\n  <b>Comment 6:</b> wait wait wait…. You can be Type 1 and not be on insulin??<br><br>\n  <b>Comment 7:</b> You body is currently killing off your beta cells, the cells that product insulin.  Having high blood sugar also kills off your beta cells, historically, most people were running on very high blood sugar for a very long time before they were diagnosed and effectively helped their immune system kill off there remaining beta cells.  \n\nIf you have your blood work handy from when you were diagnosed, look to see if you have GAD-65 Autoanitbody numbers.  The normal range for that antibody is 0-5, when I was diagnosed mine was 1500.  That should shut most people up when they say \"you aren't diabetic\", you can explain Type 1 is an autoimmune disease and its currently attacking your ability to produce insulin and we have no way of stopping it.<br><br>\n  <b>Comment 8:</b> Ask them how their diabetes is going, then tell them to shut up and fuck off.<br><br>\n  <b>Comment 9:</b> I was also diagnosed two months ago and told I was on a honeymoon phase since I don’t need much insulin. Got from 6 to 3 units for basal and most of the time no rapid (only for high carb/sugar meals and snacks). The way I explain it is just that my pancreas has still a little bit of strength to help me for now :)<br><br>\n  <b>Comment 10:</b> Is it normal to have no honeymoon also? I’ve been on insulin since October with not much change in basal dose or bolus ratios?<br><br>\n"}
{"id": "143e9sj", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to help up my teenage neighbor who was just diagnosed with Type 1 Diabetes?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> It seems impossible at the beginning. They have to process a lot of new information. An invaluable book we have is Type 1 Diabetes in children, adolescents, and young adults’ 7th edition. It is by Dr. Ragnar Hanas. I would hold off on the snacks. His diagnosis is centered around food and what is a good or bad choice. They have a lot to figure out. I think the best thing would be to just be available.<br><br>\n  <b>Comment 2:</b> Diabetes Solution by Dr. Richard K Bernstein. Great teachings on how to properly cover meals and how to eat low carb. Best bet for ever getting a1c down to the low 5s range.<br><br>\n  <b>Comment 3:</b> I’ve got a booklet I’ve written up, its basically all the stuff I wanted to know at diagnosis. I’m happy to send you a copy of it if you’d like to send it over to her.\n\nOtherwise, “Think like a pancreas” “Bright Spots and Landmines” and “Sugar Surfing” are all excellent books. The Juicebox podcast is also great. \n\nCarbs&Cals app is great for calculating carb numbers.<br><br>\n  <b>Comment 4:</b> Leave her alone<br><br>\n  <b>Comment 5:</b> Here is a potentially useful article on type 1 as a teenager: http://www.dsolve.com/2016/06/09/what-can-you-expect-as-your-diabetic-child-goes-through-the-teenage-years/<br><br>\n  <b>Comment 6:</b> Offering to be an emergency contact (outside of medical needs) would be helpful.  It's useful to have a trusted neighbor that is willing to help be a resource.<br><br>\n  <b>Comment 7:</b> DO NOT GIVE FOOD. ESPECIALLY SUGAR FREE/LOW CARB FOOD! [A bag for his blood check kit](https://www.myabetic.com/collections/diabetes-cases/products/banting-diabetes-wallet?variant=2543054979098&gclid=CjwKCAjw1YCkBhAOEiwA5aN4AQHezENyy1fQ-BdfTyTGsjMaO8TGSwGwanHSg_ET8JDbsO7GiAwFBRoCbKgQAvD_BwE), cool medical ID bracelet. If He's on a pump/CGM there are [cool stickers](https://pumppeelz.com/) you can get to decorate them so they dont look so 'medical'<br><br>\n  <b>Comment 8:</b> theyre your neighbors so just be neighborly unless they ask for specific help<br><br>\n"}
{"id": "dtvycp", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Lowering A1C\nHow are people able to lower their A1C to below 6 I am struggling to keep mine below 7. I exercise regularly and eat fairly well. My sugars are just a roller coaster. Going for a walk will make my sugars plummet even if I’ve turned my pump off an hour before.\n\nWhat are people’s strategies?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Maybe check your basals? I had the same problem with crazy numbers until my endo made me do a basal check. Found out some were high and some were too low.<br><br>\n  <b>Comment 2:</b> For reference my A1C is 5.4% What’s your target fasting blood sugar? I shoot for 5, endo wants me at 5.5. Eat low carb-ish usually under 100g a day.\nIf I have a quick carb meal(potato or bread) it’s usually at lunchtime when I’m more sensitive. I pre-bolus for these meals 15-30 mins depending on what it is and how much. \nEating low carb limits the roller coaster since you don’t have the huge hike and then the big crash, and limits margin for error, I have very few hypos.\nI have a Dexcom CGM with range set 4.5-8.5 and it shows that I’m in range 98% of the time with 1%high and 1% low.<br><br>\n  <b>Comment 3:</b> A libre CGM  has made a big difference for me and gives me the feedback. I have lowered my A1c. By 2 units and I’m at 6.0. \nDoing much better<br><br>\n  <b>Comment 4:</b> Do you have a CGM? Just getting one lowered mine from 7 to 6.5-6.2. Going to a new dietitian low carb, grain free brought me to 5.6-5.8. Her name is Kelly Schmidt and she is type 1 herself, and helps other type 1s with their goals. She will meet with you through Skype. Just Google Kelly Schmidt diabetic dietitian and you will find her.\n\nMy goal on my pump is set to 95, so my corrections are calibrated to do so. My high goal is 120, so I aim to be less than 120. My Endocrinologists tell me I'm doing awesome but when I first told them I was doing low carb they did NOT support. \n\nI focus on gut health, because Diabetes is an autoimmune disease, healing the gut means avoiding gluten and inflammatory foods. I avoid dairy, soy, grains, carbs.<br><br>\n  <b>Comment 5:</b> For me cereal isn’t worth it, I’ve tried prebolusing as much as 45 minutes before but the amount of quick carbs always puts me high. Bacon and eggs only! I’ll have a slice of toast occasionally.<br><br>\n  <b>Comment 6:</b> this is something that I am well versed in. I have a number of strategies that work for me. \n\nI participate in endurance events call GORUCK Challenges. They are ball busters. What I try and do is stay consistent in my diet, my activity level, and also times of days that I do everything. \n\nI have found consistency is the key for me. Whatever you do, do it at the same times every day.<br><br>\n"}
{"id": "x6unga", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How much insulin for pasta?\nHey everyone! I'm still learning how to count carbs to insulin ratio. I'm having pasta tonight (on vacation) and it's a lot of carbs! Would the standard 10:1 ratio work for this? The pasta is 140 carbs, although I doubt I'll eat it all. Current BS is 120. Thanks for any advice!</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> If the sauce is super fatty (cheesy) and there’s a lot of protein in the sauce (meat sauce) it’ll slow down your body’s absorption of the glucose from the pasta. In these cases I typically do a little less so I don’t plummet, knowing that I’ll need to do a second round of insulin in ~3-5 hours when it starts going back up again.<br><br>\n  <b>Comment 2:</b> What’s a standard ratio? Is that ratio specific to you? If so then ok, if it’s not then I don’t know. Is there a sauce with what ingredients? Are you very new to bolusing? If so please send stick with your endo recommendations and err on the side of caution. For any new foods I try I generally eat a small amount and make a note of anything I may need to adjust with my bolus.<br><br>\n  <b>Comment 3:</b> Trial and error my friend. Make your best educated guess using your carb ratios you have used in the past and eat a measured amount. Then take notes on what your blood sugar does afterwards. Then when you eat it again, adjust how much insulin you take according to what you learned from last time. \n\nWe do this with just about everything and after a few years we have gotten remarkably good at guesstimating carb counts. Even without scales or carefully measured portions.<br><br>\n  <b>Comment 4:</b> It also depends on the type of pasta. For example 100g of durum wheat pasta (if weighed before cooking) like penne, spaghetti and farfalle are around 72 carbs on average, whilst fresh pasta like tagliatelle is around 54 carbs per 100 g. Whole-wheat pasta usually has less carbs than average durum wheat pasta (around 65 carbs per 100 g on average). Then you have to consider the type of sauce of course, plus you need to consider that if you're eating at a restaurant the meal is usually richer in fats and the portions tend to be bigger. The usual carb ratio should work just fine, but we're all different so you can't know unless you try.<br><br>\n  <b>Comment 5:</b> With a pasta load that big be careful when injecting all at once. As previous poster mentioned sauce with lots of fat can slow down absorption. Sometimes you can go low (and have to treat the low) before sky rocketing up later.<br><br>\n  <b>Comment 6:</b> All of it. And then more 2 hours later.<br><br>\n  <b>Comment 7:</b> All of it<br><br>\n  <b>Comment 8:</b> Pasta is tricky because it takes a while for your body to start absorbing it, so I normally give 20-30 percent of insulin before eating, then about 1.5 hours later I give the rest. That’s what works for me, but everyone’s body is different so it’s good to try different things!<br><br>\n"}
{"id": "oni98e", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Managing blood sugars when you’re struggling to eat\nHow does everyone manage their blood sugars when they are struggling to eat due to either illness or something else?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I drink ginger ale and try to keep it down as long as possible. If I have to I turn off the pump<br><br>\n  <b>Comment 2:</b> It would depend. Are your sugars high or low?<br><br>\n  <b>Comment 3:</b> I sip juices and gingerale, snack lightly on crackers or toast. A little something here or there is better than nothing.<br><br>\n  <b>Comment 4:</b> Assuming your basal dose is correct, you shouldn't need to eat.<br><br>\n  <b>Comment 5:</b> My diabetic nurses told me that ice cream is the best option. It is easy to consume and is easy to calculate the carbs for. Other than that use crackers if you’re feeling nauseous. Hope you feel better!<br><br>\n  <b>Comment 6:</b> If you're dropping low you can mix up a batch of glucagon and take small doses for up to 24 hours with a regular insulin syringe instead of the included pig-sticker in the kit. It's kept me out of the hospital more than once when I was sick and couldn't keep much down. It's off-label, but endos are using it more often nowadays. Do a search on glucagon mini dosing for more info.<br><br>\n  <b>Comment 7:</b> If I can't bring myself to eat anything at all, I will up my temp basal to like 25% or so.  My problem is that my liver dumps glucose after not eating for awhile.<br><br>\n"}
{"id": "1bmibvg", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How’s fasting going for those who are fasting ? \nI have kept all mine so far !</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> You're not required to fast if you have a medical condition In  pretty much any religion. I also done condone self punishment to earn the respect and repent for \"sins\" from a deity. Seems like an awful way to live<br><br>\n  <b>Comment 2:</b> If you are a child, if you have your period, and if you have a medical condition you are not required, actually, not expected to participate in fasting. It’s a choice for those in any of the 3 boxes above. A stupid one at that<br><br>\n  <b>Comment 3:</b> This person is asking for a sense of community within those who are also proactively taking part in their faith, not to be judged and ridiculed for it.<br><br>\n  <b>Comment 4:</b> I used to fast until I became a nurse. (That was before I became a diabetic.) After what I learned in nutrition class, I believed god wouldn't want me to do something that could be harmful to my health. Instead of taking away something arbitrary, I started adding something enriching, such as an extra service or an extra kind deed. Good luck.<br><br>\n  <b>Comment 5:</b> as long as you’re doing it safely, i hope you receive lots of blessings during this time!\n\nanybody saying that fasting is stupid or useless, this post obviously wasn’t for you :)<br><br>\n  <b>Comment 6:</b> I do fast and IT Work pretty well. I do not eat before 12pm and in evening my last meal is at about 8pm I'm fine with it<br><br>\n  <b>Comment 7:</b> My t1d friend doesn't fast, but to make up for it she avoids junk food and other treats she has :) \n\nHope its going okay for you! \n\nI've thought about fasting for non-religious reasons but can't imagine the work in ensuring getting your basal completely right and the annoyances of things like walking and trying not to hypo! \n\nGood luck, you're almost there.<br><br>\n  <b>Comment 8:</b> i sometimes do , you can inject your long acting and be fine with stable bs all day<br><br>\n  <b>Comment 9:</b> Fasting can help manage diabetes by improving insulin sensitivity and promoting weight loss, but it should be done cautiously and under medical supervision. Read Can Water Fasting Reverse Diabetes: [https://fastingforwardcoach.com/can-water-fasting-reverse-diabetes/](https://fastingforwardcoach.com/can-water-fasting-reverse-diabetes/) for more information on how water fasting can potentially reverse diabetes.<br><br>\n"}
{"id": "12vdlr2", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>50% basal 50% bolus rule origin\nCan anyone help me find the origin of this “rule” in scholarly articles?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> It‘s a general guideline, however, it has never worked for me (I take 70% basal). There are some neat articles about the general math: https://dtc.ucsf.edu/types-of-diabetes/type1/treatment-of-type-1-diabetes/medications-and-therapies/type-1-insulin-therapy/calculating-insulin-dose/\n\nAnd overall treatment and why it is so different person to person (it can vary 0.5-1 unit per kilo!): https://www.aafp.org/pubs/afp/issues/1999/1115/p2343.html#references<br><br>\n  <b>Comment 2:</b> Yea this is absurd, the basal rate is whatever keeps your glucose steady while fasting, which is completely independent of however much you bolus. And bolus amount is dependent on how many carbs you eat which varies from day to day, person to person by significant amounts. Def not current science.<br><br>\n  <b>Comment 3:</b> I think it is also skewed with newer ultra-long acting insulins like tresiba. I've always had more bolus than basal, but when I moved to tresiba from levemir, it got even more skewed. I probably do 70 % bolus/30 % basal.<br><br>\n  <b>Comment 4:</b> My endo still keeps telling me this. It's very confusing! I bolus a lot more than take basal. Otherwise I'd go low at night.<br><br>\n  <b>Comment 5:</b> I’m 2/3 basal, 1/3 bolus.\n\nTotal 33 units per day.\n\nSurely 50/50 is dependent on the individual and their lifestyle.  Eating and exercise etc.<br><br>\n  <b>Comment 6:</b> My endocrinology fellow…told me that taking too much basal was bad.  I don’t understand her logic.  If I take it as basal or bolus and I end up at the same bs why would it matter.  \nHer only explanation was that insulin is a dangerous hormone and taking “too much” was bad.  I continued to explain it was the same amount needed to consume the sugars in my body whether delivered as a bolus or as basal (assuming not battling highs) \nI would like an endocrinologist to correct me if I’m wrong.<br><br>\n  <b>Comment 7:</b> It’s not a rule so much as a guideline. And our endo said anyways that they’re realizing it isn’t really the ideal for everyone anyways.<br><br>\n"}
{"id": "esx253", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can insulin cause hunger?\nI was diagnosed with type 1 almost 3 years ago. Back then I was an emotional overeater, so I weighed around 100kg, though I was never really that hungry.\n\nBut oh my good lord am I hungry now. I weigh around 60kg now, but I still eat like I weigh 100. Every time I eat, I take insulin, but every time I take insulin, my hunger increases.\n\nSometimes I just don't feel like dealing with hunger, so I only drink water that day, and that's all I consume. And I'm nowhere near as hungry as I am when I take my insulin like I'm supposed to. I can eat until I'm so full I feel like puking, and yet, as soon as I take insulin I get hungry within 15 minutes.\n\nLong story short, I'm going insane with all this hunger. And I'm so tired of this evil cycle of eating > taking insulin > getting hungry > eating > taking insulin > getting hungry > eating > etc.\n\nI take Novorapid and Tresiba, I don't know how many countries they're available in, but I really need to know if anyone else is dealing with this.\n\nI'm a grown man, and I'm not afraid to admit that I sometimes get so frustrated from the hunger that I start crying. I just want to feel full for more than 5 minutes.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> i have the same freaking problem but i just thought it was because im not eating the right stuff or because im chub. i eat until my stomach literally hurts and then not even 15 minutes later my stomach is GROWLING, but no matter what i eat (healthy or junk food) it still happens\n\ni take admelog currently<br><br>\n  <b>Comment 2:</b> you get hungry when your blood sugar goes lower, and insulin causes that.<br><br>\n  <b>Comment 3:</b> Bro, it's pretty impressive that you shared this info, and that you went from 100kg to 60. I weigh ~100kg now and I'm trying to lose but it's so hard. I do feel like the more carbs I eat in a sitting, the more I want to eat later in the day after I inject. It's definitely frustrating. Also, T1 for 4 years.\n\nWish I could help more but maybe try low carb eating? Since you won't take as much insulin but you can still feel full.\n\nI like cauliflower rice and meatballs and sugar free barbecue sauce. But definitely drink some water and have a small snack ready because the cauliflower doesn't satisfy for too long, but it's so low in calories it's awesome.<br><br>\n  <b>Comment 4:</b> Yes. Insulin causes hunger and weight gain. You want to eat as few carbs as possible so that you do not need so much insulin. Try keto/low carb diet. You can eat cheese, bacon, meat, etc. all day without taking insulin.<br><br>\n  <b>Comment 5:</b> Insulin does play a role in satiety, but it is not a main player. With that being said, insulin is actually anorexigenic, meaning it makes you feel not hungry. So it's unlikely that insulin is causing what you're experiencing.\n\nHowever there is a possible link between insulin resistance and hunger. When you eat lots of high carb foods you end up craving them. It's like an itch, or an urge to keep eating them, not necessarily hunger. If you're feeling it after eating then it's probably this and not hunger. Insulin resistance in T1 is a dangerous game to play so I would talk to your Endo and see if there's anything going on. You may need to make dietary changes.\n\nThere is another possible explanation however. Our beta cells produce more than just insulin, they also make amylin. Since we're T1 we don't have working beta cells so we don't have amylin either. Amylin plays a role in regulating appetite. It suppresses it when you eat, so you begin to feel full and stop eating. Without amylin it is possible that you would not feel full.\nThe caveat here is that amylin is not the major player in satiety either. So it's unlikely to be having a very profound effect.\n\nSo while there are certainly some complications with appetite that are caused by having T1, they're normally not very extreme and most T1s will never really have any issues.\n\nSource: degree in biochemistry\n\n\nEdit: Hey OP I thought about it some more and wanted to add that based off your description I think what might be happening is postprandial spikes in blood sugar are causing your hunger. You mentioned it not being as bad if you don't eat at all, which made you associate it with the insulin you're taking when you eat. Which makes sense. But what I would wager is happening is you're eating and taking the insulin maybe just a little too late. This is making your blood sugar go way up right after you eat, but then plummeting back down awhile after because of the insulin. The high blood sugar makes you feel hungry and the plummeting afterwards exacerbates it. \n\nWhat kind of bolusing are you doing and when? I would suggest carefully trying to take your insulin sooner, even if that means you take it before eating. Hopefully this will help mellow out the \"rollercoaster\" you're experiencing and I bet it will help with your gnawing hunger pangs too!<br><br>\n  <b>Comment 6:</b> I’ve been a type 1 diabetic since I was 12 and well I gained weight not directly bc of insulin, but bc of the hunger that comes with it so I understand where ur coming from. With time and effort it usually is the mental aspect of it.  I lost the weight and everything by controlling my food and portions and the next few months I was used to eating less and less without the hunger. \n\nLessening your use of insulin makes you less hungry, so eating less carbs defo helps.<br><br>\n  <b>Comment 7:</b> Adding on to another comment that was talking about amylin production... Some classes of drugs attempt to supplement amylin or perform similar functions. I definitely experience the hunger you're describing, and have also struggled with weight.\n\nI took symlin for a while and it helped incredibly with not feeling hungry all the time. Unfortunately it also made me pretty nauseous and I eventually stopped taking it. Last year, I took Trulicity (off label for type 1 but provides some of the same effects) for about 6 months, and it was awesome... Was not feeling hungry all the time, and no nausea. Then I got pregnant so stopped taking it since it's not recommended during pregnancy. \n\nIt's worth a conversation with your doctor to see about trying a supplemental hormone in that vein, and see if it helps you.<br><br>\n"}
{"id": "12q3acm", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How do I get a pump? I'm not perfect.\nHey guys!\n\nSo I've read a ton of posts on this sub and others about people getting new pumps. I've asked my endocrinologist about it but she told me that in order to get a pump I need to have my blood sugars no lower than 85% in range for 30 days, with most days being 100% in range.\n\nI think a pump would actually make my life a lot easier because I wouldn't be forgetting or missing shots. Nor would I be accidentally giving myself too much insulin.\n\nI'm just wondering what you guys do to keep your sugars so in target to qualify for a pump? I've tried diets and crazy carb counting, but the only way I ever seem to get it close to 100% is by correcting my morning feet-to-floor syndrome and then basically not eating all day because eating will affect my blood sugar. But that leaves me hungry and generally in an awful mood all day.\n\nI'm in Toronto Canada 🇨🇦</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Get a new doctor. Most go on pumps to get better control. If we were all that great on shots pumps wouldn’t be considered the standard of care for T1Ds. Btw my endo begged me to get on a pump to improve my bs when I was in college.<br><br>\n  <b>Comment 2:</b> Always unpopular opinion, but stop eating carbs aside from non-starchy veggies.   Try it for 2 weeks.  If you aren't above 95%, go doctor shopping like the other guy suggested.<br><br>\n  <b>Comment 3:</b> So in Manitoba pediatric care they require 3 consecutive a1cs under 10. I've never seen anything harder for requirements but damn yours takes the cake.\n\nI know that our endo clinic is very conservative and want to make sure those on the pump know it's not a cure all for lowering a1c or dealing with issues you have from MDI. However I've known some who have successfully convinced the clinic to relax a bit with the following.  \n1) researched and documented plan for which pump and why.  \n2) printed academic articles stating that pumps are beneficial to those struggling with higher a1cs.  Use google scholar there are many available though you want to find free ones to print. \n3) concurrent use of cgm to monitor for lows. \n4) proof of Basal and carb ratio testing for different times of day. \n\nIt's a lot of work, especially when other endos will just prescribe pumps easily. Also, if you are able to figure out how to build loop, you only need to find someone willing to part with dash pods to get started (though I wouldn't recommend as you won't know what to do for Basal rates at first).<br><br>\n  <b>Comment 4:</b> I have never heard of such a thing.  I would, if possible, find a new endo.  You should be able to try a pump if you want to.\n\nAlso, you can actually give yourself too much insulin with a pump, if you enter the wrong carb amount.  \n\nThe pump works wonders for the Dawn Phenomenon and the \"Feet to Floor\" syndrome and can be a great tool that helps you deal with those.  \n\nI personally prefer DMI and have about 85-87% in range with it but am on Omnipod because I promised my endo to give it a try.  There are benefits to both, but if the morning glucose rises are the things holding you back from better control, I would push to try it.<br><br>\n  <b>Comment 5:</b> Holy shit I hate that approach! A pump, or new pump makes control easier. Withholding a script for a new pump is bullshit! I’d give him a piece of my mind, then switch docs. I’m so tired of the state of healthcare. F$&K!<br><br>\n  <b>Comment 6:</b> Back in 2000 when I first got mine the only caveat was how often I was willing to prick my fingers. If you already have a CGM it should be a no brainer.<br><br>\n  <b>Comment 7:</b> No offense but your Endo is a quack. The idea of getting on a pump is to best regulate blood glucose. Unless there’s something in the Canadian healthcare system? \n\nYou could contact the pump company (I just started on the Omnipod with my Dexcom, and I highly recommend it!!) and ask them directly- they are sales reps highly motivated to help you navigate the process.\n\nAlso, if there is an organization to whom you can report this Endocrinologist, incredibly poor medicinal advice, I would try to do so. If they’re saying this to you, they’re saying this to God knows how many other diabetics and giving them terrible advice as well.<br><br>\n  <b>Comment 8:</b> I went to a brand new endo and said “hey my son is getting on a pump, I haven’t seen a doctor in over 7 years for my diabetes, can you please write me a prescription and put a rush so I can start around the same time as him?” And she said “of course! I’ll check on you in 3 months…” got my pump about 8 days later.<br><br>\n  <b>Comment 9:</b> 100% agree with everyone who says get a new doctor.  We got my son on a pump days before he turned 3 years old and 5 months after diagnosis.  No way were we in the 85% at that point.  His endo wanted us to have time to learn the basics and be comfortable giving shots and finger pokes so that if any of his tech failed, we could go back to MDI no problem.  That was our only requirement before getting a pump.  It has definitely helped with getting and keeping him in range.  It’s also easier to dose or check and see if you did for those times that you just can’t remember if you did or not.  Having a pump has been a game changer for all of us (as well as the Dexcom).  \n\nI am not a resident of Canada, so I can’t offer any advice in regards to getting one there.  But, I will say that fighting to get a pump is worth it.  My son started on the Tslim Control IQ and is now on the Omnipod 5.   Both are great and helped keep him in range.  We started on the Tslim because it was the only one at that time that directly communicated with his CGM.  We switched to the Omnipod 5 when it offered the same, because it meant no more fanny packs and no more tubes for a now active 5 year old.  We’ve had more pods fail than Tslim site fails, but it’s a negligible amount.  But, I’ll step off that soapbox to reiterate that in the end, any pump is worth at least a shot if it means potentially better control and an easier life with diabetes.<br><br>\n  <b>Comment 10:</b> My son is 11 and we were told while he is “well controlled” at 7+, he needs a pump to get better control. She stressed that it was literally the only way we would get his numbers looking better and he’s now on omnipod 5. It’s amazing. Not perfect, but he’s like 60% in range which I’ll take over the MDI while we get the hang of it ( he’s only been on the pump two weeks)<br><br>\n  <b>Comment 11:</b> Look into the assistive device program, those are not the qualifications to get funding for a pump. \nAlso I can only speak from my experience but give Medtronic( or other pump manufacturers a call) they do a great job helping you get one since the supplies is where they make their money<br><br>\n  <b>Comment 12:</b> Get a different doctor. If you were in range majority of the time, you wouldn’t “need” a pump. A pump is meant to make diabetes treatment easier while still having a lot of control.<br><br>\n  <b>Comment 13:</b> Oshawa Ontario here. I was told the only requirements are my son needs to be diabetic for a full year. His year is up so im doing a pump info session on the 25th then have a pump readiness appt July 4. I’d see a new dr<br><br>\n  <b>Comment 14:</b> I totally agree with the consensus among the legends - get a new Endo. Yours is bananas.<br><br>\n  <b>Comment 15:</b> I was so terrified to get a pump because my pediatric endocrinologist told me the same thing. I was also told that the complications would be worse if I was uncontrolled on a pump so I refused to go on one until last year and it was the best decision I ever made! \n\nI know endocrinologists are hard to come across (at least in the US), but definitely try to find a more supportive one. Getting on a pump can only improve your blood sugars if you’re using it correctly.\n\nGood luck in your pump journey!<br><br>\n"}
