{"id": "154bzsx", "text": "\n        <div style='user-select:none;'><b>Post Title:</b> How to deal with family/friends who don't understand?<br/>\n        <b>Post Content:</b> My son (11M) was diagnosed with T1D a little over a month ago after he was admitted to the hospital for DKA. While in the hospital, the doctors all stated multiple times that his diet did not cause his T1D and we couldn't have prevented this. We just got back a positive Zinc Transporter 8 Antibody test that confirms the T1D diagnosis. My family is riddled with T2 and have friends or friends with kids diagnosed with T1D. They are fairly well informed and supportive.\n\n\nHowever, my son's father and his family fully believe that eating a low carb, raw vegan diet will \"cure\" his T1D and he won't need insulin anymore. His father went so far as to say it was my fault our kid was almost unalived and had to be in the hospital because I let him eat fast food. To be fair, I know we don't have the most healthy diet, but I do keep healthy snacks in the house and my son eats more vegetables than I did as a kid.\n\n\nHas anyone ever dealt with this kind of situation and/or people before? How can I get him to understand that (1) that's not how T1D works and (2) a low carb, raw vegan diet won't have enough nutrients in it for a growing kid?\n\n\nI'm not opposed to switching over to a vegetarian diet and/or making sure my son gets more healthy food. I just don't want to make my kid feel like he can't eat what he wants ever again when he's already being restricted to a certain number of carbs in a meal and has to cut out his favorite candy and soda. He's already dealing with so much for his age (other issues I won't get into here) and I don't want to restrict him even further. He's been amazing at adapting to having T1D so far. He's giving himself injections (we have to wait a while before he can get a pump), dealing with lows quickly, and telling me about his food including cooking for himself. I just want his father to focus on supporting his son through this new aspect of his life instead of trying to \"cure\" him and blaming me for everything. Is that too much to ask? Am I being unreasonable or too lax with my son's health?</div><br/> <br/>\n        \n            <b>Comment:</b> I mean the intent is fatally flawed, diet doesn’t make the beta cells in a pancreas suddenly come back. They’re dead, gone. He can’t make insulin. There are potential cures down the road but sounds like denial. \n\nVery Low/no carb diet DOES make diabetes significantly easier to manage, and it’s also not something I or most other diabetics do because it’s a pretty personal choice. Raw/vegan is meaningless. It’s an autoimmune disease lol, his immune system attacked the wrong thing. Diet doesn’t change that.<br/> <br/>\n            \n            <b>Comment:</b> Tell your son's father that it's genetic and as likely his fault as your fault so he can start blaming himself and his parents.  Sorry, you're the scapegoat for morons.  Morons don't usually change their minds.  Doing so requires them to admit being wrong and they're never wrong.  Keep doing right by your son.  He needs an adult who isn't a dolt.  You're kicking butt.<br/> <br/>\n            \n            <b>Comment:</b> I’m a 13F diagnosed in November of 2020. I’ve still got the 5.7 A1C without a keto diet.\n\nThe biggest contributors to this are my Dexcom and Tandem, which I definitely recommend if you don’t have it already.\n\nAs for family members, oftentimes they won’t think/can’t comprehend the difference between T1D and T2D. I’d leave it chronic, incurable, autoimmune disease that requires your son to watch what he eats and take insulin. \n\nFor your son’s father though, you could ask your doctor to write a note. If that doesn’t work, try every way possible to explain to him how to manage it, as he will probably have to take care of your son as well.\n\nJOIN JDRF. Being a JDRF (Juvenile Diabetes Research Foundation) Youth Ambassador is free, and it helps you connect with so many parents and kids dealing with T1D. The JDRF website also has tons of tips to help out.\n\nWish you best of luck!<br/> <br/>\n            \n            <b>Comment:</b> I would keep reiterating that type 2 can be cured and reversed with diet and lifestyle changes but that type 1 is an autoimmune disease, with no cure, and his pancreas no longer functions (to keep it as simple as possible for them.) I would also tell them that if they refuse to accept this basic fact you will not be leaving him In their care. This is dangerous and harmful thinking and will lead to him ending up in DKA because they refuse to believe he needs insulin or with him having a very distorted relationship with food. I cannot stand the ignorance. For once, google would be their friend here. So sorry you’re dealing with this crap but putting your foot down regarding it is super important. Type 1’s now have the same life expectancy as the general population thanks to advanced technology and making it much easier to keep his numbers in control. Learning how insulin works and how to use it properly are key to him being able to eat a regular healthy, balanced, diet. If you don’t already tune in I cannot recommend the juice box podcast and facebook group enough.<br/> <br/>\n            \n            <b>Comment:</b> People do not get into those positions with logic, so facts and logic are not going to get them out of it.\n\nSome T1s do well on a low carb diet, but also many T1s do well on any healthy diet. With the various insulin choices, meters pumps, cgms, T1 is far from the terminal disease it was just 100 years ago when insulin was discovered and produced. It is a chronic disease that takes learning, time and effort since as you know the autoimmune aspect is the islets are gone.\n\nTruth be told many of the \"cure\" diabetes folks drive T2s crazy too. Unsolicited advice is just wild, especially when wrong.\n\nSo the best advice is boundaries. Set them and know  you and your son did not cause this and he will have a long healthy life.<br/> <br/>\n            \n            <b>Comment:</b> Raw vegan will make it harder to control his BG, the oxalates build up and cause inflammation. When I eat Carnivore I need 1/2 the amount of insulin that I do when I eat Keto because of the inflammation the oxalates cause.<br/> <br/>\n            \n            <b>Comment:</b> Was diagnosed at age 5, dad blamed my mom b/c on Saturdays she'd let me have a Coke w/ dinner. It became an ongoing issue for him to blame both me and my mom in turns for my type 1 diabetes. My grades suffered as a result of my sugars being all over the place during puberty, which he then used as an excuse to routinely berate me and degrade me in front of the rest of the family.\n\nThis is a form of narcissism. It's called narcissistic parenting and hits especially hard in a broken/failed parental unit b/c the narcissistic one will blame the entire situation on, if nothing else, the poor genetics of the other parent. \n\nThe narcissistic parents' position in this scenario is that the illness would essentially become a moot point if only some form of diet, lifestyle, or if nothing else, child's attitude would simply meld to their meticulous mold. \n\nI wish I had better news for you.<br/> <br/>\n            \n            <b>Comment:</b> I'm assuming no, but would it be possible to have him go to a few education appointments with you. Maybe if he hears everything straight from the doctors/RNs mouths he will ease up a little bit? I know you already know but restricting his diet like he wants would absolutely do more harm than good (in my opinion) so absolutely stand your ground and no matter how much he tries to blame you know it's absolutely not your fault! (I know you know this but sometime when someone is repeatedly doing it we can second guess ourselves ya know) \nI would even maybe ask his doctor's office for some education print outs and give them to him. No amount of veggies or tofu is going to magically make his pancreas work again (if it did everyone would be cured lol) and he needs to understand that in order to help support and care for your child.\nI know it's all still new and scary (were just over a year in and it's still new and scary lol) but you know your child best so absolutely keep advocating for him! You're doing great!!<br/> <br/>\n            \n            <b>Comment:</b> This is a bit different than some of the other advice, which is all fantastic....and give yourself a huge pat on the back for being such a caring parent!\nHis dad is setting your son up for a host of mental health issues and eating-disordered behavior if he keeps up with this agenda. I was raised by a parent who controlled everything that went in my mouth. While they understood that I had to have insulin also, every bit of food was measured, controlled, and painfully healthy. Not vegan....this was the 80s and early 90s, so that wasn't super common at the time. I reacted by \"controlling \" myself.....I quit eating. I have been both anorexic and a binge eater, due to having zero idea of how to be normal with food for most of my early adult life. Like his dad, I'm sure my parent thought they could \"fix\" me with all of their efforts. Sadly, it was incredibly detrimental to my sense of self (I have always felt broken/like a failure), as well as my relationship with nutrition. \nHas his dad been to any of his endo appointments? Maybe a meeting with a dietitian if you think he would be receptive. \nBest of luck....you are doing great and your kiddo is lucky to have you.<br/> <br/>\n            \n            <b>Comment:</b> Insulin is not the enemy. Insulin is our friend. The goal should never be no insulin. Its not just the \"antidote\" to carbs, its essential for lots of bodily functions.<br/> <br/>\n            \n            <b>Comment:</b> Well I’ve been T1 for 48 yrs diagnosed when I was 4. In those years I’ve had amazing & terrible control. I’ve had a great career as a theatre nurse/sister, 4 now adult healthy non diabetic sons, travelled all over, done marathons & ultras. All without tech & certainly not eating raw, low carb, drinking magic potions or eating bloody cinnamon! I eat what I want when I want & my HBA1c 5 months ago came back at 6.1% \n\nYes low carb works for many diabetics (can’t honestly see what difference raw makes tbh) but for me I enjoy my carbs too much. I’m not overweight either. You’re still new to all this & the information available is an absolute minefield!! You will eventually get a better grip on it & find out what works best for your boy. \n\nAs for his Dad send him on here; we’ll soon put him right! He is in denial & angry so is lashing out trying to find someone to blame when it’s actually no one’s fault at all. If he keeps insisting on this raw food malarkey & not giving your son his essential insulin I’d start saying he can’t come to visit because he’s putting his life in danger which he is! DKA or a hypo will kill him; one quicker than the other admittedly but high sugars could cause his other problems such as his eyes or kidneys & that would be Dads fault! Maybe Dad needs to speak to a therapist who fully understands T1 who can help him to understand the danger he is causing his sons health.<br/> <br/>\n            \n            <b>Comment:</b> I feel like just doing very basic research on his own would clear up this misconception. It always baffles me how people are determined to live in ignorance when we have information at our literal fingertips. I wouldn't say a vegetarian diet is necessarily advisable either. A balanced diet with correct carb ratios accounted for will allow for all the proper nutrients he needs as a growing little person.<br/> <br/>\n            \n            <b>Comment:</b> Very true.<br/> <br/>\n            \n            <b>Comment:</b> NOPE! NO NO NO. I was DX at 20 after first complaining about very obvious T1D symptoms (tired, thirsty, SO MANY PEES) at 14 but my Dr DX me with depression. 'Cause teen girls are too emotionally messy, amiright?! /s\n\n\nBy the time I was 20 I had done a diet elimination so I was a 70% raw vegan. Mostly living off of soaked kale carrot onion and garlic cold soup. \n\n\nMy sugars were over 1700. I was in massive multiple organ failure. After almost a month in the hospital I had a severe eating disorder because I was told I couldn't have more than 30 carbs per day. I ate half a grapefruit, half a pita quesadilla, kale soup or salad. Everyday. Only that. I weighed 90 pounds and became bulimic. \n\n\nI am now 35, great organs, healthy as hell and eat healthy, not disordered. Your husband's idiocy can harm your child so effing bad. We are so blessed to be T1D at a time when we have pumps, fast acting insulin and God damit let the kid have a piece of cake on special occasions!! Diabetic eating disorders are completely under studied and I am so fearful for your child. Track his sugars and don't allow his father to make him fear and loathe eating. It can kill him.<br/> <br/>\n            \n            <b>Comment:</b> Have you're husband read this sub reddit...also educate himself .   But you can't change people, you can only change how you let them affect you<br/> <br/>\n            \n            <b>Comment:</b> Something I think a lot of people don't realize (I've been diabetic for nearly 30 years and didn't know this until I get into the medical field) is that the body produces its own glucose - the liver is pretty much constantly releasing glucose into the body. This is why (well, one of the reasons why) low/no-carb diet don't \"fix\" diabetes. You can eat literally nothing with any sugars or carbohydrates, and you still need insulin throughout the day (idk how far into yrraent you've gotten with your kid, but that's where a basal rate comes into play, a continuous drop is insulin to keep the baseline glucose at a good level).\n\nBest case, they're in denial. Worst case, they're gonna kill the kid with this \"diet X can fix his diabetes\" shit.<br/> <br/>\n            \n            <b>Comment:</b> It’s hard for T2 people to understand that T1 is totally different. I got diagnosed as an adult, my Nana has T2, the first thing my Mum said to me was “are you sure you didn’t give yourself T2 and it morphed into T1?” She doesn’t say it outright, but she refuses to believe I didn’t cause this to happen to myself. \n\nYou can tell people the facts but you can’t force people to change their thinking. Just make sure your kid isn’t around these people alone so they can’t mess with his understanding too.<br/> <br/>\n            \n            <b>Comment:</b> You and your son will deal with people like this his whole life. I immediately become very assertive about it as soon as someone brings up the possibility of me \"curing\" my T1D. I let them know that I've had this disease for 17 yrs and am aware of how to manage. If they stay persistent I'm afraid all you can do is ignore them.<br/> <br/>\n            \n            <b>Comment:</b> I would continue to educate them that Type 1 is an autoimmune disease and he has to have insulin to live.<br/> <br/>\n            \n            <b>Comment:</b> They will end up causing severe medical problems if not unalived if they are allow to give no insulin for even a short amount of time. DKA is no joke.<br/> <br/>\n            \n            <b>Comment:</b> \"Neither my child not I discuss his diabetes with anyone but his doctor.\"\n\nThen take your son to an amusement park and have a fun day, because you and your kid deserve to hang out with the FUN kinds of clowns, wink-wink.<br/> <br/>\n            \n            <b>Comment:</b> Make him go to doctor appointments? Maybe he will respect the opinions of the physicians? Coparenting is hard enough. Usually people like that don’t change much. When my two boys were diagnosed as colorblind, my ex asked the Opthamalogist if my being T1 caused it. My grandpa was colorblind and it’s just a super common thing in boys!! 🙄 it makes weak people feel better when there’s someone to blame in a situation they have no control over.<br/> <br/>\n            \n            <b>Comment:</b> Lean on those people you know with T1D or have T1D kids. One of the few upsides to this bummer of a disease is that we T1Ds are generally supportive of one another and willing to help and give advice, especially when dealing with the newly diagnosed! When I was first diagnosed my mom’s friend (who had a T1D kid) took us grocery shopping and loaded us up on peanut butter, cheese sticks and other high protein/fat foods that I already liked and ate. On the way home, we stopped and got burgers so my mom and I could practice looking up the nutritional info in the little Calorie King book she brought for us. This experience made me feel more “normal” (especially after just leaving the hospital) because we were focusing on eating the foods I was already eating in a more diabetes-focused way. Having a healthy relationship with food is hard enough as a T1D without tacking on additional food restrictions.<br/> <br/>\n            \n            <b>Comment:</b> When my son was diagnosed at 18-months of age, he was our second child. Our first was raised his whole life vegetarian and even chunks of time vegan. Our second child had barely begun to eat solid foods, as he weened himself from breastfeeding earlier than we were planning. But despite all that, he was also, and still is, vegetarian.\n\nWe’ve been living with diabetes now coming up on two years. Believe me when I say that your diet prior to the diagnosis has nothing to do with the issue. It’s genetic. My wife and I know of nobody in either family that has T1, so needless to say it was a shock. And I mean, shock is the most epic of understatements, but I believe everyone here can relate.\n\nSo, your diet won’t change anything going forward, either. There’s no simple trick to not have to deal with insulin. It’s the new reality.\n\nAlso, Type-2 has ABSOLUTELY NOTHING TO DO WITH TYPE-1. It really, really frustrates me they’re even both called diabetes, they are so different in cause and how terminal it is. T2 gets all the publicity, so now T1 has to deal with the stereotypes.\n\nYour husbands family need to educate themselves on Type-1. My wife and I are the crunchiest, most holistic people we know, and this has made us deal with pharmaceutical BS more than we ever wanted to, but it’s the new reality.<br/> <br/>\n            \n            <b>Comment:</b> I have always been slim, healthy, pescatarian, weighing110. At age 44 I dropped 20 pds in less than two weeks.... diagnosed with t1d. Your father's family is ignorant as to what an airo immune disease is. It breaks my heart that you feel you even have to defend what sort of snacks you have in the house. You did not do this. Your son did not do this. His father's family does not know what they are talking about. My husband's family does not understand this disease and I've had it for many years now. Just know that it is not your fault and it sounds like you're doing everything right.<br/> <br/>\n            "}
{"id": "1c1j02z", "text": "\n        <div style='user-select:none;'><b>Post Title:</b> Omnipod 5<br/>\n        <b>Post Content:</b> How are the people using OmniPod 5 finding the system. \n\nFor me my blood sugars have never been better however, I'm using more insulin and pods than before and I am thinking they have changed adhesive as I've never had sensitive skin where the old pods were applied but with this I am getting blotchy and almost scabby skin where the pod was. Has anyone else noticed this?\n</div><br/> <br/>\n        \n            <b>Comment:</b> I love mine! I've never used anything else, so I have no comparison, but I never have a problem with adhesion or rash. Occasionally get a small bump at the cannula hole when removed, but it goes away in a day or two. I also use the least required insulin 85u, and usually waste 5-15u every 3 days.<br/> <br/>\n            \n            <b>Comment:</b> It runs me higher than I like. I still use it when being tubeless is an advantage, but I keep to my Tandem, for the most part.<br/> <br/>\n            \n            <b>Comment:</b> I noticed when I picked up my last 90 day supply that the fabric of the patch appears to have been changed vs the old stock I had. I haven't had a reaction to any of their adhesive so I can't speak to that, but it certainly looks different to my eyes.<br/> <br/>\n            "}
{"id": "f1mwlr", "text": "\n        <div style='user-select:none;'><b>Post Title:</b> Can anyone relate?<br/>\n        <b>Post Content:</b> Hi everyone! I’ve had type 1 for 5 years now. I went to the ER a year ago for the first time due to a diabetic related incident and ever since then I have struggled with keeping my blood sugar in normal range.  Every time I do a shot, I feel extremely anxious and give myself less insulin than I should because I’m scared of going low. Does anyone have any advice on how to deal with or overcome the anxiety of having type 1? I used to think I was a pro at this disease but now I’m struggling on how to get myself out of this rut.</div><br/> <br/>\n        \n            <b>Comment:</b> Can’t offer much advice cos I and I’m sure many others often feel the same way... so you’re certainly not alone.\n\nI view insulin as actually being quite dangerous so I always under dose and correct high’s. It’s not a great strategy but it makes it manageable for me.\n\nI ate the same breakfast daily so that I could get the dosage right and get comfortable with injecting more- this is not perfect but it works for me.<br/> <br/>\n            \n            <b>Comment:</b> Can totally relate, I almost fainted once from a very low hypo during a run and I never dared to run again :( I think small steps would help get closer to your eventual goal<br/> <br/>\n            \n            <b>Comment:</b> [deleted]<br/> <br/>\n            \n            <b>Comment:</b> This was me until I got the insulin pump sensor which stops lows. \nI got diabetes when I was 6 and now almost 26 and my whole life I always made myself a little high (8-10) because I was so scared of going low. It’s not a good idea though. I always did this especially before bed and even more so if I was staying at someone’s place. \n\nMy suggestion would be to get the insulin pump and sensor as soon as it’s financially a possibility and to slowly give yourself more and more insulin. Start in environments you feel safe in (in the day time when you aren’t exercising and with your family). \n\nI remember feeling so anxious until I got the sensor so I guess I am not the best person to take advice from. But I can totally understand how you feel. I am so sorry. Honestly it’s so hard. Keep trying with your blood sugars though. You don’t want to be like me and be anxious for more than a decade. \n\nPut safety things in helps. I know having my phone next to my bed and always having juice has helped me in the last feel more safe. Also telling the people around me. \n\nI would love to know how you do so please update me xx<br/> <br/>\n            \n            <b>Comment:</b> In Australia we don’t really have any other brand of pump but Medtronic so it is weird for me to hear other brands haha \n\nYes the constant beeping is SOO ANNOYING but so worth it. \n😊<br/> <br/>\n            "}
{"id": "wzvuwd", "text": "\n        <div style='user-select:none;'><b>Post Title:</b> How to deal with BG spikes after HIIT?<br/>\n        <b>Post Content:</b> </div><br/> <br/>\n        \n            <b>Comment:</b> Hi all, I’ve recently changed up exercise from moderate to a HIIT training a few days a week, and after years of exercise dropping BG, now it raises!! it. Does anyone have advice for how to deal with exercise-induced BG spikes?<br/> <br/>\n            \n            <b>Comment:</b> Take a little insulin before you start workout. Have a snack nearby in case. I do gymnastics and my blood sugar creeps up during training, I try to start training with a lower sugar..like 90 or 100. When I get to 150 I'll take a half unit. If my sugar is higher when I start training I'll take the 1/2 unit up front.<br/> <br/>\n            \n            <b>Comment:</b> I train x5 a week - do not treat for highs brought on by exercise. You’ll crash. It’ll come down on its own in recovery.<br/> <br/>\n            \n            <b>Comment:</b> I try to be in range around 90-120 before HIIT. Your liver will naturally release glucose to counteract the stress you put your muscles thru post workout. I always dose a 2-4 units after lifting. Expect a crash later in the day. Once the crash begins: snack time. \n\nTrial and error my man. Just be prepared either way.<br/> <br/>\n            \n            <b>Comment:</b> I know it’s no convenient but you just have to do trial and error and find the right combination of snack/insulin pre and post workout. \n\nFor me if my sugar is in good range 80-130 I dose ~2-3 units and have 20g carb granola bar. 45min lifting and 30mins cardio  later my sugar usually is 120-160. Depending on the trend I’ll have another ~2-3units with my post workout shake which has 10g of carbs 30g protein (I’ve found I have to dose for liquid forms of protein).\n\nWhen I did HIIT, the same protocol works but my glucose would spike to 200 if not higher before coming down 30-45min post workout. Once in a while if my diet that week hasn’t been good or if my glucose numbers are running high the spike of HIIT gets too high or wouldn’t come done easily. It became a hassle and now I alternate elliptical/stair master and some interval work on a stationary bike but I don’t go as intense. \n\nObviously your miles may vary but keep at it 👊🏿<br/> <br/>\n            "}
{"id": "1bonuuj", "text": "\n        <div style='user-select:none;'><b>Post Title:</b> Can anyone share their experience with the Tandem Mobi?<br/>\n        <b>Post Content:</b> So my pump’s warranty ran out earlier this year. I’ve been working with tandem and the company that supplies my site on the getting the replacement. My current pump works fine which is the T:Slim 2x. The mobi was brought up today and I was looking into it as it seems generally good since I can be a high activity person both out and bout as well as indoors. But I want to hear from those who currently have the mobi.</div><br/> <br/>\n        \n            <b>Comment:</b> Just search tandem mobi lol<br/> <br/>\n            \n            <b>Comment:</b> I’ve had the mobi for about a month now and I really love it. Totally forget I’m wearing it all the time because I don’t need to take it out and it’s so small. \n\nThe biggest difference for me is the weight. it is SO light compared to the tslim. the tslim used to weigh down my pockets and the mobi doesn’t at all. \n\nI do sometimes miss having the screen that the tslim has, but overall I prefer the mobi. just keep in mind it only holds 200 units and you must have an iphone<br/> <br/>\n            "}
