{"id": "o86mnj", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How do I change the time of the day when I take Lantus?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> First time trying to crosspost.. Adding the text here as it didn't show up. 😊\n___________________\n\nHello! \nRecently I've noticed that my bg almost always drop during the night. I take my Lantus at 11 at night, go to sleep at midnight. Then, around 5 or 6 in the morning, I get a low notification and have to go up and have half a glass of juice and half a sandwich. That usually keeps me ok (rise to about 6mmol) until it's time to go up at 9. Sometimes I drop once more and have to eat again at 8. \n\nEven if I go to sleep at 7-8-9-10 mmol I'll still drop. I HATE waking up to alarms during the night!\n\nI figured my Lantus kicks in too hard and too soon when I take it, so I'd like to take my Lantus in the morning instead. But how do I change that? Split the dose one night, then it's fine to go the next day? Any tips from someone that has changed the timing? ❤️\n\n(Yes, I can call my team, but I'd rather try fixing this by myself. As long as I feel good I can do what I want.)\n\n\nDiabetes t1 since 2008, f31, mdi, libre2. Latest hba1c 42 (ca 5,8%)<br><br>\n  <b>Comment 2:</b> Well, I faced a similar issue. My bg levels dropped during night, while by evening it started to spike. So I figured that it didn't stay in my body for long. What I did was make it half and half across 12 hours period. Gradually, then I adjusted the dosages (earlier I was taking 10 units at night) and started taking 3u at morning and 5u at night.<br><br>\n"}
{"id": "15llts3", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can you switch between two different phones everyday for a libre 3 sensor?\nIf you had two iPhones - a work phone and a personal phone, and you strictly had the one for office hours, and your personal cell was never in the office with you, could you have the work phone connect to your Libre 3 sensor during your 8-5pm hours, and then connect your personal cell to the sensor once you leave the office?\n\nMy work phone will not leave my office and my personal phone is not going to come into the office either, so please just let me know if the first paragraph is possible?\n\nThank you!</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I have no experience with Libre, so idk, but if your libre is connected to a personal phone, and if in the US, you have a legal right to have your phone on you at work, and your employer can’t deny you that because your phone is a medical device and is protected under ADA. Now, if you just don’t want your phone on you for some reason, that’s your choice.<br><br>\n  <b>Comment 2:</b> So the Libre 3 sensor feeds data to your phone continuously, so it doesn’t let you pair multiple devices to it (afaik anyway). The Libre 2 does however let you scan with multiple devices/phones. \n\nYou don’t need to use both phones though - if you’re in the states your phone counts as a medical device, your work has to let you use it.<br><br>\n  <b>Comment 3:</b> I do not believe so, and unfortunately they do not allow the Libre 3 to connect with the reader device and the app at the same time.  \n\n\n* https://www.support.freestyle.abbott/hc/en-us/articles/17309393719569-Can-I-interchange-using-the-FreeStyle-Libre-3-reader-and-app-while-wearing-a-FreeStyle-Libre-3-sensor- \n\nThe only workaround I can suggest is having a cheap simple third phone that you carry everywhere and use the LibreLinkUp app on your personal and work phones. That is really cumbersome and probably not what you want.<br><br>\n"}
{"id": "yzakxp", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can I get an understanding from someone who knows more than me? More info in comments</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> So this is my first day with the dexicom. I’ve had a few drinks tonight some of which were cocktails so high sugar content. Prior to dexicom, I’ve always checked BS before drinking and then I would check before bed, then often in the morning I would be low. I can now see that this trend is very likely to continue at the time of me typing this. \n\nI’ve had no extra insulin, yet for some reason my blood sugar is dropping? Prior to dexicom I only had my snapshot window blood sugar tests, it would show prior to drinking Normal bs, then when I get home, normal bs, and then in the morning I always run low? I take my long term Optisilin (used to be called Lantus) at 7:00 in the morning and this is maybe the only thing I could think that could be causing this? However, during the week where I’ve had no alcohol I don’t run high or run low?? What am I missing???<br><br>\n  <b>Comment 2:</b> I typically stay away from sugary drinks….most often light beer.  For probably 15-20 years I was blind to these phenomena as well but I knew be careful when trying to cover alcohol.  \nNow with cgm and tandem I will try to cover alcohol at least early in night…and as the liver begins to shut down sugar I am not covering the drinks.  When I drink excessive amounts I find I get the munchies before passing out.  There have been times where food was eaten and I have no logs showing was covered and blood sugar didn’t rise….good to have a small snack before bed. I’ve used energy bars for this since they take a while to breakdown into sugar<br><br>\n  <b>Comment 3:</b> Alcohol makes me drop overnight!<br><br>\n  <b>Comment 4:</b> Yeah your lantus is peaking.<br><br>\n  <b>Comment 5:</b> I'm skeptical this isn't separate things. Cocktails are not very sugary in most instances, like have you guys made a cocktail ever? Idk what y'all are talking about, that's a major spike. If your idea of a cocktail is whisky and coca cola, then ok lol, you should prob stop that. This really isn't enough data, I think you are not bolusing correctly on your dinner and the alcohol maybe dropped you a bit along with insulin still in your system doing it's thing. But alcohol doesn't usually drop folks 6 hours later, that's not really how it works.   \n\n\n\"I've had no extra insulin\" is a nonsensical statement tho that communicates nothing to help understand what's going on here. But as is, you aren't going low here. There are way too many variables, you aren't nearly specific enough, and you are just getting a feel for it. It takes time, you will develop a much deeper understanding of your body, food, insulin, and diabetes. keep it up!<br><br>\n"}
{"id": "1ccjjgl", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Candy for low blood sugar spells?\nThe doctors are still trying to find out what’s wrong with me but I go through times where i get super dizzy and my blood sugar drops. I’ve been keeping different candy’s on hand but I read that if you eat too much sugar that’s also bad. So i was wondering if anyone could share certain candy y’all eat for the spells and how many pieces? (Ex: 6 Swedish fish, 3 starburst, etc.)\n\n17F\n5’0\n77 lbs</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> 3 mini tootsie rolls (15 carbs) does it for me<br><br>\n  <b>Comment 2:</b> I eat 1 Fruit-to-Go bar. No counting while my brain is not at full capacity.<br><br>\n  <b>Comment 3:</b> Skittles are about 1g per and easy to count.  I stick to 15g if actually reading low and wait 15m before eating anything else, unless I know I missed.<br><br>\n  <b>Comment 4:</b> You really can’t figure this out yourself? Whatever candy you have just read the nutritional info and have the usual amount of carbs you have to treat lows..<br><br>\n  <b>Comment 5:</b> I usually use two SweetTarts or one HiChew. 2-4 grams of carbs is usually enough.<br><br>\n  <b>Comment 6:</b> Get a decent scale, and test in a flat daily moment. \n\nFor me each gram of sugar raises my BG x5 the weight, so 2 5g candies ( 10g total ) raise my BG roughly by 50mg/dL within 30 minutes. \n\nFor me, whenever I'm 85 trending down, that means it's time for a candy to keep it in range. \n\nIf you can find dextrose / fructose candies, that's always better than sucrose.<br><br>\n"}
{"id": "12ibpjs", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How do you deal with this?\nAs I get older, within years I am in shock with how people  will go at extreme lengths to hurt someone. I mind my business (I think that’s what triggers them) look…. It’s bad enough I gotta wake up every day choosing to be a healthy person who has to deal with diabetes daily. Im tired of toxic people in general. Especially at work. How do you guys as diabetics deal with toxic people ?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I avoid them is the simple answer.\n\nThe first time anyone referenced my diabetes at work, I came down on them very hard, which killed that idea off. But I come down hard on toxic people generally.<br><br>\n  <b>Comment 2:</b> Depends on who it is and what they're saying. Is it a supervisor at work, just a coworker in the same position? \n\nI'm one of the youngest at work and the only T1 so other coworkers, including the type 2's have a lot of 'advice'. Being polite but firm and saying 'Well I'll think about it' usually works as deflection if I don't want to deal with it.<br><br>\n  <b>Comment 3:</b> I say the golden line; Look, I'm a diabetic, and I deal with enough pricks as it is. F off 🤣<br><br>\n"}
{"id": "qbsb6o", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to deal with moodiness from highs and lows\nI (21F) asked this girl I know who’s diabetic and she told me she just decided one day she wasn’t going to be moody anymore but I just can’t turn of these emotions. Any advice?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Not sure if I’m fully understanding your situation from this post vs the title - but I do think that you should consider therapy. I’m saying this as someone who has consistently put it off for 10 years, half tried and bailed, and finally made a consultation for next week. My moodiness doesn’t necessarily always correlate directly with high or low sugars, but I know that the stress of t1 in general contributes to my general anxiety and anger including when my blood sugar is out of whack.<br><br>\n  <b>Comment 2:</b> Whenever I’m high or low I am pretty stupid so I don’t worry too much about moodiness. But unrelated to highs and lows whenever I am moody I just separate from people for a bit so I can kinda recalibrate everything.<br><br>\n  <b>Comment 3:</b> Totally confused. \nAre you a couple?\nAre you concerned about her or you?\nAre u diabetic & moody?<br><br>\n  <b>Comment 4:</b> If we could all turn off our emotions when they step out of line we would…therapy, emotional intelligence education, and practice.\n\nIt’s not something that is over night. Don’t stop working at it, but still find joy in where you are now<br><br>\n  <b>Comment 5:</b> Don't try to ignore them, use them as a measure!\nTrack them against BG reading, you may gain some insight.\n\nIf they are tied to highs & lows then you need advice on getting better control.\n\nIf not, Try to find a therapist to give you some insight!<br><br>\n"}
{"id": "q92zcg", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>cannula problems w/ new medtronic infusion sets\nI just started using the new infusion sets for my medtronic 770g pump. I never had any issues with the old infusion sets for the 2 years I had it, but within the last month or so of using the new sets ive had 2 instances where my cannula became bent and my bg was horrendously high.\n\nanyone else experience this?? \nTips to avoid??</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Haven’t had problems with a vent cannula, but recently my pump has had a seriously hard time sticking to my skin and staying in place. Since I replaced it the other night it’s been ripped out 5 times.<br><br>\n  <b>Comment 2:</b> Just started the 770g pump with the mio advance last month.  Only issue I've gotten was infusion blockage. But I can clear it and seems fine after<br><br>\n  <b>Comment 3:</b> Which infusion sets are you using? Some are much better than other in my opinion<br><br>\n  <b>Comment 4:</b> The infusion sets irritate me, always blocked or causing disruption to the insulin flow.<br><br>\n"}
{"id": "10kzzu7", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can Tzield be used on a 6 year old ?\nMy dad's side of the family has a history of T1D. I am aware that Tzield has been approved very recently by the FDA but having looked more into it, the articles seem to claim that it can only be used in children 8 years or older \\[[https://www.fda.gov/news-events/press-announcements/fda-approves-first-drug-can-delay-onset-type-1-diabetes](https://www.fda.gov/news-events/press-announcements/fda-approves-first-drug-can-delay-onset-type-1-diabetes)\\]. \n\n&#x200B;\n\nMy cousin was considering screening her children (if there are even any programmes available) but they are not 8 yet. If they progress to stage 2 before they can start Tzield, does that mean they won't be able to receive the treatment ? What are their alternatives ?\n\n&#x200B;\n\nThanks.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I would contact the patient connect number they provide and talk to them.<br><br>\n  <b>Comment 2:</b> There are trials happening, and doctors can also prescribe off-label. It’s worth at least getting their antibodies tested.<br><br>\n"}
{"id": "10mcjl3", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How does grief affect your blood sugar?\nHi everyone,\nI was just curious to hear how grief has affected your own blood sugar? I'm about to say goodbye on Saturday to my furry Best friend Chelsea. I've had 15 amazing years with her. And now it's sadly time to say goodbye and let her go. She has mammory cancer, chronic pancreatitis, and an intestinal blockage that won't get better without major surgery. But I can't put her through that, there's a high possibility she wouldn't even survive the operation. I've noticed the past week my blood sugar has been pretty elevated staying in the high 200-300 range even with my usual insulin regimen. Has anyone else experienced this in stressful situations? Should I increase my insulin for now? And am I at risk of going dka? Thank you all.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Yes. Stress hormones cause a rise in sugar levels. This is why long term stress is very dangerous.<br><br>\n  <b>Comment 2:</b> Yes, stress will elevate blood glucose. You will have to increase your insulin dose to compensate but be prepared for lows when your bg returns to \"normal\" as the stress subsides. If you're on a pump it's much easier to mange because you can raise the basal rate...\n\nLive Long and Prosper<br><br>\n  <b>Comment 3:</b> Sending huge hugs. It makes mine go so high, but that's natural when you're under so much stress. The weeks after I lost a close family member my insulin barely touched me. Be kind to yourself x<br><br>\n  <b>Comment 4:</b> Sending all of my thoughts and big hugs during this difficult time. I found out a few days before Christmas that my sweet girl has bladder cancer (she’s almost 15) and just the devastation from that news and a lot of crying, gave me insulin resistance. In my opinion, I feel that you need to let yourself grieve and be a little relaxed on your blood sugar levels. Looking ahead for when my girl passes, it will be really difficult and I’ll have to be less strict on my diabetes management temporarily just since life will be difficult enough as it is. Again, sending thoughts and just know that we are all here for you!<br><br>\n  <b>Comment 5:</b> I am so sorry....she will always, always be in your heart.    \n\n<3<br><br>\n"}
{"id": "kyauqy", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to give yourself a needle\nHi everyone! I’ve been a diabetic for a little bit over a year now and I need to start giving myself insulin shots, I’m not scared of needles however when the time comes for me to give myself a shot I just can’t do it. I was wondering if there is any advice for being able to give yourself a needle and was also curious about others experiences giving themselves their first needles.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I was definitely scared of needles to start with. I had to have a friend show me even finger pricks before I would try it. \n\nIt's terrifying, it's nerve wracking, and in the end, the anticipation and worrying is ABSOLUTELY so much worse than the actual needle. I did needles for about a year before switching to a pump, and maybe 1 in 10 actually \"hurt,\" approximately as bad as a moderate pinch.\n\nA badly placed finger prick is worse than the worst needle I've had, and it doesn't even hurt as long as a bad finger prick.\n\nI'd suggest started by using the needle in your abdomen, and when you're used to it, try side thigh or back of arm. \n\nSometimes they'll bleed, but usually with very little pain. I'd recommend getting those little circle bandaids if you're worried about stains, but I never did.<br><br>\n  <b>Comment 2:</b> Your first few times giving yourself shots are always the most difficult to do, but eventually once you do it enough it becomes as mundane an activity as any other. I’ve been a T1 for about 12 years (plus some change), I can tell you it definitely gets easier but you just have to slowly train yourself into a “mind over matter” mentality about it. Remind yourself of a few things: it’s not going to hurt nearly as bad as you think, you need this insulin in order to maintain a healthy lifestyle, you’ve been receiving insulin for a little over a year now, and anything else you can think up that helps you psyche yourself into administering the shot. You just gotta pump yourself up so you can get over that paralyzing anxiety hurdle that stops you cold at the last second.\n\nWhen I was younger, I used to be so afraid of getting shots that I would hide from my mom whenever I knew we were going to eat because I didn’t want to test or do my insulin. Eventually though, I got comfortable with it after I practiced telling myself that it wasn’t going to hurt, and I found that helped so much in reducing the anxiety I was feeling about doing insulin. When I was comfortable with that knowledge, it was only a hop, a skip, and a jump for me to learn to draw up my own shots and start doing them myself.<br><br>\n  <b>Comment 3:</b> For me, I’ve found that meditating before doing it really helps. I know it sounds weird, but if you’re more calm and relaxed it’s actually much easier. I personally would just close my eyes and focus on things opening to get this idea of my skin being more open to the needle, less mind friction I guess. Idk, but it worked for me. Good luck, there’s lots of ways to make the issue better without giving up for sure.<br><br>\n  <b>Comment 4:</b> Try and buy a steady shot it helps you get used to giving yourself insulin and goes for about 24.99 on Amazon. I have one and highly recommended it to anyone struggling to give themselves insulin<br><br>\n  <b>Comment 5:</b> Find a few good spots, take a deep breath as it goes in, maybe watch some tv or something to take your mind off it<br><br>\n"}
