{"id": "1c7r5x5", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Periods \nHow do periods affect bg levels ?\nI have irregular periods and am either very low or very high. Someone please help 😭</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I always run high, especially in the morning on my period. I adjust my long acting dose. \n\nI also had irregular periods, but I switched to an IUD, which basically got rid of my period.  I have maybe 1 or 2 days of spotting a month. That has helped tremendously!\n\nI think there are other birth controls that will help make your cycle more regular, too.<br><br>\n  <b>Comment 2:</b> Mine tend to run high during my time of the month<br><br>\n  <b>Comment 3:</b> Usually for about 4 days before my period I had high BGs, was moody, craving carbs, sweets and salty snacks, then my period would start and my BGs would plummet and I would crash!  I had been started on an insulin pump and got help creating a special basal rate just for the premenstrual time.  I had to keep track and remember but once I turned it on, it helped with my numbers.  Not sure what to do with the irregularity tho…makes it hard to predict but perhaps if your numbers start creeping upward for no apparent reason that is your cue?<br><br>\n"}
{"id": "18smbde", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to start GLP-1 and avoid lows?\nThe pharmacist I work with at my doctors office is interested in putting me on a GLP-1 to help with insulin resistance and appetite reduction. I’ve been doing research here and there and see overall great results, mixed with nausea and some bad lows. \n\nHas anyone had success starting one of these drugs and avoiding lows? I’ve seen people mention a total daily insulin reduction of 25%-50%. Maybe I reduce basal down 25 or 50% from the get go and see how much the GLP-1 drug contributes and increase insulin from there if needed? \n\nAny input is much appreciated!</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I’ve tried both, no issues with lows. I have a tslim and it will just reduce my basal if needed.<br><br>\n  <b>Comment 2:</b> Took 4th dose of 0.25mg today. Was on Lantus + Apidra earlier. Take 0.25mg Ozempic weekly, plus 18U Lantus daily + 2-4 units Apidra if BS spikes over 250.   \nPrior to Ozempic, my BS was wild stayed above 250 usually and will get 3-4 hypos in a day if increased either basal or bolus. Before breakfast I would wake up with BS around 130 and upon walking up to freshen up, before doing anything (like within 15 minutes getting out of bed) eating anything BS would spike to 180... ON FASTING STOMACH. It does not happen anymore \\~ high BS spikes are much controlled. Response to short acting insulin is much better. But I get a daily hypo around 6-7 AM if I am not hyper-vigilant. Sucks. Usually I wake up at 9-10 am not before that. But cant afford rn.<br><br>\n  <b>Comment 3:</b> I am a T1 who has been on Saxenda for about 2 months. I use O5 and G6. I have had 2 bad lows in this entire time, and honestly, think that the second one came about as a result of alcohol. I was at a music festival at an all inclusive resort with friends who drink a lot and honestly having 2 drinks a day along with edibles over the course of 4 days, by the last night, I had a horrific low that wasn't even registering on G6 and I had to administer glucagon. I do not think that it was my medication, more that blip in my lifestyle radar. (In my normal life, I have like 2 drinks a week, maybe.) When I got home, I told my endo and she had me change some settings in manual mode, but since then, I haven't had any lows. \n\nI saw my endo and my A1C decreased from 7.1 to 6.6, my TIR is absurd, like 90%, and I have lost about 15 pounds. This is only 2 months in. I did have side effects in the beginning, head aches, queasiness, I vomited twice mostly due to eating too close to bed time (your stomach empties slower), but overall, it's a pretty big help. \n\nI think about it this way. In normies (without obesity, but with a pancreas), there is an organ that secretes all of these hormones to keep us in check. There aren't ONLY (insulin secreting) beta cells in your pancreas, there are 5 cell types that secrete a whole bunch of hormones -glucagon, insulin, somatostatin, ghrelin, and pancreatic polypeptide. For us, our pancreas is destroyed, but by only taking insulin, we are only replacing that one hormone and not the other hormones that have also been taken out as a result of the autoimmune process. \n\nMy endo also had me not go up to the highest dose, which would have been my next step. I am currently at 2.4 mg daily. It is still working well. \n\nGood luck, and hope you don't have any issues finding your med! It's a problem and whatever you do, DO NOT USE COMPOUNDED PRODUCT. Use only the innovator product in pens.<br><br>\n  <b>Comment 4:</b> I kept my basal the same and split bolus for meals, that way I can increase/decrease on the second half as needed. Haven't had any problems. Overall lowered my bolus intake probably 30-40%.<br><br>\n"}
{"id": "cemdit", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>T1D spikes and memory\nHow does diabetes affect memory?\n\nMy father has been a T1D for 30 years and he is 55yrs old. We have noticed the last few years that his memory has declined. His BS levels are regularly all over the place and he easily hits 400 multiple times weekly. \n\nHe’s had all relevant testing done and all blood work has come back normal. Is his increased forgetfulness likely due to his lack of control.\n\nHis father has Alzheimer’s and is in his early 80s. Is this even possible at this age? He’s even had neurological testing done and mild decline showed by the doctor was not worried about alz....\nHe should be getting a pump soon. Any insight?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I feel like low BS are destroying my memory.  On average for the last few years I’ve had 3-5 lows a day. My doctor says it sounds like depersonalization disorder but we’ll find out in a few weeks when I see a specialist. :/<br><br>\n  <b>Comment 2:</b> Hypos over a long period can damage short term memory.<br><br>\n"}
{"id": "s3mhji", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can't get my bg down ):</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Could be a few things, maybe you are getting ill? Or maybe you missed your basal injection? Maybe your insulin has gone off. I'd start with changing your insulin if possible. If you have missed the basal insulin, you will need significantly more insulin to remain stable, do that until your next scheduled basal injection, don't double up basal if you are not sure whether you took it or not.\n\nIf you are ill you will likely need more insulin to remain in range aswell.<br><br>\n  <b>Comment 2:</b> It sounds like maybe basal is off? Hope you get it sorted<br><br>\n"}
{"id": "dlaq8k", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How type 1 diabetes is treated in the US</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> facts<br><br>\n  <b>Comment 2:</b> When I got diagnosed 2.5 months ago I had to go into the ICU and the bill ended up being over $22K<br><br>\n  <b>Comment 3:</b> (In the US) I could go to rehab for opioid abuse for 30-60 days for free... but I can t spend 1-2 nights in the Hospital for dka...after using that “Walmart” 25 dollar insulin that everyone and their mother on Facebook RAVES about.... it is not the same, and should never be switched from your current insulin to this 20+ year old insulin without doctor supervision, which is Duh, the reason I was taking Walmart over the counter insulin was because I did not have doctor supervision....<br><br>\n  <b>Comment 4:</b> For fuckin real.<br><br>\n  <b>Comment 5:</b> True that.<br><br>\n"}
{"id": "1ajl5yp", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Sliding Scale\nCan anyone in here provide me with a humalog sliding scale? I had one and lost it and have already called my primary more than once this just to get insulin filled and don't feel like calling them back again.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> If you're not getting a response from your phone calls, you might have better luck going down to your doctor's office in person. It wouldn't be reasonable for someone else to tell you how to dose, partly because dosing is so individual and mainly because sliding scale is an older, not-as-effective way of managing blood sugar.<br><br>\n  <b>Comment 2:</b> There is no way that someone else can tell you how much insulin to take - we are all different. You really do need to call your doctor. If all you have is a sliding scale, you might want to look for a new doctor, too - that's not a very modern or effective way to manage type 1.<br><br>\n"}
{"id": "rb34yc", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How long do you wait before you give another correction?\nMy son went to bed with a 102 temp last night. Climbed up to 260, I gave him a correction. \n\nIt’s been two hours and he hasn’t gone down and I just gave him another correction.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> 2 hours is typically fine as by that time you should be able to see if it’s (starting to) going down or still up.<br><br>\n  <b>Comment 2:</b> I wait until there is no IoB aka insulin active time<br><br>\n  <b>Comment 3:</b> Generally 2 hours, sometimes 1.5 hours if it’s gone up in that time. My kiddo has a dexcom so can watch closely to see if things start dropping quickly. Sometimes it’s hard to bring down, other hormones are always at play as well as growing bodies that are changing.\n\nJust reread that he has a fever.. so, this complicates things further. Keep him well hydrated, and check for ketones. If he has ketones, he’s at risk for DKA.<br><br>\n  <b>Comment 4:</b> Get him to run around a bit<br><br>\n"}
{"id": "ho8kxl", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Correction dose\nHow long does everyone wait after a meal to take a correction dose if you go to high? I know fast acting can last up to 4 hours. And I heard it was ok to take correction after 3 hours.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I am not a doctor.\n\nI would say it depends on how your body uses insulin. It also depends on what you ate and it what order you ate your food groups in.<br><br>\n  <b>Comment 2:</b> I have the Inpen so it shows me how much active insulin I have.  I watch my dex trend and if I'm going up and dont have enough IOB I will correct, keeping in mind my correction factor.  My Inpen allows me to put in my current bs and will suggest a correction based on IOB and my correction factor.  Sometimes I'll only do a half unit correction but it can be prob within the first hour and a half to two hours if i'm just having a really bad diabetes day.<br><br>\n  <b>Comment 3:</b> i typically wait 2 hours! everyone & every meal is different!<br><br>\n  <b>Comment 4:</b> I usually wait a bit, but I’m not your doctor, ask them.<br><br>\n"}
{"id": "n77yn1", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Correction doses\nHow long after a correction dose do you take another? For instance, I had lunch today and needed a correction about an hour and a half later as my initial shot was not doing anything. I took 1.5 units and it still does not seem to have helped. It has now been over two hours since that shot. What would you do in this case? I’m on Humalog.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Depends what you’ve eaten. If you’ve had some chunky carbs (bread, pasta, potato, p**za), they’ll kick around for a good long while.<br><br>\n  <b>Comment 2:</b> I can do a correction dose after 20-30 minutes, but I've experimented a lot so I'm pretty confident when I undershot my dose.<br><br>\n  <b>Comment 3:</b> The next time I consume carbs, although BG doesn't come down instantly so be careful.<br><br>\n"}
{"id": "nw0ljf", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can anyone help me with this?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I am not low. I left my pump charging while I took a shower. It’s been like this for a couple hours now. I’ve checked my blood sugar and I am not low at all.<br><br>\n  <b>Comment 2:</b> Meanwhile you can install an app like xdrip+ on your mobile. You will need your transmitter Id and if it's not your transmitter that's failed then you can still see your bs while you wait for the replacement.<br><br>\n"}
