{"id": "105lwfh", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can anyone help me understand what this means please? More info/ background in comments</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> So I've just got a letter from my diabetic specialist with my diagnosis on and those details on above and he's advised that I'm type 2 diabetic. Now a little background (also not a massive fan of this doctor as he told me he 'doesn't believe in type 3c diabetes' \n\n- March 2022 was hospitalised with pancreatis and necrotising pancreas. On arrival to the ward they took my blood for a HbA1c and it came back as 38. \n\n- In hospital for 3 months at 2 different hospitals. In those hospitals both diabetic teams told me I'm type 3c but to treat myself/ follow advice for type 1 as this is closer and there's not a lot of stuff online for type 3c's. \n\n- While in hospital I couldn't eat so was put on a feeding tube. This was super high in sugar to where I was on 70 units a day and my HbA1c in July was 97 \n\n- I know my HbA1c isn't great now but it's come down and I'm still struggling with my diagnosis/ life but I'm trying. \n\nI'm just struggling to understand why hrs said I'm type 2 from the information I have and know. Like if I wasn't diabetic before then my pancreas dies and now I am surely I'm pancreatic? I was also advised multiple times that I will be diabetic for life now and insulin dependant?<br><br>\n  <b>Comment 2:</b> I'm no expert but here's my understanding of your tests.  \n\nNone of the  tests you've shown suggest you **are** type 2, rather they suggest you're **not** type 1.\n\nSo, the logical conclusion would be you have type 2 as that's extremely common,  but as you say you have 3c.\n\nYour A1c is high so you defo have diabetes. \n\nPresence of Anti GAD, transporter 8 or IA2 are possible indicators of type 1. \n\nYou don't have these which indicates you possibly don't have type 1. \n\nYour C peptide numbers are in normal range ( i think) which suggests you have normal beta cell function... which means you don't have type 1.\n\nI guess you will need blood work that suggests you're not type 2 to convince your doc 3c exists.  I don't know which tests though, as I'm not yet clued in enough about t2. Maybe something to do with your triglyceride levels.<br><br>\n"}
{"id": "r2hcpz", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How high risk am I for developing T1D?\nSo, my father developed T1D at 45 years old. My nana on my mother’s side at the age of 35. Here’s the thing, I am 22 years old and I’ve just been diagnosed with celiac disease. I found out online that T1D is much more prevalent in people with celiac. I was already worried I will develop it one day, but now I’m extra worried. Since I have several risk factors, does anyone know just how likely it is that I will develop T1D? I found the risk factors for development with celiac disease & for having a parent with T1D, but nothing about both together. Pls let me know if I’m posting in the wrong sub for this. I hope you’re all doing well!!! :)</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Google trialnet. Depending on your age you are eligible for free risk screening.<br><br>\n  <b>Comment 2:</b> I wouldn't overly worry about it. It might happen and it might not. My advice is to get a glucose reader and do a quick test every so often, especially if you get any of the symptoms<br><br>\n  <b>Comment 3:</b> If your father has T1 then you have a 1 in 17 chance of getting it.\n\nhttps://www.diabetes.org/diabetes/genetics-diabetes\n\nI don't know the statistics regarding celiac, but I think you might be misunderstanding this fact a bit. I don't think there's anything special about celiac as it relates to T1. Having ANY autoimmune disease makes you much more likely than the average person to have a second autoimmune disease. So that probably does make your odds somewhat worse than 1 in 17, but I couldn't say how much worse.\n\nStill though I wouldn't worry about it as there's nothing you can do to prevent it anyway - it will either happen or it won't. You can get tested if you like to see if you carry the gene that increases your risk of developing it. Otherwise all you can do is be aware of the symptoms and check yourself periodically so it can at least be caught early if it does happen.<br><br>\n  <b>Comment 4:</b> The age that your family members developed diabetes is quite late, and points to Latent Autoimmune Diabetes in Adults (LADA), which occurs most often in ppl over the age of 30.  It is not typical T1D, as it progresses at a much slower rate, even though the end treatment is the same (insulin reliance).  You can do some research on LADA, and there are antibody tests that are used to confirm its diagnosis, but I’m not sure if the tests can be used to predict your likelihood of developing it.  Some ppl on this sub have rather strong opinions about LADA vs T1D, so they may offer more info about it.<br><br>\n  <b>Comment 5:</b> My dad got it at 28.  His sister got it late 30s.  I got it at 46.  My siblings in their mid 40s don't have it.  I never knew I had a 1/17 chance.  I never worried about it.  I figured if it was coming it was coming and there wasn't a lot I could do about.  I lost the dice roll on it.  I'm dealing with it.  Do the TrialNet testing if it's something you can deal with.<br><br>\n"}
{"id": "jq8tsq", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can you use insulin pen needle to prick your finger?\nThere's no insulin inside pen</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Yes, but it won’t be pleasant.<br><br>\n  <b>Comment 2:</b> Yes, I have used it to pop ingrown hairs, pimples and other things that need a sharp fine tool.<br><br>\n  <b>Comment 3:</b> I've used bare lancets when I couldn't find my pricking device. Worked fine, of course. Pen needles are the same sizes as lancets, but are a lot longer so be careful.<br><br>\n  <b>Comment 4:</b> You could use anything sharp, since you just need the blood to go into the test strip, but for the most “pleasant” experience, I would say to use the needles and “poker” they give you.<br><br>\n"}
{"id": "tt9kjd", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How I Compiled A Perpetual Backup Cooling Plan For My Insulin Stash For Under $1,000\nEdit: if it’s not clear from the post….I’m talking about my two years worth of backup insulin, not my day to day stuff.\n\nThis came up in the comment section and after answering that, I thought I’d make it a post. I compiled this after lots of research for my own peach of mind regarding a power outage.\n\nI’m not a prepper by any means, but a power outage is my realistic worst case scenario for my insulin.\n\nIn the unlikely event of SHTF, camping, or roadtrips, this is also nice peace of mind.\n \nWhat I’m going into here will be a wall of text and isn’t exactly what you have to do, just putting my own conclusions up from my hours of research.\n\nMy personal budget was about $1,000 but I didn’t accumulate everything at once, and this can be modified.\n\n1.\t⁠POWER STATION - A power station is just awesome in general to have. Think like a battery pack you might carry for your phone, but with dramatically more capacity. They will come with regular outlets on-the-go which is convenient and usually include lots of USB ports for smaller things like phones/tablets/laptops. In my instance, my rabbit hole started because I wanted to find a way to backup cool my insulin if I ever lost power.\n\nThings I looked for in a power station (and you should too)\n\n•\t⁠LifeP04 (lithium iron phosphate) batteries and NOT standard lithium ion batteries we’re used to in everyday life. LifeP04 batteries have two awesome benefits over lithium ion: 1) they can be recharged about 2500 times before losing capacity unlike lithium ion’s which are usually cooked after about 500 [think like your cell phone that doesn’t hold a charge as well as it did two years ago]. And 2) LifeP04 batteries are much more stable than lithium ion batteries in heat. If’ I’m ever moving around in my car and the summer sun has my trunk over 100 degrees, I have peace of mind knowing I don’t have to worry about fire hazard.\n•\t⁠\n\n\nMINIMUM 500Wh CAPACITY: One thing you find is that a lot of random appliances require a shocking amount of energy. To have a viable option for a battery pack that won’t be out of juice instantly, make sure it is appropriately sized.\n•\t⁠\n\n\nSOLAR CAPABILITY: Did you know you can buy nifty portable, light, solar panels that can charge your battery pack if it has the ability? This was really important to me because if we lost power, I wanted a way to produce enough energy that I could power a small fridge indefinitely off the sun for my peace of mind.\n\nPASS THROUGH CHARGING: Not all of these power stations can let you use your wall plugs while you are charging the station itself. If you buy a station with pass through charging, you can simultaneously charge the power station from your solar panels, while leaving your compressor fridge plugged in and running.\n\n\n\n2) COMPRESSOR FRIDGE - Did you know even a standard mini fridge can usually kill a big 500Wh power pack in a couple hours? That doesn’t work for me if I need an insultin solution, so I looked into compressor fridges.\n\nThese are usually around the size of a cooler, but they have compressors that can keep them actively chilled. They plug in with a 12V car charger and only pull about 10W to run. This means, if I have a 500Wh battery pack, it can hold enough juice to keep my fridge running a couple days when without charging.\n\nEven if my battery packs can’t recharge with my solar option (night/rain/cloudy), I can still plug the fridge into my car’s 12v circle charger. HOW COOL IS THAT? ————————-\n\nSo here are some links of what I bought. You don’t have to buy exactly what I did, but I’ve been quite happy with my setup and am happy to vouch for it.\n\nIf anything, I hope this lights the urge in you to do your own exploring and see if you learn more.\n\nI cannot recommend JASONOID on YouTube enough as a cool resource for all this.\n\nBLUETTI EB55 (These sometimes go on sale) I caught mine on amazon for $399 https://www.amazon.com/BLUETTI-Portable-Generator-Regulated-Emergency/dp/B098LSKJHH\n\nSetpower 45L (used to be about $300. Inflation sucks.) (This is a cheaper, well reviewed, clone of ice on 45 which is about $550) https://www.amazon.com/Setpower-Portable-Freezer-110-240V-Refrigerator/dp/B08CZMKRZ6\n\nBig Blue Solar panel https://www.amazon.com/BigBlue-100W-Portable-Solar-Panels/dp/B095Y9W18C</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Couldn't you just use a bunch of Frio packs, that you refresh with water every 2 days?<br><br>\n  <b>Comment 2:</b> This seems like overkill, but I love the effort and explanation. I've backpacked for weeks before in tropical climates using only small Frio packs to store insulin, often without a fridge, and it did just fine but I fully understand that's not always the case.\n\nCool(heh) to prepare yourself. ❄<br><br>\n  <b>Comment 3:</b> I’ve been leaving insulin in a hot car during Florida summers for a decade but that’s a neat idea.\n\nMore important thing in my opinion is to have a large enough stash of insulin to sustain yourself for a long time.<br><br>\n  <b>Comment 4:</b> I gotta admit I’m impressed. I came here for ideas. You’ve given me a few. Thanks.<br><br>\n  <b>Comment 5:</b> Great advise<br><br>\n"}
{"id": "vb7con", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How do I best support my T1 partner?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Just try to learn about the condition and let them take the lead. It’s frustrating when people try to micromanage what I eat without knowing the situation. \n\nTypically partners take a hands off approach, know how to access their blood sugar in case of emergency. Know how to give an insulin shot (though you probably never will). \n\nABSOLUTELY LEARN HOW TO USE GLUCAGON<br><br>\n  <b>Comment 2:</b> cheer ‘em on from the sidelines<br><br>\n  <b>Comment 3:</b> Don’t micromanage or comment on the food they eat. Let them manage their condition as much as they can on their own. Try not to offer advice unless they are seeking it. Try to understand the condition the best you can. Know the difference between getting too high or too low. Know how to administer their emergency medications. Be supportive of them on difficult days. Try to be empathetic of the stress that comes along with managing a chronic illness. Understand how the stress or even physical symptoms caused by T1D can affect sleep or mood<br><br>\n"}
{"id": "1ahqch1", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can my sugar dropping without me realizing it cause nausea?\nThis is probably stupid and Im sorry for the formatting. I have been laying in bed nauseous for a little while, not super bad or anything just not feeling great. For context, I suffer from emetephobia and last week I had a stomach bug. Every day since then has been getting a bit better, but I have still been nauseous and extremely anxious daily. Today, I ate at about 11:30pm for dinner (got off work late). I was at 167 when I ate, rose to a max of 247, and ever since I was up that high it’s been going down from about 12:50am until now (2:10am). I am now sitting at 108. I know that is a normal number but I am feeling extremely worried. I hadnt looked at my number since I started to go down, and that entire time Ive been nauseous. I guess my question would be, is it normal to feel nausea when my sugars are dropping? \n\n\nI havent felt normal in over a week so Im sorry if this sounds dumb, just looking for some answers to why Ive been like this for 9 days (anxious and nauseous) :(</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Yes, it happens to me too but with a myriad other horrible stuff.\n\nIn your case you are probably hyper aware of your poor tummy’s trauma from last week and your brain was hollering at you in case.\n\nI hope you’re feeling better.<br><br>\n  <b>Comment 2:</b> A quick drop down definitely makes me nauseous. Often I’ll feel that before any other low symptoms, just before my Dexcom shows the arrow turn down. It usually goes away pretty quickly- never had it stay all day. I can’t say for sure that’s what’s causing yours, but it’s definitely a possibility.<br><br>\n  <b>Comment 3:</b> If I’m dropping fast (even in range) i definitely can feel nauseous or get headaches!<br><br>\n"}
{"id": "q7dkfd", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How do you notify freestyle Libre if there sensors quitting early and costing you and arm and a leg as well? Anyone ever get them replaced?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I just call them and have ever get a new one. Sometimes they want the sensor back, sometimes not.<br><br>\n  <b>Comment 2:</b> Call customer service and let them know. Pro tip: don’t remove or replace until they tell you to. I had 14 fail this year, they replaced about 11 of them. Not sure what was going on, but they were really off/faulty this summer. Seems to have gotten better in the last few months.<br><br>\n"}
{"id": "jwoa1y", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to measure rice / oatmeal?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> For rice, I weigh it dry, and then x3 for the cooked weight. My usual 60g dry rice, which comes to 180g cooked, comes out for me at 45g carbs, but I use white rice - I don’t know about brown<br><br>\n  <b>Comment 2:</b> Read the package it should state how to weight it. Yes the rule of thumb is cooked weight.<br><br>\n  <b>Comment 3:</b> For oats the weight is typically dry. For regular old fashioned rolled oats, 80g is about 54g carbs.<br><br>\n"}
{"id": "1alafag", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Cataracts in eyes after Vitrectomy\nHow many people have experienced cataracts in eyes after vitrectomy surgeries? I’ve had extensive laser, injections and vitrectomy in both eyes and I’ve noticed a cloud kinda forming in my irises. I see my othamogist  regularly and he hasn’t made a comment about anything? I have regular scans, pressure taken, dilation. I’ve just started to notice I get blurriness that comes and goes and I thought it was just dry eyes but I’ve noticed in photos the weird looking film.\n\nI’m freaked out, just looking for some guidance and personal experiences</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Not had a virectomy yet but due one. Have been told by eye surgeon that cataracts are inevitable. Partly why it has been put back.<br><br>\n  <b>Comment 2:</b> I have moderate retinopathy. I got cataract surgery at 35yo as a result of laser and high sugars putting them into overdrive. My opthamologist couldn’t get a good view of my retina it was so cloudy, which is why I went ahead with it. \n\nI got to say, it was a good things for me. I went from -6.75 with HORRIBLE night vision and worsening colour vision (as a graphic artist this was an issue), to 20/20 vision with colours being bright again and nighttime vision restored. I need a light correction for small type (I wear readers while working) but am glasses free. The hardest part was being careful for the 4 months while things healed (no lifting over 10lb or leaning over for 2 months, then repeat for the other eye). I am very happy I had it done so young. \n\nI haven’t had a vitrectomy. But I get eye shots ever 6-8 weeks in each eye still.<br><br>\n  <b>Comment 3:</b> I was born with cataracts from an injection my mother got when she was pregnant with me. Doctor verified them when I was 9 at my 1st eye exam. Diagnosed w T1D when I was 12, back in 1975 before glucose monitors were invented. Cataracts didn’t impair my vision until I was 35, so had left eye done first, only to learn I am allergic to the most common  eye anesthesia. Had an asshole of a surgeon who didn’t believe me when I called after hours in severe pain & told me to “buck up and drink a beer”. Was scheduled to have other eye done the next week, but refused to see same Dr, so waited 10 years & went down to U of M Kellogg Eye Center, where they used lidocaine instead of Preparacaine in my eye. Went great that time. Now I have better eyesight than I did when I was 9 years old!  Since I was young when I had the 1st one done, they used a multifocal  lens in my eye so I could see both distance & up close. When you have them done at older ages they don’t use a multifocal lens unless you pay extra for them and you have to wear readers. I have only had a small bleed on my left retina after 49 years of T1D & only had laser treatments on that eye, so haven’t had to have a Vitrectomy, so I don’t know if that causes cataracts. If you aren’t allergic to the anesthesia the surgery for cataracts is easy and so beneficial!!<br><br>\n"}
{"id": "10hslar", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to Calculate Insulin Dosage?\nHi,\n\nAs the title says I’m trying to understand How should I calculate my insulin dosage based on my carb in take. I’m trying to understand this because from what I read on the internet calculating my insulin in take purely based on the carb amount I take is not correct and there are other things to include. Like fiber, protein etc.\n\nI’m 28 y old and I have diabetes for 26 years. Previously I didn’t need to count carbs because my life was very stabile. But now I‘m more active, like going to gym, eating outside with friends, work etc. So my eating habits and my life style changed a lot. So I‘m now more curious because for example this morning around 10-11 AM my glucose levels were around 120+ and I ate 2 slices of bread which each slice contains 26g carbs, a mix of eggs, tomato, onion and paprika food, some cheese, olive and butter. I took 4 units before and 2 units an hour later. Logically it should have been enough but after 3 hours my glucose levels were around 300 and I took 2 more units and it still going up.\n\nSo in general I am very confused and I want to understand better how should I calculate detailly my insulin need and what to consider or if there are any apps that would help me calculate insulin need better I would like to learn them. Like for example an app considers everything like protein, fiber and tells me this is how much I need or if someone here could tell me or provide me a source it would be great.\n\nThanks.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Waltzing the dragon has a formula for calculating fat and protein and the juicebox podcast has an episode on it. There is also an app called insulin calculator black square with blue circle that calculates for f&p. I havent compared it to doing the formula myself though. Experiment with your carb ratios as well.<br><br>\n  <b>Comment 2:</b> The entire 11 years I’ve had type one Ive had an endocrinologist/diabetes specialist work out my ratios. I know there are ways of working it out yourself but my personal opinion is to trust a professional. Then again, I am in the UK and get my healthcare free and I know that’s not the same for everyone. Just make sure that, if you have to work it out yourself, you do it safely and start small so you don’t give yourself too much insulin. Take care of yourself!<br><br>\n  <b>Comment 3:</b> I know this is not what you asked (sorry!), but how long do you take your insulin before you eat? I use novarapid and find taking it about 10 - 15 mins before most meals helps stop the spike in the first place. I think the time varies from person to person though and also the exact meal (like I know high fat slows down my digestion a lot).\n\nHaving said that, I know newer insulins such as fiasp start working more quickly and so you don't have to take them so far in advanced.<br><br>\n  <b>Comment 4:</b> learn about the glycemic index. sometimes you have to split up the dose throughout the duration of the meal absorption. the amount of insulin you need for basal, carb ratios, isf, etc will change throughout your life. we will always have to make adjustments.<br><br>\n  <b>Comment 5:</b> Make sure to dose 15 min before eating. Don’t forget onions have significant carbs. Looks like you used 1:15 ish ratio initially- 60carb/4. Try giving all 6 units up front as 1:10. You need more insulin up front to stop the rise. It might take more than that even. Keep in mind carb ratios can be different at different time of day.<br><br>\n"}
{"id": "opmt8o", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can insulin be injected in the upper back area- below the shoulders (that fatty area near the armpits)?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Yes.<br><br>\n  <b>Comment 2:</b> As long as it is going into subcutaneous fat it’s fine. You don’t want to inject into muscle or under the skin (above the fat layer) because the absorption rate can be much faster or slower than you usually have.<br><br>\n  <b>Comment 3:</b> Can you reach it. Serious question.<br><br>\n  <b>Comment 4:</b> Yes that’s where I give 100% of my short acting shots with a syringe. I’ve been doing it for many years since my stomach has too much scar tissue. I would recommend pinching to make sure it’s going into your fat.<br><br>\n  <b>Comment 5:</b> If it's a fatty area where you can pinch up a little, then you can inject there. You want to stay away from really bony areas but pretty much anywhere will work.<br><br>\n"}
{"id": "10esfwf", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Dealing with stomach flu\nHow do you manage a bout of stomach flu? Has it ever led to DKA?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Yes, with both kids.  Anytime either is sick they become insulin resistant.  It seems bolusing has minimal effect.  Occasionally we recognize the insulin resistance before we see the underlying illness.  Ultimately it means testing and correcting more often.  Cutting carbs a little bit.  Supplementing with sugar-free electrolytes.  When the kids have had to go to the ER they get roughly the same treatment.  Fluids, insulin, and electrolytes.<br><br>\n  <b>Comment 2:</b> Yeah I’ve had the stomach flu multiple times, I’ve never gone into full blown dka but last time I had it I chose to go to the er primarily because I was super dizzy and fainted so I was nervous. Watch your ketones and do your best to find something you can keep down. For me I tend to sip Gatorade throughout the day. Lots of water. Chicken noodle soup if you can stomach it is your friend. If you can’t keep anything down and are just super dehydrated, going to the er is the best bet. It’s unfortunately easy to go from not in dka to dka with a stomach bug and the er can at least give you fluids and they gave me an anti nausea med too so I stopped and was able to get food down again.<br><br>\n"}
{"id": "jja79f", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Are there any distance runners here?\nHOW DO YOU DO IT?? In high school before I got diagnosed, I ran on the schools cross country team and before I started to get all the diabetes symptoms, I felt really good health wise. After my diagnosis, I had to quit running because my parents weren't confident I could manage the frequent lows and they didn't trust the school to help manage them either. It's been 4 years and I've gained a pretty significant amount of weight, (50lbs) and I'm trying to get back into running again like I used to. I've tried getting back into it before and it's not so much that it's physically difficult to run, it's just my blood sugar always seems to kick my ass regardless of how little I dose or even if I don't dose at all. The past 2 weeks I've started pretty small and I've been running just a mile every other day. When I wake up in the morning my blood sugar is normally anywhere from 200-230 before I correct. But when I'm about to go run, I don't correct it and ot still drops like crazy. Before my run today i was at 225, and when i finished I was at 87 and dropping. Right now it's not a huge problem because I'm close to home and there's people at home on standby if i need help, but I don't want to have to run with my brother driving alongside me forever, it's kind of embarrassing lol. Once I feel like I can do a mile well enough, I want to slowly start upping my distance by like a half mile every week. Is that something doable?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> As soon as I got diagnosed (like 4-5 weeks ago), I started running about 1.5-2 miles maybe 3x a week. If you have a cgm, just make sure you're checking every once in a while while you run. I stay strapped with a fanny pack, and I keep some gummies and emergency glucagon inside. You could even keep an apple juice in there if you wanted to be extra cautious. Maybe I'm just optimistic bc I'm a newbie but anything is possible if you take the right precautions.<br><br>\n  <b>Comment 2:</b> You will figure out what works for you, but as an Iron Man triathlete, I find 15 g of carbohydrates every 45 minutes of effort and a fairly low basal rate on the pump is the way to go. I like Honey stinger products like the waffles since they generally have half rapid absorption carbohydrates and some slower carbs.  You need to jog or cycle with water and have an empty pocket for the trash. You can also use gel or goo though they can be sticky. One of my favorites is gel blocks since they don’t make a mess and you do not have to chase them with water. I do not recommend suspending or disconnecting from the pump as you will have pretty severe muscle cell starvation and cramping. Keep the basal rate going and figure out what your carb intake volume and frequency should be given how strenuous your effort.  Unless you were doing a high intensity workout, try my formula. A continuous glucose monitoring system and insulin pump will make this possible.<br><br>\n  <b>Comment 3:</b> Inexperienced distance runner here - been just over a year - but the trick for me is just to always have food on me unless I’m doing loops around the house. 4 mile trail run? Yep bringing a vest with expected snacks and extras. 20 mile adventure day? Same thing just more food and plenty of extra I’m not expecting to touch. My main jam is fruit snacks, fruit bars, and then clif bars for longer days. Slow drip of calories works for me so far.<br><br>\n"}
{"id": "lnw57g", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to deal with medical supply waste?\nHey y'all, this is my first time posting on reddit, so bear with me\n\nI'm a high school senior who has been diagnosed with type 1 for almost 6 years now. Even when I was first diagnosed, the sheer amount of plastic waste that comes with it was appalling, but as new technologies and treatments develop, it seems like there is even more waste than before in the packaging alone. One of the classes I am taking right now is Environmental Science, and I feel like crap whenever we discuss plastic use, even though my teacher makes it a point to let us know the main problem is big companies and not as much personal use as we think. He has be encouraging my class and I to reduce our use of plastic, but there is no way to really reduce how often I have to use plastic to Not Die™ (that I can think of at least).\n\nMy family doesn't recycle, which... ouch. I try and save my recyclables and bring them to school as I help run the recycling program at my school, but I don't feel comfortable throwing in things associated with medical supply waste in with things like water bottles. Obviously syringes and other bio-waste things stay in a BD Sharps container, but the packaging for my pump and cgm supplies is overwhelming and I don't know exactly what to do with them so that they don't negatively impact the environment as much, especially since I have to use a lot of single-use plastic almost every 3 days and it starts to add up fast.\n\nDoes anyone have any suggestions on reducing the use of or recycling the plastic that all of my diabetes supplies come in?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Here is what I have to say... I am t1d 42 yes and pumper.  I completely and totally understand your disgust and admire your passion.  I wish that we could reduce the waste but short of reusing lancets there isn’t much we are able to do, especially since many of our disposables aren’t even recyclable!  But here’s the two main things 1.  This is life saving and necessary.  So please don’t feel guilty, you are doing what you can! 2.  The systemic changes that need to occur have so much less to do with what a few million of us do to stay alive and so much more to do with industry at large.  So here’s my suggestion, continue what you are doing.  In college maybe look into engineering (medical) or environmental sciences and impact the world that way.<br><br>\n  <b>Comment 2:</b> Its completely grim how much waste there is with so many of our products. The huge cardboard boxes with supplies in more cardboard boxes. The hundreds of thousands of test strips we use or the plastic cannula cover thingies, or insertion devices for cgms.\n\nHonestly I just recycle the cardboard, everything else e.g my old cannula/reservoir etc can only go in the bin, similarly my needles will go to clinical waste.\n\nI think many companies, not just diabetic supply providers can do millions of times better, issue is theres no incentive. Its not like retail where you choose to buy sustainable clothes and vote with your money.. since asfaik no supplier in the diabetic realm is sustainable, nor cares to be. Its all about the ££.\n\noh: edit to say my family used to be the same about recycling so I feel your pain. Luckily our council issued recycling bins to every household so now I can do it at home. Idk if you have neighbours that have recycling bins which you could ask to use?<br><br>\n"}
{"id": "1c538qs", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Ozempic \nHow are you guys getting your insurance to cover Ozempic?? I talked with my endo about it and she said they won’t cover it because I’m not type 2. I have anthem insurance. She prescribed me wegovy for weightloss but that’s also not covered. Any tips?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> My BCBS though the state employee plan covered it no problem. \n\nNow I’m on BCBS through the exchange and they won’t. They also won’t cover dexcoms only the Freestyles which I find annoying. \n\nI just buy glp1 from the same sites steroids users buy there stuff and it’s working great.<br><br>\n  <b>Comment 2:</b> My doctor got it covered by using a more generic diabetes code, not specifically stating I had T1. Others have had success by being coded as having both types of diabetes - Gary Scheiner (think like a pancreas) even suggests going this route if you have trouble getting insurance to cover it. If you have enough insulin resistance to justify a glp-1, even if its primary use I’d for weight loss, this is the way to go. \n\nAs coverage of many things (devices) has expanded to include anyone who uses insulin, the “risks” of doing this and being mis-coded according to your insurance are negligible IMO.<br><br>\n"}
{"id": "18fae91", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can my new lifestyle change have risks?\nI’ve been a type one diabetic for 7 years, i never took care of myself, ate whatever i wanted, etc. \nMy fasting glucose was 350 and my A1c was a 12.0 about half a year ago. I would always let myself have things while getting crazy amounts of insulin (20-35 units) \nIn june, i got a dexcom g7 cgm and seeing the numbers so high scared me over time, (fyi i only got checked about once a day before my cgm, and sometimes even less) making me want to take control. my endo has been doing his best to help me get my life right and three months ago my A1c dropped two points making it a 10.0. This made me even more desperate for change, so I made the choice to cut down on carbs and monitor my blood sugar more efficiently. I have done a good job keeping my blood sugar under 200 and stay in my usual 90-180 range. And it’s mostly because now i’m scared of my sugar going high. \nI’ve cut back tremendously on insulin now only getting about 3-8 units per meals and corrections (again, i used to get 20-35) i’ve done this all because of my dexcom, it helped me wanna change and i’m incredibly grateful for it. Now my question is, can this change in insulin and change in my blood sugar readings have risks? it was a very sudden change, i just decided to do it. i’ve talked to my endo about this, showing him my dexcom 30 day glucose is  at 180 and a GMI estimate of 7.7, and now i look forward to my doctors appointment next month hoping for good news about my A1c. I hope i didn’t over share, i just would love to know if i’m at a possible risk of anything because of the sudden change. thank you!</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I will say that it can make you feel really shitty until your body gets used to being that low. Whenever I let things slide, 80’s and 90’s feel like I’m going to die. And then once I get used to those, 250 and up feels like I’m living in molasses, everything foggy. \n\nBut as far as risks for the abrupt changes, I haven’t heard of any.<br><br>\n  <b>Comment 2:</b> Rapid change in blood glucose can be tough on blood vessels in your eyes, but from reading your post this has been over 6 months rather than a couple of weeks and long term you are definitely doing the right thing for your health<br><br>\n  <b>Comment 3:</b> Like someone said, if you’ve been high BG for a while, it may feel weird to be in normal range. But, your body adapts.\nTalk with endo about glucose to insulin range and build a plan for short term and long term insulin doses. I would advise against cutting back unless you talk with the endo and/or your overall carb count has dropped a lot. \nOr better yet, see if a connected pump might be ideal. Based on your intake (you do count) as well as readings, the pump will dose appropriately. \nAnother thing to add is drinking water. Our little capillaries in kidneys, eyes and feet/toes don’t like a lot of sugar. I treat it like molasses passing through a stir straw. I also look at water as diluting and it will help take the pressure off of those systems.<br><br>\n  <b>Comment 4:</b> Congratulations. It doesn’t seem to sudden to me.<br><br>\n"}
{"id": "a1xuf5", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How should I prepare for jiu jitsu?\nJiu jitsu is a mix of long strenuous exercise and fast movements, I'm not quite sure what I'm doing wrong but I'm always high after a jiu jitsu session and not sure if im preparing correctly. The session is early in the morning so I have breakfast as normal and inject the correct amount, then I get ready, have another exchange of carbohydrates then start. Afterwards I check my glucose and it's too high, I don't know what im doing wrong</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> So after consuming carbohydrates your blood glucose increases then (in an optimal case) insulin eventually returns it to a normal level. If you start to exercise with a high BG level, however, instead of lowering, your level will go even higher. So this is just an assumption and I could very well be wrong about that, but could it be the case that you always start jiu jitsu during the period in which your BG level is increasing due to the carbohydrates you consumed and exercise further raises it?\n\nAlso, this might easily be a result of the dawn phenomenon, but if it only happens on those mornings you have jitsu then I doubt that hypo is the culprit.<br><br>\n  <b>Comment 2:</b> It could be theDawn Phenomenon? Our bodies are always changing. Here is the link if you wanna read up on it http://www.diabetes.org/living-with-diabetes/treatment-and-care/blood-glucose-control/dawn-phenomenon.html\n\nIt also could be you ate a fatty meal the night before which is causing a slow rise in blood sugar through the night and into the morning. \n\nAnother reason could be just the sport itself. I'm sure you get your heart pumping pretty good in there. Not in an exercise way, rather more in a \"OH sh*t\" way, or a \"I'm gonna get this guy\".  when you are calculating your plan of attack and your opponent does something that catches you off guard and your heart starts racing. Kinda that adrenaline feeling. I'm sure you know what I'm talking about. When your body does that. It releases hormones for your fight or flight response which as a form of stress. And I know every diabetic knows what stress does to their blood sugar. This is a guess I'm not sure the type of athlete you are but it's a possibility. Maybe taking a low extra does of insulin before practice could help out with that. \n\nI just know from experience when I used to wrestle, I kinda would have a similar problem. So the \"stress\" thing kinda made since because I'm quite meticulous with my diabetes. Anyways just a thought. I hope it helps! <br><br>\n  <b>Comment 3:</b> Shows how diabetes affects everyone differently. When I do jiu jitsu, my blood sugar plummets, especially during a strenuous bout. I try to go to the gym with minimal insulin on board, but I definitely get sporadic results. I’ve also struggled with having me sensors get ripped off, so bjj has become one of those activities that I’ve really struggled with since I was diagnosed.<br><br>\n"}
{"id": "j6aj67", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Blood Test Results.\nCan someone please clarify as to how one can really knows if they have insulin resistance or LADA? For example my recent blood work was Fasting 112, A1C (5.3). A lot of things can affect fasting like lack of sleep, high stress, taking Klonopin before blood test.. I have changed to low carb diet and now fasting numbers per glucometer are within normal range from diet. I want to get more tests to see if I am truly prediabetic or not if that is possible.. Lastly, what are you thoughts on insulin test, and autoantibody tests for determination. I am 34, 145 lbs..</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> A 5.3 A1C isn’t even prediabetes.<br><br>\n  <b>Comment 2:</b> These were the tests I was referred to, to \"confirm\" LADA\n\nGAD65 Antibody \nAutoimmune Diabetes Panel\nC-Peptide<br><br>\n  <b>Comment 3:</b> I did the oral glucose tolerance test,  with insulin levels measured at fasting, 1hour and 2hours after ingesting the glucose drink. Fasting levels of insulin were high normal, but got high at 1hour and even higher at 2hours. More insulin produced as glucose wasn't reduced as quickly as it should be due to insulin resistance.  A1C, fasting and other glucose levels were normal or slightly high. This indicated IR rather than any other issue. \n\nThere's a table somewhere on the internet showing what the different combinations of high/normal a1c, fasting, glucose levels indicate. Tbh I don't think you'd be able to definately prove IR without measuring the insulin levels.<br><br>\n"}
{"id": "n41ic3", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How much do I got to be concerned about going to 280\nSo I’m a big dumby and didn’t bring my insulin when I went grocery shopping today because I thought it was going to be ok. I ate a Ezekiel English muffin (30 carbs) with 2 tablespoons of peanut butter. Took 6 units for my 1/10 ratio for my fast acting and that accounting for 1 shot of correction and  1 shot for my coffee with half and half. I go grocery shopping and i just shoot up to 280. Now I see on here people go higher than that but how much do I have to be concerned about that high number? I finished up real quick and rushed home to give me some more insulin and drink a lot of water to help bring it down. It’s been going down real slow and it’s finally under 200 pointed down a little more than an hour after I took my humulog. Now I know to bring my insulin everywhere I go for that reason. But for the future do I need to really concerned about it going to 280? I ask because I don’t want to go into DKA again. For more info I am a newer type 1 diagnosed at age 30 in august 2020. Maybe I should stop drinking coffee  because for some reason caffeine in tea seems to react better than coffee caffeine</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Well, that's not a number that you want to be at, definitely not often. It happens to the best of us though, so don't be too hard on yourself. And yes, carry your insulin with you next time. \n\nDo you prebolus (administer bolus at least 15 minutes before eating)? That may help a lot. And yeah, it seems that coffee can spike blood sugar, even if it's black (no sugar/cream/milk).<br><br>\n  <b>Comment 2:</b> You have absolutely nothing to worry about. It taught you a great lesson, too - always have insulin on you. \n\nI also wouldn't stop drinking coffee (assuming its something you enjoy), you could for a little while but I promise you'll figure out how it works in your body. It might take a while, especially because you've been diagnosed so recently, but through experience and trial and error, you'll figure out how to correct for all types of food.<br><br>\n  <b>Comment 3:</b> I think a short spike that you quickly correct is nothing to be too worried about.  From what I understand serious diabetic damage comes from prolonged periods of high BG.<br><br>\n"}
{"id": "13oc12w", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to feel better when bg is high\nHey all. \n\nSO of a t1 (about a year since diagnosis).\n\nMy SO's bg is fairly stable but sometimes it goes high/difficult to get stable. Sometimes this make them feel really sickly and grumby.. I know that, of course, getting the bg down is the primary goal, but I am unsure how to help them feel better while it's coming down.\n\nAny tips on how to help with the symptoms and help them feel better when they have a bad blood sugar day?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> are they willing to share those blood glucose numbers with you via their app? It may not be as much a matter of making them feel better as a matter of making you feel better, because when we are experiencing highs and lows, our emotional reactions often make zero sense. So if you have access and understanding that there is a higher low going on, you can try )though it’s not easy) and understand that their behavior whether it’s acting short, tempered or “drunk” (lows) or whatever is a product of biology and not a choice.<br><br>\n  <b>Comment 2:</b> Calm walks have a tendency to help with high blood sugars, though need to be careful to not drop low (which exercise sometimes causes). Maybe if SO knows a walk could help the sugar come down, they’d be more open to it?\n\nAlso, chugging water. Have a water chugging contest 🤷🏼‍♀️😹 I’d do it with my friends in college\n\nWorth reading or listening to “Think Like a Pancreas” by Gary Scheiner<br><br>\n  <b>Comment 3:</b> Honestly, I usually just need to be left alone.<br><br>\n  <b>Comment 4:</b> Lots of water. It’s absolutely vital. If your sugars are high, your body draws all the water it can to flush excess glucose out where possible. You need to keep really topped up with water as dehydration can affect mood too. \nAlso meditation and mindfulness, if you really actually try a good few times and practice/stick at it, you’ll find it helps you develop control and management over unwanted thoughts and emotions. \nYour emotions are a tool, but many people have not yet learned how to confine the use to their advantage and instead their lives are ruled by emotion.<br><br>\n"}
{"id": "t8inc5", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How do I get replacement infusion sets from Tandum?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Phones are easiest. There isn’t long waits and theres only like two girls you talk to, so it feels nice talking to the same people every time, rather than some one in a call center in India<br><br>\n  <b>Comment 2:</b> I just called recently in the past two weeks about our infusion sets messing up, (4 of them not stickin and one that the cannula was bent) they sent us a box of 10 as a replacement.<br><br>\n"}
{"id": "179is7y", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to inject for low carb while using Control IQ?\nI'm on a tandem insulin pump, which has Control IQ to help control blood sugars. It doesn't allow you to do an extended bolus past two hours, though. I'm unsure of how to manage low carb eating which has a delayed rise in blood sugar due to fat and protein.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> not sure if this definitely will work, but if your are slowly climbing, control iq should kick in and try to keep you in range. \n\nalso, it’s possible that the slow rise in blood sugar is your liver releasing glucose to make up for the lack of carbs. not advocating for any type of diet one way or the other, but i’ve found that can happen sometimes too.<br><br>\n  <b>Comment 2:</b> I use sleep mode 100% of the time.  If I am eating low carb, the basal rate changes that sleep mode makes handle low carb meals  and the delayed rise from protein without bolus.  I will still see a rise, but it is low and slow.  Not a spike and crash.\n\nIf you prefer, Control IQ does allow you to do an extended bolus.  If you want a temp basal rate, you can turn control iq off and then start a temp basal. You have to remember to turn it back on when the temp rate period is done.<br><br>\n  <b>Comment 3:</b> Sleep mode 100% of the time<br><br>\n"}
{"id": "u4qyku", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How long should I wait between Tresiba injection and Humalog injection?\nI tend to run high at night after I do my Tresiba. I want to do a correction with Humalog but I’m not sure if I have to wait or not. Should I be waiting?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Nope. I typically always do a Humalog shot after I take tresiba because my sugar goes up for whatever reason after tresiba. I think I psych myself out when it comes to tresiba if I’m being honest<br><br>\n  <b>Comment 2:</b> No,  you can administer immediately after (or before), just make sure to use a different site.<br><br>\n  <b>Comment 3:</b> Wait why is tresiba making you high?<br><br>\n  <b>Comment 4:</b> Nope. Shouldn't be an issue. I take mine at the same time often.<br><br>\n"}
{"id": "sm7zc3", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can car seat heaters damage insulin in pumps? How likely is this? Paranoid?\nCurious if this is a real known risk was observing just how hot seat heaters in my car can get lately, and using omnipod up on my ass might be seeing some substantial heat even thru clothes?  \n\nIs there any realistic way to know if it's getting too hot?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I can't imagine any way you could know except for contacting the manufacturer of the insulin.<br><br>\n  <b>Comment 2:</b> If you were sitting Thor for over an hours then yes.<br><br>\n  <b>Comment 3:</b> Heh, butt pumper.\n\nSeriously though more than likely over three days even if you stayed in the seat there wouldn't be any noticeable degredation.  People are running around the desert in sweltering heat with pens and vials in their pockets and have no noticeable degredation.<br><br>\n"}
{"id": "zefhjk", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How is your feeling of the Diabetic Summer Camp(s) you went too? Positive, Negative, horrible and/or wonderful Would you send your child to summer camp? I wanna hear all of your experiences. Even if your diabetic summer camp experience is terrible. I wanna hear it all.\nI'm a M30 YO, T1D since 6 months old and I went to Camp Sweeney (2002-2011)  and Texas Lions Camp (2005) I have no opinion of Texas Lions Camp and I have a love/hate relationship with Camp Sweeney.  \n\nFirst of all, let me say this, I love the experience my diabetic summer camp gave me. Both positive and negative. However, i have a lot of  anger against my summer camp but i've never been able to explain why i'm upset at my diabetic summer camp with people who would understand. So... here we are. \n\nI have a love/hate relationship with Camp Sweeney and it is what it is. On the one hand. I love Camp Sweeney, i appreciate the camp for what it is. it's a place where all T1Ds could meet and congregate with fellow T1D. i'm happy for that. On the other hand, most to all of my fellow camp friends have \"unfriended\" me and I don't have any close relationships i was promised the camp would provide for life. \"Where Friendship Begins and Never End\" - Where's my love? It's mostly my fault tho. However, i wanna know, who else has had their diabetic camp summer memories tarnish? Or was your diabetic summer camp amazing and wonderful as it should of been.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I would have loved to go to a diabetes camp when I was younger. But my siblings all went to camp and I would stay home all summer<br><br>\n  <b>Comment 2:</b> Wtf there are camps for diabetics in the US? That’s so weird to me.<br><br>\n  <b>Comment 3:</b> I went to a camp, or rather was sent by my parents to one, when I was like 9-10 or so. I didn't enjoy it at all, as we were never allowed to go out and do any of the fun \"camp activities\" you'd think of, like exploring the woods, building campfires, or learning skills created stuff with wood. It very much felt like it was a glorified summer babysitting service for parents of diabetics, as we just stayed inside, did activities inside, and didn't do all that much that we couldn't have done inside the city.\n\nBut also, around that point I was finally starting to feel confident enough to try putting in my pump infusion sites myself. I figured since I was away from my parents who normally inserted it, this would be an ideal time to do it myself. However instead, the local nurse/medic/health aide made it absolutely 100% clear that I was *not allowed* to insert it myself for any reason, and if I needed a change, I *must* go and have her do it for me.\n\nSure maybe it had valid reasons, like they didn't want to risk any parent suing the camp because their kid hurt themselves trying to put a site in. But for my 11 year old self, the absoluteness of the NO shattered my confidence in myself, and it took me until I was 12 or so before I even considered trying to insert a site myself again.<br><br>\n  <b>Comment 4:</b> I firmly believe Camp Sweeney saved my life. I went from age 8 to 18, even the winter sessions. I don’t have any relationships that lasted from it but that’s okay, it was this magical bubble where everybody Got It and I could figure out how to be a fully realized person without the diagnosis complicating things. Plus my control was always way better during and after, and I got some muscle definition!\nThat and the horses. Man, loved the horses.<br><br>\n  <b>Comment 5:</b> We are parents of a T1D 11 year old Chicago with siblings. Does anyone know of a camp that is inclusive to all?\nThe only diabetes camp I have heard of is Sweeney. 2nd question: are there others (maybe in the southeast or northeast) that this community can recommend? Thanks!<br><br>\n  <b>Comment 6:</b> I’m so excited to send my kid to D-camp for the first time this summer. He’ll be 9. I’ve heard nothing but good things and all of the counselors are T1D themselves, many former campers. We’ve been to a sports event they hosted and it was a lot of fun. I’m really excited for him to be around people who “get it” since he’s the only T1D kid in our family/friends. \n\nBut it’s so expensive. I get it. Several nurses on staff and all that. But still, yikes.<br><br>\n"}
