{"id": "o86mnj", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How do I change the time of the day when I take Lantus?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> First time trying to crosspost.. Adding the text here as it didn't show up. 😊\n___________________\n\nHello! \nRecently I've noticed that my bg almost always drop during the night. I take my Lantus at 11 at night, go to sleep at midnight. Then, around 5 or 6 in the morning, I get a low notification and have to go up and have half a glass of juice and half a sandwich. That usually keeps me ok (rise to about 6mmol) until it's time to go up at 9. Sometimes I drop once more and have to eat again at 8. \n\nEven if I go to sleep at 7-8-9-10 mmol I'll still drop. I HATE waking up to alarms during the night!\n\nI figured my Lantus kicks in too hard and too soon when I take it, so I'd like to take my Lantus in the morning instead. But how do I change that? Split the dose one night, then it's fine to go the next day? Any tips from someone that has changed the timing? ❤️\n\n(Yes, I can call my team, but I'd rather try fixing this by myself. As long as I feel good I can do what I want.)\n\n\nDiabetes t1 since 2008, f31, mdi, libre2. Latest hba1c 42 (ca 5,8%)<br><br>\n  <b>Comment 2:</b> Well, I faced a similar issue. My bg levels dropped during night, while by evening it started to spike. So I figured that it didn't stay in my body for long. What I did was make it half and half across 12 hours period. Gradually, then I adjusted the dosages (earlier I was taking 10 units at night) and started taking 3u at morning and 5u at night.<br><br>\n"}
{"id": "15llts3", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can you switch between two different phones everyday for a libre 3 sensor?\nIf you had two iPhones - a work phone and a personal phone, and you strictly had the one for office hours, and your personal cell was never in the office with you, could you have the work phone connect to your Libre 3 sensor during your 8-5pm hours, and then connect your personal cell to the sensor once you leave the office?\n\nMy work phone will not leave my office and my personal phone is not going to come into the office either, so please just let me know if the first paragraph is possible?\n\nThank you!</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I have no experience with Libre, so idk, but if your libre is connected to a personal phone, and if in the US, you have a legal right to have your phone on you at work, and your employer can’t deny you that because your phone is a medical device and is protected under ADA. Now, if you just don’t want your phone on you for some reason, that’s your choice.<br><br>\n  <b>Comment 2:</b> So the Libre 3 sensor feeds data to your phone continuously, so it doesn’t let you pair multiple devices to it (afaik anyway). The Libre 2 does however let you scan with multiple devices/phones. \n\nYou don’t need to use both phones though - if you’re in the states your phone counts as a medical device, your work has to let you use it.<br><br>\n  <b>Comment 3:</b> I do not believe so, and unfortunately they do not allow the Libre 3 to connect with the reader device and the app at the same time.  \n\n\n* https://www.support.freestyle.abbott/hc/en-us/articles/17309393719569-Can-I-interchange-using-the-FreeStyle-Libre-3-reader-and-app-while-wearing-a-FreeStyle-Libre-3-sensor- \n\nThe only workaround I can suggest is having a cheap simple third phone that you carry everywhere and use the LibreLinkUp app on your personal and work phones. That is really cumbersome and probably not what you want.<br><br>\n"}
{"id": "yzakxp", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can I get an understanding from someone who knows more than me? More info in comments</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> So this is my first day with the dexicom. I’ve had a few drinks tonight some of which were cocktails so high sugar content. Prior to dexicom, I’ve always checked BS before drinking and then I would check before bed, then often in the morning I would be low. I can now see that this trend is very likely to continue at the time of me typing this. \n\nI’ve had no extra insulin, yet for some reason my blood sugar is dropping? Prior to dexicom I only had my snapshot window blood sugar tests, it would show prior to drinking Normal bs, then when I get home, normal bs, and then in the morning I always run low? I take my long term Optisilin (used to be called Lantus) at 7:00 in the morning and this is maybe the only thing I could think that could be causing this? However, during the week where I’ve had no alcohol I don’t run high or run low?? What am I missing???<br><br>\n  <b>Comment 2:</b> I typically stay away from sugary drinks….most often light beer.  For probably 15-20 years I was blind to these phenomena as well but I knew be careful when trying to cover alcohol.  \nNow with cgm and tandem I will try to cover alcohol at least early in night…and as the liver begins to shut down sugar I am not covering the drinks.  When I drink excessive amounts I find I get the munchies before passing out.  There have been times where food was eaten and I have no logs showing was covered and blood sugar didn’t rise….good to have a small snack before bed. I’ve used energy bars for this since they take a while to breakdown into sugar<br><br>\n  <b>Comment 3:</b> Alcohol makes me drop overnight!<br><br>\n  <b>Comment 4:</b> Yeah your lantus is peaking.<br><br>\n  <b>Comment 5:</b> I'm skeptical this isn't separate things. Cocktails are not very sugary in most instances, like have you guys made a cocktail ever? Idk what y'all are talking about, that's a major spike. If your idea of a cocktail is whisky and coca cola, then ok lol, you should prob stop that. This really isn't enough data, I think you are not bolusing correctly on your dinner and the alcohol maybe dropped you a bit along with insulin still in your system doing it's thing. But alcohol doesn't usually drop folks 6 hours later, that's not really how it works.   \n\n\n\"I've had no extra insulin\" is a nonsensical statement tho that communicates nothing to help understand what's going on here. But as is, you aren't going low here. There are way too many variables, you aren't nearly specific enough, and you are just getting a feel for it. It takes time, you will develop a much deeper understanding of your body, food, insulin, and diabetes. keep it up!<br><br>\n"}
{"id": "1ccjjgl", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Candy for low blood sugar spells?\nThe doctors are still trying to find out what’s wrong with me but I go through times where i get super dizzy and my blood sugar drops. I’ve been keeping different candy’s on hand but I read that if you eat too much sugar that’s also bad. So i was wondering if anyone could share certain candy y’all eat for the spells and how many pieces? (Ex: 6 Swedish fish, 3 starburst, etc.)\n\n17F\n5’0\n77 lbs</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> 3 mini tootsie rolls (15 carbs) does it for me<br><br>\n  <b>Comment 2:</b> I eat 1 Fruit-to-Go bar. No counting while my brain is not at full capacity.<br><br>\n  <b>Comment 3:</b> Skittles are about 1g per and easy to count.  I stick to 15g if actually reading low and wait 15m before eating anything else, unless I know I missed.<br><br>\n  <b>Comment 4:</b> You really can’t figure this out yourself? Whatever candy you have just read the nutritional info and have the usual amount of carbs you have to treat lows..<br><br>\n  <b>Comment 5:</b> I usually use two SweetTarts or one HiChew. 2-4 grams of carbs is usually enough.<br><br>\n  <b>Comment 6:</b> Get a decent scale, and test in a flat daily moment. \n\nFor me each gram of sugar raises my BG x5 the weight, so 2 5g candies ( 10g total ) raise my BG roughly by 50mg/dL within 30 minutes. \n\nFor me, whenever I'm 85 trending down, that means it's time for a candy to keep it in range. \n\nIf you can find dextrose / fructose candies, that's always better than sucrose.<br><br>\n"}
{"id": "12ibpjs", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How do you deal with this?\nAs I get older, within years I am in shock with how people  will go at extreme lengths to hurt someone. I mind my business (I think that’s what triggers them) look…. It’s bad enough I gotta wake up every day choosing to be a healthy person who has to deal with diabetes daily. Im tired of toxic people in general. Especially at work. How do you guys as diabetics deal with toxic people ?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I avoid them is the simple answer.\n\nThe first time anyone referenced my diabetes at work, I came down on them very hard, which killed that idea off. But I come down hard on toxic people generally.<br><br>\n  <b>Comment 2:</b> Depends on who it is and what they're saying. Is it a supervisor at work, just a coworker in the same position? \n\nI'm one of the youngest at work and the only T1 so other coworkers, including the type 2's have a lot of 'advice'. Being polite but firm and saying 'Well I'll think about it' usually works as deflection if I don't want to deal with it.<br><br>\n  <b>Comment 3:</b> I say the golden line; Look, I'm a diabetic, and I deal with enough pricks as it is. F off 🤣<br><br>\n"}
{"id": "qbsb6o", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to deal with moodiness from highs and lows\nI (21F) asked this girl I know who’s diabetic and she told me she just decided one day she wasn’t going to be moody anymore but I just can’t turn of these emotions. Any advice?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Not sure if I’m fully understanding your situation from this post vs the title - but I do think that you should consider therapy. I’m saying this as someone who has consistently put it off for 10 years, half tried and bailed, and finally made a consultation for next week. My moodiness doesn’t necessarily always correlate directly with high or low sugars, but I know that the stress of t1 in general contributes to my general anxiety and anger including when my blood sugar is out of whack.<br><br>\n  <b>Comment 2:</b> Whenever I’m high or low I am pretty stupid so I don’t worry too much about moodiness. But unrelated to highs and lows whenever I am moody I just separate from people for a bit so I can kinda recalibrate everything.<br><br>\n  <b>Comment 3:</b> Totally confused. \nAre you a couple?\nAre you concerned about her or you?\nAre u diabetic & moody?<br><br>\n  <b>Comment 4:</b> If we could all turn off our emotions when they step out of line we would…therapy, emotional intelligence education, and practice.\n\nIt’s not something that is over night. Don’t stop working at it, but still find joy in where you are now<br><br>\n  <b>Comment 5:</b> Don't try to ignore them, use them as a measure!\nTrack them against BG reading, you may gain some insight.\n\nIf they are tied to highs & lows then you need advice on getting better control.\n\nIf not, Try to find a therapist to give you some insight!<br><br>\n"}
{"id": "q92zcg", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>cannula problems w/ new medtronic infusion sets\nI just started using the new infusion sets for my medtronic 770g pump. I never had any issues with the old infusion sets for the 2 years I had it, but within the last month or so of using the new sets ive had 2 instances where my cannula became bent and my bg was horrendously high.\n\nanyone else experience this?? \nTips to avoid??</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Haven’t had problems with a vent cannula, but recently my pump has had a seriously hard time sticking to my skin and staying in place. Since I replaced it the other night it’s been ripped out 5 times.<br><br>\n  <b>Comment 2:</b> Just started the 770g pump with the mio advance last month.  Only issue I've gotten was infusion blockage. But I can clear it and seems fine after<br><br>\n  <b>Comment 3:</b> Which infusion sets are you using? Some are much better than other in my opinion<br><br>\n  <b>Comment 4:</b> The infusion sets irritate me, always blocked or causing disruption to the insulin flow.<br><br>\n"}
{"id": "10kzzu7", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can Tzield be used on a 6 year old ?\nMy dad's side of the family has a history of T1D. I am aware that Tzield has been approved very recently by the FDA but having looked more into it, the articles seem to claim that it can only be used in children 8 years or older \\[[https://www.fda.gov/news-events/press-announcements/fda-approves-first-drug-can-delay-onset-type-1-diabetes](https://www.fda.gov/news-events/press-announcements/fda-approves-first-drug-can-delay-onset-type-1-diabetes)\\]. \n\n&#x200B;\n\nMy cousin was considering screening her children (if there are even any programmes available) but they are not 8 yet. If they progress to stage 2 before they can start Tzield, does that mean they won't be able to receive the treatment ? What are their alternatives ?\n\n&#x200B;\n\nThanks.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I would contact the patient connect number they provide and talk to them.<br><br>\n  <b>Comment 2:</b> There are trials happening, and doctors can also prescribe off-label. It’s worth at least getting their antibodies tested.<br><br>\n"}
{"id": "10mcjl3", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How does grief affect your blood sugar?\nHi everyone,\nI was just curious to hear how grief has affected your own blood sugar? I'm about to say goodbye on Saturday to my furry Best friend Chelsea. I've had 15 amazing years with her. And now it's sadly time to say goodbye and let her go. She has mammory cancer, chronic pancreatitis, and an intestinal blockage that won't get better without major surgery. But I can't put her through that, there's a high possibility she wouldn't even survive the operation. I've noticed the past week my blood sugar has been pretty elevated staying in the high 200-300 range even with my usual insulin regimen. Has anyone else experienced this in stressful situations? Should I increase my insulin for now? And am I at risk of going dka? Thank you all.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Yes. Stress hormones cause a rise in sugar levels. This is why long term stress is very dangerous.<br><br>\n  <b>Comment 2:</b> Yes, stress will elevate blood glucose. You will have to increase your insulin dose to compensate but be prepared for lows when your bg returns to \"normal\" as the stress subsides. If you're on a pump it's much easier to mange because you can raise the basal rate...\n\nLive Long and Prosper<br><br>\n  <b>Comment 3:</b> Sending huge hugs. It makes mine go so high, but that's natural when you're under so much stress. The weeks after I lost a close family member my insulin barely touched me. Be kind to yourself x<br><br>\n  <b>Comment 4:</b> Sending all of my thoughts and big hugs during this difficult time. I found out a few days before Christmas that my sweet girl has bladder cancer (she’s almost 15) and just the devastation from that news and a lot of crying, gave me insulin resistance. In my opinion, I feel that you need to let yourself grieve and be a little relaxed on your blood sugar levels. Looking ahead for when my girl passes, it will be really difficult and I’ll have to be less strict on my diabetes management temporarily just since life will be difficult enough as it is. Again, sending thoughts and just know that we are all here for you!<br><br>\n  <b>Comment 5:</b> I am so sorry....she will always, always be in your heart.    \n\n<3<br><br>\n"}
{"id": "kyauqy", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to give yourself a needle\nHi everyone! I’ve been a diabetic for a little bit over a year now and I need to start giving myself insulin shots, I’m not scared of needles however when the time comes for me to give myself a shot I just can’t do it. I was wondering if there is any advice for being able to give yourself a needle and was also curious about others experiences giving themselves their first needles.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I was definitely scared of needles to start with. I had to have a friend show me even finger pricks before I would try it. \n\nIt's terrifying, it's nerve wracking, and in the end, the anticipation and worrying is ABSOLUTELY so much worse than the actual needle. I did needles for about a year before switching to a pump, and maybe 1 in 10 actually \"hurt,\" approximately as bad as a moderate pinch.\n\nA badly placed finger prick is worse than the worst needle I've had, and it doesn't even hurt as long as a bad finger prick.\n\nI'd suggest started by using the needle in your abdomen, and when you're used to it, try side thigh or back of arm. \n\nSometimes they'll bleed, but usually with very little pain. I'd recommend getting those little circle bandaids if you're worried about stains, but I never did.<br><br>\n  <b>Comment 2:</b> Your first few times giving yourself shots are always the most difficult to do, but eventually once you do it enough it becomes as mundane an activity as any other. I’ve been a T1 for about 12 years (plus some change), I can tell you it definitely gets easier but you just have to slowly train yourself into a “mind over matter” mentality about it. Remind yourself of a few things: it’s not going to hurt nearly as bad as you think, you need this insulin in order to maintain a healthy lifestyle, you’ve been receiving insulin for a little over a year now, and anything else you can think up that helps you psyche yourself into administering the shot. You just gotta pump yourself up so you can get over that paralyzing anxiety hurdle that stops you cold at the last second.\n\nWhen I was younger, I used to be so afraid of getting shots that I would hide from my mom whenever I knew we were going to eat because I didn’t want to test or do my insulin. Eventually though, I got comfortable with it after I practiced telling myself that it wasn’t going to hurt, and I found that helped so much in reducing the anxiety I was feeling about doing insulin. When I was comfortable with that knowledge, it was only a hop, a skip, and a jump for me to learn to draw up my own shots and start doing them myself.<br><br>\n  <b>Comment 3:</b> For me, I’ve found that meditating before doing it really helps. I know it sounds weird, but if you’re more calm and relaxed it’s actually much easier. I personally would just close my eyes and focus on things opening to get this idea of my skin being more open to the needle, less mind friction I guess. Idk, but it worked for me. Good luck, there’s lots of ways to make the issue better without giving up for sure.<br><br>\n  <b>Comment 4:</b> Try and buy a steady shot it helps you get used to giving yourself insulin and goes for about 24.99 on Amazon. I have one and highly recommended it to anyone struggling to give themselves insulin<br><br>\n  <b>Comment 5:</b> Find a few good spots, take a deep breath as it goes in, maybe watch some tv or something to take your mind off it<br><br>\n"}
{"id": "hq14zv", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Switching from Guardian Connect to Dexcom?\nHow do I switch to Dexcom? My doc wants me to stay w/ Medtronic so I can be in auto mode, but auto mode is active maybe 30% of the time. Plus the sites are horrible,  always inaccurate and leaving bruises. For those of you that have switched from Guardian Connect to Dexcom, what was the process like? Thanks in advance!</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> [https://www.dexcom.com/lead/1](https://www.dexcom.com/lead/1)<br><br>\n  <b>Comment 2:</b> Well you’ll need an rx from your doctor. Go to dexcom’s web site, and get in touch with them, they will work with your insurance and your doctor to guide you through the process. \n\nTandem Diabetes has a pump with a closed loop system that is similar to auto mode that you can try to look into as well. A lot depends on your health insurance company and what they will cover though, at least in the US.<br><br>\n"}
{"id": "n30i5d", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How can I tell if my insulin has expired because my glucose levels have been rising throughout the day..</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Which insulin are you talking about? Maybe increase your long acting if this consistently happens. Insulin says it expires 30 days once out of the fridge.<br><br>\n  <b>Comment 2:</b> I find expired insulin to just be less effective, so I need more. Other times it may hardly work, if you suspect insulin is expired you should get rid of it. That being said, slowly rising levels through the day could be lack of basal insulin<br><br>\n"}
{"id": "iitbl6", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to help friend with newly diagnosed child\nHi! My friend’s little girl was diagnosed yesterday. She is very stressed out and overwhelmed. For those of you who have been there, what are some things people did or gifts they gave you that helped?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I know how your friend is feeling, but while diabetes is serious, it doesn't have to be a death sentence. I was diagnosed when I was 8, and am now 39. My daughter was also diagnosed at 3. Watching her go through what I went through was terrible. Anyway, I don't think diabetes has stood in the way of anything I wanted to do, or my daughter. I played active sports, did reasonably well in school, and had sleepovers at my friends houses. Diabetes means extra precautions and planning, but there are no complete barriers to what we can do...well maybe not being an ice cream taste tester. Your friend will get through it, offer support and hugs. While not optimal, their daughter will be stronger for it.\n\nAlthough, I did get a GameBoy when I was diagnosed. That definitely helped. :)<br><br>\n  <b>Comment 2:</b> I’m so sorry to read this. Receiving the diagnosis is devastating and having to learn how to manage the condition, while managing your emotions and that of a child makes the early days the hardest part of the journey (as far as we know so far).  But as the other poster has stated, your friend’s daughter will still be able to live a happy, fulfilling and active life.\n\nMy daughter was diagnosed when she was 5 and is now 7.  She is a very sensitive child emotionally and would hate having the injections - fighting and kicking us when it was time.  If your friend’s child is struggling, I highly recommend Buzzy - a vibrating bee / ladybird which you can hold against the injection site to distract from the sensation of the needle.  My daughter still uses Buzzy now when it is time to change Dexcom.\n\nWe tried the injections and finger pricks ourselves (new needles and lancets obviously) to show our daughter it was ‘ok’ to do it and because she said that we didn’t understand the pain and she wanted us to feel.  \n\nWe also used lots of rewards in the early days - whatever we could do just to get through.  She now has a very large collection of Shopkins!  \n\nDexcom blood glucose monitor makes life a lot easier for us - my daughter sleeps through hypos and the alarm sounds and wakes us up when she goes low.   \n\nWe also used the iPort to remove the number of injections given through the day - it’s a canula which gets changed every 3 days and insulin injections are given through it by the pen, instead of in multiple places on the body.  This was the biggest help to us.\n\nLast week my daughter was lucky enough to be put onto her first pump, the Omnipod (NHS, we are in England), and we love it.  Being free from getting the injection pens out when we are out and about, and just being able to type a few numbers into the handset to give her insulin is a complete game changer.  We love that it has no tubing and have enjoyed (if that word can be used with diabetes) decorating the ‘pod every 3 days.\n\nTell your friends to hang in there.  Life will be complete shite for a few weeks, maybe a few months, and there will be good days and bad.  But at some point it will become a new ‘normal’ for your friend’s family and daughter.\n\nOur daughter has grown up faster than her friends, I think.  She has a level of maturity and understanding of health and food that her friends are oblivious to. She has become quite confident and assertive around adults too, since she has now spent lots of time with the doctors, nurses, dieticians etc expressing her views and wishes.  \n\nIt’s really nice that you are wanting to help them.  Learn all you can for yourself, because sometimes it’s nice for parents to have someone to talk to who ‘gets it’.  Those that don’t deal with it really don’t understand the impact, so it’s wonderful that you seem to want to get involved.<br><br>\n  <b>Comment 3:</b> Her husband is out of town on business so I went with them yesterday for the hospital visit and first educational session. After a few finger pricks and shots, Millie was ready to fight if anyone even mentioned another one, so I’ll definitely get them a buzzy to try. We did finger pricks with her but she was not impressed lol \n\nThey ordered her a Dexcom at the hospital yesterday, so hopefully within the next couple of weeks they won’t have to do finger pricks anymore. I think they have to wait a while before they can consider a pump, but I’ll make sure she hears about the iPort. I think reducing number of injections may be hugely helpful for them. \n\nI think I’ll show her these posts. I imagine you’re right. She’s going to need people who get it, and seeing that there’s not only people in her life who care but also a wider, global community of people who are having similar experiences and can promise it gets better will be encouraging for her.<br><br>\n"}
{"id": "dcq39k", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can I do A1c bloodwork with low blood sugar?\nJust woke up to get bloodwork done soonish - fasting for 10 hours. Blood sugar is low - 3.4 right now and falling. If I go to the clinic ASAP will they do my blood work with low blood sugar or can I consume anything that won’t affect my fast to raise my bg? Don’t have dex tabs rn. Thanks.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Treat your low. It won’t really affect your a1c. It’s Ana average number over 90 days. Just take care of yourself now.<br><br>\n  <b>Comment 2:</b> A1c isn’t a test you need to be fasting for. Treat the low!<br><br>\n  <b>Comment 3:</b> You dont have to be fasting for just a1c. Definitely treat your low, your dr will understand.<br><br>\n  <b>Comment 4:</b> I have taken it before with high blood sugar and my test for A1C still somehow came back in good standing. But please don't be doing anything with low blood sugar get that balanced please.<br><br>\n  <b>Comment 5:</b> If people could lower their A1C by going into the Doctors office with low blood sugar, we'd all be cured!<br><br>\n  <b>Comment 6:</b> HbA1c, or abbreviated A1c, is not just your average blood glucose of the last 90 days. It’s a little more complicated. It’s actually measuring how much your red blood cells are covered with a sugar layer. So, no even eating a whole meal before an A1c test shouldn’t raise your A1c. If I’m wrong here feel free to correct.<br><br>\n"}
{"id": "opvv4f", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How my ratios changed after controlling my blood sugar is crazy</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I think the most important message here is not to allow someone to control your diabetes and parents teach your diabetic children to control their own disease.<br><br>\n  <b>Comment 2:</b> Good for you for taking control! The saying \"your diabetes may vary\" is a thing for a reason. And, yes, having a narrower range of blood sugars definitely affects ratios. Everything in the body affects everything else and the more balanced things are the easier it is for things to be corrected when they go wrong. The body knows where it's supposed to be.<br><br>\n"}
{"id": "gifrmp", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How does it feel when BG is too high?\nI have a 19 month old recently diagnosed T1D - because she’s so small and young, the doctors have been letting her BG stay higher than if she were older, since a low drop would be so risky. (By the way, I’m very stressed and if you disagree with this method, please don’t tell me any frightening reasons why - I really need to just trust our doctor right now and I’ve seen so many things to be scared of for her... by the way, we’re only 1 week from diagnosis, so we’re still adjusting and changing doses and figuring this out, so this isn’t because we’re going to KEEP her at this level, it’s just while we find the balance. Plus we’re still in honeymoon phase).\n\nWe only correct with novalog if it’s over 200 or for every 20g carb. So even with correction she’s been hanging around 250-320 BG and I just wonder how this may make her feel?... is it completely different for everyone? Or are there some common general feelings, like jitters, shakey, angry? It’s so hard to tell what may be BG and just “toddlerness.”</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> When my blood sugar is high, I feel lethargic. Honestly like I just want to curl up and maybe nap. Sometimes I feel a little cloudy mentally with highs and since I manage my own sugars, highs stress me out which doesn’t help the cycle of getting my sugars down. \nThe shaky feeling is normally low sugars for me.<br><br>\n  <b>Comment 2:</b> It just makes me feel really tired and sluggish when my blood sugar is too high.  I'm thirsty and have to go to the bathroom a lot (which is my body's way of trying to get rid of the excess sugar). It's like how eating a big carb heavy meal makes anyone feel really- you just want to take a nap!\n\nThe jitters, shaky, short tempered, unable to focus feeling comes with low blood sugar.\n\nAnd don't worry about her hanging out higher than she \"should be\" right now.  It took me a good month after diagnosis to bring my blood sugar down to a consistently normal level.  It takes some time! it's almost like detoxing.<br><br>\n  <b>Comment 3:</b> You're generally going to see the jitters and shakiness with a low. There aren't  many visible cues when it comes to a high, outside of witnessing the possible increased thirst and urination. It's also usually a lot harder for us to tell if we're high as opposed to feeling a low.\n\nThe most common symptoms are feeling tired and mentally foggy, and a lot of us can get more irritable and cranky. It's hard to describe, but sometimes for me it feels like all the veins in my body are being inflated or are swelling up, like they're trying to push their way out of my body to release the pressure. It's not a painful feeling, just sort of uncomfortable.<br><br>\n  <b>Comment 4:</b> I feel very stuffed I guess is how I’d say it, like there’s styrofoam in my knees and limbs and I usually stretch a lot when that happens. \n\nMy breath also starts to smell very fruity and I look very red, so I’d see next time if her breath smells like that when she’s high it might be a good indicator if it does happen.<br><br>\n  <b>Comment 5:</b> Lethargic, smell weird, shaky, and I personally get sleepy to avoid feeling bad. It’s inevitable having IOB but knowing in your heart you need a bolus at that time because ur BG is rising and you feel it.<br><br>\n"}
{"id": "wweb0n", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How do I be a better partner?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Good on you for asking for advice!\n\nIn my honest opinion  you are never going to be able to assist or care for someone with diabetes, if they don't care about it themselves first. \n\nI think the conversation you should b3 having is with your partner, asking if they need help or want you involved first of all. \n\nI've done this for 25yr my wife has only seen it for 3 and sometimes it can come across as very diminutive when you remind or offer advice. \n\nIf your partner would appreciate your help, you should speak to them directly. \n\nAdditionally learning as much as possible about T1 would be a huge advantage. Eg basics<br><br>\n  <b>Comment 2:</b> Ignore what the T2 tells you. There is no \"right\" answer except the one that works for her.\n\nYou'll get as many opinions as people that reply, and each of them will be the answer that works - for that poster.\n\nMy wife eased into it. She listened to me, did her own research, and knew where the boundaries were. The only time she makes decisions or gives me unsolicited input is when she beats the CGM to knowing that I might be trending downwards. Apart from that, she listens, offers opinions when asked, and says the right thing when I moan.\n\nShe doesn't hand glucose to me, follow me on the CGM, or hold my hand. We're two adults and she trusts me to handle my shit. She cares, but knows I'm the worst patient in the world and hate fussing.\n\nOthers around here will tell you that they like their partner to fetch the juice box or candy when they go low, or need more care taken of them. And that's fine, that's their preorgative.\n\nAll of which is a long way to say that the only right answer is the one that she gives you. Ask her what she needs physically and emotionally. Take that information and be prepared to adapt it as your relationship evolves.<br><br>\n"}
{"id": "10kylx9", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How to know how much bolus units to inject?\nI've been on a strict diet for 3 months now, so I've decided to eat something with a bit more carbs, but I'm not sure about the amount of insulin I should be injecting before eating it so is there a way to calculate roughly how many units are enough for a certain amount of a certain food?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Did your doc give you an insulin to carb ratio? They should give you a number to start with. If you have one it’s pretty straight forward. Let’s say your ratio is 1 unit for every 10 gram of carbs. You eat 40 grams, you’d take 4 units. Unfortunately insulin to carb ratios are very individualized so no one on here can give you an exact starting point. It’s based on a variety of factors including your total daily insulin amount.<br><br>\n  <b>Comment 2:</b> If you don't know your insulin/carb ratio, try to estimate that from the recurring meals you usually have. Probably it won't be perfect, but a good starting point to figure it out (also for the future)<br><br>\n"}
{"id": "gr3o0m", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How do you manage new pump sites?\nT1 for almost the past 20 years. 6.6 A1C, never been above 7. Good control for the most part. \n\nQuestion is - how do you manage your pump site changes? Seems like recently it takes me a few hours for the insulin to actually reach me after I insert a new site. I have to wait and see if it’s a good site or not, and usually by then my blood sugar goes way up +300. Then, the insulin hits and I plummet and go low. \n\nAny advice here? How do you manage your levels until you’re sure you have a good insertion?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> personally (41+ years, 17+ on pump, loads of scar tissue), i just started on a dexcom g6 and so far, it's working really well for me. my first site change will be on thursday and i'm planning to use the underside of my arm, which other users assure me provides good readings.\n\nas for my readings, they are still all over the place, but for the first few days, i would test to compare it with the reading on the app and so far it's been within ten points. so far i am pleased with it and the alarms aren't too bad. and if your insurance covers the pump, the dexcom is also durable medical equipment. so ask your endocrinologist if he/she has a favorite one. i've tried all three of them (dexcom, abbott freestyle libre, and medtronic)<br><br>\n  <b>Comment 2:</b> When I was on the medtronic, I used to have to double the recommended “fill cannula” recommendation. Even with the Tandem I still increase it by about 30%. I think they recommend .4 units and i prime .55 or so. \n\nIt took me a while to figure this out, but I actually want to feel a little “burn” from the insulin going in before I trust that my basal is being delivered.<br><br>\n"}
{"id": "19ewm85", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How many replacement infusion sets will Tandem let you have before cutting you off?\nI swear they must’ve changed their adhesive or something, I’ve gone through 4 infusion sets in the last week and it’s very frustrating! I put them on after rubbing down the area with alcohol and then go about getting dressed or whatever and they come right off! I’ve already gotten replacements from them back in November, 4 to be exact. I just wonder how many more I can get before they tell me “no” and to go f myself haha.</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Silly question but are you letting the area fully dry before applying the infusion set?<br><br>\n  <b>Comment 2:</b> I've had them send me several boxes<br><br>\n  <b>Comment 3:</b> I use IV prep wipes that have a small degree of tackiness.  Years ago the tech support told me to let dry then apply….made a huge difference even with tacky wipes.  I don’t have many problems with the infusions coming loose even when sweating….baths can be bad but I also don’t go swimming so I don’t lose them.  Be sure after applying to rub the adhesive surface several times to ensure fully stuck<br><br>\n  <b>Comment 4:</b> I have to use IV prep wipes or Skin-tac before I put it on and then put an overlay patch on top, or else mine don't stand a chance of making 3 days.<br><br>\n  <b>Comment 5:</b> I’ve been using skin tac and an overlay for years. At times I get some skin irritation so I add a squirt of Flonase. Rarely have one fall off. I’m surprised that people don’t and can keep them on.<br><br>\n  <b>Comment 6:</b> We use rocktape on top. Otherwise there's no chance of it staying. It's more difficult to detect leaks, though.<br><br>\n"}
{"id": "f0b5yx", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>how to not be freaking hungry all the time?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> I presume you're not low when these feelings happen? If you are then you obviously need to correct with a measured amount of fast carbs.\n\nConsider proteins or other no-carb/low-carb options if this isn't low glucose relates. I find nuts are really filling, pecans are my favourite and are very low carb.<br><br>\n  <b>Comment 2:</b> So I had to go low carb and had this problem for months. I keep eating more and more protein. Finally I have gotten to the point where I am only hungry at my regular meal times. \n\nIt sucks. Worth a try if you up to it. If you do weighing how much protein your eating helps so you know how much more to add each time you up it.\n\nI am not a doctor.<br><br>\n  <b>Comment 3:</b> Having this issue too, after I decided to go low carb-ish. It sucks :/<br><br>\n  <b>Comment 4:</b> Try adding fat. Cheese, nuts, full fat sugar free yogurt, salad loaded with olive oil. I went very low carb almost a year ago and was always starving until I started grabbing full fat snacks. It’s weird at first because we are taught to choose low-fat whenever possible, but by eating higher fat foods, I eat much less overall and stay satisfied.<br><br>\n"}
{"id": "lzpix7", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Viacyte possible cure\nCan someone update me in the viacyte trials for that stem cell therapy thing . How is it going is it more promising . What do u guys think\nPs: I know how thing s go around but I dont belive thebthing of the we are money cows and we will be forever okay ? Just try to be informative and realistic\nThank uu</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> [https://clinicaltrials.gov/ct2/show/results/NCT04678557?view=results](https://clinicaltrials.gov/ct2/show/results/NCT04678557?view=results)<br><br>\n  <b>Comment 2:</b> There are only 70 participants in this study. Estimated study completion April 2023. If results are good, then a larger group will be studied. Then FDA approval needed. After approval, insurance will say it's experimental (read expensive) and will deny coverage. Once treatment price comes down and it's cheaper to cure then maintain (with insulin, syringes, cgm, pump, etc), then insurance will cover. \nOf course I'm not an expert, that's how I've seen trials and insurance work. \nAm I jaded? Absolutely. Been waiting for that 5-10 year cure since 1972. I do think a cure is out there, but I'll believe it when it gets into the real world. https://clinicaltrials.gov/ct2/show/NCT04678557<br><br>\n"}
{"id": "omrsts", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>How often does your dawn phenomenon fluctuate?\nI notice that a few times a year, something shifts in my body chemistry and I'm either waking up too high or too low. Recently, I saw an uptick. But not a little bit. A really big uptick in my numbers where I'm waking up at 250+ when I would typically be around 115. \n\nI have an alarm set for 3:30AM to wake myself and administer the dawn phenomenon correction, but it's super scary to think about suddenly adding 5 additional units of insulin. This pisses me off because my numbers are really good and my control is tight, but my formula is useless right now.\n\nFor my friends who bolus in the wee hours of the morning, how often do you see this number fluctuate? Have you ever seen a consistently big spike with no logical explanation?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> For me I blouse at 6am now as by 9:00 am I’m having sugar in the 250’s range \nI blouses  only 3 at first and then proceeded with 4 \nYes it’s scaring to not take too much \nBut I make sure I’m not sleeping anyway past 8:40 since work starts at 9am<br><br>\n  <b>Comment 2:</b> Hi I would look at other factors as there is always a reason... I would ask myself the following questions\n\n1. How was my sleep?\n\n2. Hormones... time of month if woman? Am I sick/mild infection \n\n3. Hydration... will cause insulin resistance \n\n4. Is my basal correct? How was my daily steps/basal activity\n\n5. Did I eat a large meal which could be delayed digestion?\n\n6. For me I find that if I eat higher than normal calories that day I have it more pronounced the next day... guessing liver passing out glycogen \n\nWhat basal are you on? How often do you basal test etc? How consistent are you with sleep/exercise/meal consistency etc?\n\nHope this 🙏 helps<br><br>\n"}
{"id": "ke5ylb", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can blunts affect blood sugar?\nSilly question I know lol. I know that marijuana itself doesn’t lower sugars like alcohol, but can blunts/tobacco directly affect sugars?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> As others have said, a body high can feel kinda weird and I know I’ve thought I was low from one. But I also found I was more diligent in checking them than I normally am? It was odd. Also yeah, be careful not to get so blasted you forget to bolus snacks. Idk how likely that is for you as a person but it is worth saying.<br><br>\n  <b>Comment 2:</b> The biggest risk from smoking (to me) is double-dosing my insulin because I forgot about the first dose. Make sure you have either someone else looking out for you or some kind of log that you keep your dosing on!<br><br>\n  <b>Comment 3:</b> Some strains cause my sugar to bottom out. It just depends on what type I’ve gotten. I tried Animal cookies recently and I struggled to keep my sugar up. I had to start being in the 200s before I smoked it. But the new stuff I have doesn’t really mess with my sugar.<br><br>\n"}
{"id": "kxiskp", "text": "<div class='post' style='user-select:none;'>\n  <h2>Post</h2>\n  <p>Can i just complain about my immune system for a second?</p>\n</div>\n<h2>Comments:</h2>\n  <b>Comment 1:</b> Same. I keep SS antimicrobial cream in the fridge and stock pile bandaids bc a girl's gotta shave her legs, play with cats, and break a few dishes!! For real tho, every.. damn.. paoercut.<br><br>\n  <b>Comment 2:</b> How's your bg in general? I haven't had this problem at all. I know healing is slower if bg is generally high.<br><br>\n"}
