{"id": "1", "text": "<div class='post' style='user-select:none;'> <h2>Post</h2> <p>Can a sudden change in management/A1C cause issues with my eyes?</p> </div> <h2>Comments:</h2> <b>Comment 1:</b> To preface this: this might not be the best advice, but this is experiences I have had, and what I would do if I were you. Also I hope to calm some of your nerves.<br> I went through a bad period of bad life circumstances, bad access to insulin, and depression. My bg was NOT good.<br> Recently, I noticed periods of blurred vision and I developed spots in my vision. I had the same retinopathy fears. It was shocking because at every yearly exam I had healthy eyes. (Still do, yay!)<br> I went to the doc and found out I have vitreous floaters. My doc said there is no prevention or treatment. She told me it can just happen with age (I'm in my mid 30s; only had type 1 since 2013), but to look out for other issues with my eyes.<br> I don't want to say you don't have retinopathy.... I don't know your eyes. But I just want to calm fears that this might have some other explanation. Like you said, it might just be a change in your vision.<br><br> <b>Comment 2:</b> I’m 18 diagnosed at the age of 4, the whole eye stuff definitely scares me. I hope everything works out for you.<br><br>"}
{"id": "2", "text": "<div class='post' style='user-select:none;'> <h2>Post</h2> <p>How do you have a oral surgery? I was diagnosed last four months ago, but I’m supposed to have an impacted wisdom tooth taken out and I’m terrified. How does that work?</p> </div> <h2>Comments:</h2> <b>Comment 1:</b> I have been conscious every time. With a wackload of freezing. Wisdom teeth (2 impacted), pulled infected molar/implant install, root canal and crowns. The infected tooth was the worth. Everything else was not too bad, just the sound of them breaking up the bones for the impacted teeth or having it pulled is really weird.<br><br> <b>Comment 2:</b> I removed all my 4 wisdom teeth and I didn’t have to do any thing different on my routine. It’s a pretty straightforward surgery. One of mine was infected and twisted so it took a while maybe 2 hours and recovery was painful and slow. Other 3 were around 30 mins and easy peasy recovery. I didn’t find my T1D influenced any part of the procedures.<br><br>"}
{"id": "3", "text": "<div class='post' style='user-select:none;'> <h2>Post</h2> <p>Can mismanaging diabetes cause a puffy face? My partner was diagnosed t1d 2 years ago and has struggled at times to manage her diabetes. She’s always been a very slim person and had a very prominent jaw line until she got sick and eventually diagnosed. Her face hasn’t looked the same in years. Of course, I would never say anything. But she has mentioned the change in her face to me many times before. She’s mentioned it to doctors. They have suggested it could be mismanagement or maybe even a skin issue as she has a rare type of eczema. Lately, she’s been managing just fine and even started using a face cream to treat rosacea. But it’s made no difference. Is mismanagement really the cause?</p> </div> <h2>Comments:</h2> <b>Comment 1:</b> It can. My doctor can tell if my A1c went up just by looking at my hands (they tend to swell well before anything else on me).<br><br>"}