{"id": "l0zcus", "text": "\n        <div style='user-select:none;'><b>Post Title:</b> How do you all make sure you all know what you’re getting at a restaurant? Or what are your stories?<br/>\n        <b>Post Content:</b> So here’s the sitch, I’m new to all of this, only been diagnosed for 3 months. I went out with some friends to have a chat while they drank, and I had two Diet Pepsi. I don’t know if it is because I haven’t had Diet Pepsi or Pepsi in years, or if it was because they were watered down with ice, or if I was just careless but they ended up swapping the diet with regular Pepsi and here I am riding the rollercoaster an hour later. \n\nWhat I’m interested in hearing are your stories, or perhaps any advice that you yourself apply. \nThanks all!</div><br/>\n        \n            <b>Comment:</b> I usually spell it out that I am diabetic it has to be no sugar etc. since most servers are very busy and mistakes happen. It happily covers the ones who are just plain stupid, too. \n\nFor mains, I try my best to avoid carbs since I have absolutely nothing beyond a guess of carbs relative to the serving portion. A nice steak or chicken breast over a salad, on the other hand, is easy protein with few carbs and fiber.<br/> <br/>\n            \n            <b>Comment:</b> I check the menu online before I go, they have to have nutrition info posted. It won't be exact, but you can use it to estimate.\n\nAn old tip is to get a kid's meal, or ask for a box as soon as the food arrives to the table and box half of the plate to go. Some restaurants will box half for you if you ask.\n\nA far as accidental mishaps, I don't drink soda, so I don't have a problem getting surprised when it isn't diet. Tea, coffee, water with lemon etc.<br/> <br/>\n            \n            <b>Comment:</b> My go-tos are bunless burger or a steak and salad.\n\nDiet soda or where I’m at ice tea is prevalent so I can order it unsweetened and those places usually have artificial sweenters on tables to sweet to your liking. \n\nMyFitnessPal has a decent amount of restaurant foods so in a pitch I’ve searched there but take it with a grain of salt.<br/> <br/>\n            \n            <b>Comment:</b> The glucose test strips should work on diet soda vs regular soda.\n\n[https://www.mysugr.com/en-us/blog/diet-drink-really-diet-check-sugar/](https://www.mysugr.com/en-us/blog/diet-drink-really-diet-check-sugar/) \n\nIn terms of restaurant foods, there's a calorie-king book that my Endo's office had stacks and stacks of.<br/> <br/>\n            \n            <b>Comment:</b> https://www.amazon.com/DietDetector-Test-Strips-Accidental-Consumption/dp/B081DZK4YB these might be of use to you<br/> <br/>\n            "}
{"id": "zc1lsk", "text": "\n        <div style='user-select:none;'><b>Post Title:</b> Insulin expiry<br/>\n        <b>Post Content:</b> Can insulin be used after expiry or does it completely stop working<br/>\n        \n            <b>Comment:</b> The expiration date is based upon stability data done by the manufacturer. They test it for a time period to ensure it is still effective. Then they round down by a lot and the FDA approves that. \n\nSo, unless it is like 2x as old as the expiration date, it is probably still good. Also, it doesn’t instantly go bad on day 356. It just starts to degrade over time. It also depends on the conditions it was stored in.<br/> <br/>\n            \n            <b>Comment:</b> My friend writes on her pens and vials when they come out of the fridge, 30 days room temp is what she goes by. She never has enough in the fridge to expire, important to rotate old in front as she loads the fridge so first in-first out for insulin in fridge.<br/> <br/>\n            \n            <b>Comment:</b> I have used insulin up to a year past exp without issues. It was refrigerated the whole time. Of course if you use expired insulin, check sugars more frequently to make sure its working as it should.<br/> <br/>\n            "}
{"id": "ekvc0j", "text": "\n        <div style='user-select:none;'><b>Post Title:</b> a question for people diagnosed later on in life:<br/>\n        <b>Post Content:</b> How did you cope with your diagnosis and, in a sense, \"mourn\" the life you had before?\n\nI am 19 and was diagnosed a little over one and a half years ago. Around the time of diagnosis I started following disordered habits from eating disorders in general, and after a few months I fell fully in a specific ed (Diabulimia - a person with type one who omits/restricts insulin for weight loss). It is very dangerous and destructive to the body and mind. I am currently in treatment at the moment to work towards recovery for that.\n\nHowever, Ive been having a lot of issues with depressions and a sense that \"my life is over\" and that I will never get back to the point before my ed because that was also pretty much right before i was dx for t1d. I have been told a few times that im probably still in the grieving process of my life before.\n\nSo, how did you deal with the loss of this \"another world\" where you didnt have to think about carbs and insulin? how did you get through it?\n\nthanks :)\n\nEDIT: I feel like i should have added this before, but I do have a dexcom cgm and I have an omnipod for a while but with my ed now it makes the idea of a pump makes me really anxious so i do pen injections because i feel like i have more \"control\" over the insulin .<br/>\n        \n            <b>Comment:</b> I was diagnosed 5 years ago, at the age of 33. I have certainly struggled with these thoughts and I definitely have days when I just wish I could eat whatever I wanted without worrying about insulin and the after effects. I doubt these days will ever stop happening but maybe they'll become less frequent.  \n\n\nThere are times that I get incredibly frustrated with this shitty disease which is normal and we should be allowed to have these frustrations - it's a pretty thankless 24 hour job managing it! But we can still achieve great things even with these extra hindrances thrown at us. There are so many top level athletes with T1D, like the pro-cycling team Team Novo Nordisk, that are role models to remind us that we can do some pretty awesome stuff. (Disclaimer: I cycle a lot ;) )  \n\n\nIf you feel that these days are becoming too much to bear and/or are happening frequently it may be worth talking to someone professional about it. My diabetes clinic (Berlin, Germany) has offered me such services in the past.   \n\n\nTake care and we're with you!<br/> <br/>\n            \n            <b>Comment:</b> I was diagnosed with T1D last year at the age of 29. At first, it was a jarring transition... With a million questions and overall anxiety about how am I going to do this for the rest of my life. I couldn't even take it day by day.... Minimally, it felt like I was taking things meal by meal.... Which is a lot.\n\nWith that being said, I do my best to keep my blood sugar under control and wherever my health takes me next, my ultimate faith rests in Jesus. So I have peace regardless of what happens in this life.\n\nPractically, things have gotten better as far as sugar management and the general \"life of a diabetic\". After a year, it's not quite as overwhelming. I've found that knowing more about my condition allowed me to have more control over my health, which reduced my anxiety. (my Dexcom CGM really helped with this). And now, dealing with diabetes feels a lot like an extra thing that I need to do on par with showering, brushing my teeth, shaving, etc. Does it suck to have yet another thing to manage? Yes. But there are lots of things we can do to help minimize the seemingly daunting task of living as a T1D.\n\nHope this helps -- best of luck to you!<br/> <br/>\n            \n            <b>Comment:</b> I was diagnosed at 23 in my last year of undergrad (4 years ago). \n\nThere are times where I get frustrated with this disease and have moments where I miss being 'healthy' but I just cope. \n\nHaving the dexcom and an insulin pump has made it much more doable for me.<br/> <br/>\n            \n            <b>Comment:</b> I was diagnosed at 19. This disease you just have to own. Its a part of you who you are now. You can still eat pretty good to be honest, so its not the end of the world. I can live without cake :)<br/> <br/>\n            \n            <b>Comment:</b> [deleted]<br/> <br/>\n            \n            <b>Comment:</b> I was diagnosed in 2018 at the age of 37. It was absolutely jarring. The year before, the beginning of 2017 I had my first physical in 5 years. I had ballooned to 300lbs, my blood pressure was high, I had a high fasting glucose barely meeting the diagnosis of pre-diabetes. and my doctor challenged me to change my lifestyle. If i didn't I was probably going to have a heart attack.   \n\n\nSo through out 2017 I slowly changed my lifestyle. I tracked calories. I tracked exercise. By the summer of 2017 I was down 50lbs. By the holidays I was down 60lbs. I had never felt so good about making progress but I wasn't feeling better. I was feeling worse. By February I was back in the doctor's office explaining how i felt. Peeing a lot. Cramping in my legs is actually hurting a ton. couldn't sleep. \n\nA basic metabolic panel later I got a call at work that I had to come in because my blood work came back. If I couldn't get away from work they'd call an ambulance.   \n3/6/2018 after losing 80 lbs I was diagnosed as a diabetic. It was 1 simple blood test when they told me I am a Type 1 and I will be dependent on insulin the rest of my life. I initially took it in stride. no problem at all. then, as time went on I got burnt out. Tracking carbs, measuring everything.   \n\n\nNearly 2 years later I finally feel like I have a handle on it. I hate the holidays because it is like everyone goes nuts with sugary treats and to me that costs money just to eat it.   \n\n\nDepression has been something that I deal with a lot more. I find that exercise helps me a ton with battling that. I am practicing meditation and that keeps me in a better headspace. I also post things here. Successes, failures, everything with a community of people who actually understand what I am going through and get support that way.   \n\n\nKeep it up. You're doing great.<br/> <br/>\n            \n            <b>Comment:</b> Well I miss my old life and eating without taking insulin and using a meter but, I always think without this I couldn’t be the way I am today. It’s never gonna be easy but it gets easier the longer you deal with it.<br/> <br/>\n            \n            <b>Comment:</b> 30 years old\nGlad i got the pre type 1 time i got\nI think being older i took it pretty well<br/> <br/>\n            \n            <b>Comment:</b> I was diagnosed with 19, after about half a year of having it without a doctor bothering to add one and one with the symptoms I went to see him for. Honestly, I would have accepted almost anything that makes me get better, and once I got way better, I just embraced that I was getting better and how I was getting better (I had been weak,  had dry skin, bad eyesight, and lost a third of my weight). \n\nThere was not as much of a loss of another lifestyle, since I was actually living once again.\n\nSure, managing all the stuff can be annoying, frustrating even, but I think the only way around it is not a way you want to go. I think it is really important to overcome fear of high or low bg values and the scenarious and that way you can still eat cake or ice (if you do not go overboard of course).\n\nI think it did not effect my life too drastically, possibly even had some positive effects, as in I eat less then before and do not take another portion, simply because it tastes well.<br/> <br/>\n            \n            <b>Comment:</b> I was diagnosed at 26 after more than a year of feeling absolutely awful all the time. I was having migraines, losing a bunch of weight, and other vague symptoms my Dr at the time decided to just interpret as depression. Migraine drugs and anti depressants are no substitute for insulin, believe you me...\nSince my diagnosis was missed so long I guess I didn't feel a great sense of loss, since life had been so hard for so long right beforehand. Not that it wasn't a big adjustment and all, but it had really felt like I was going to just die for quite a while. Once I had the tools to take care of this dysfunctional body, life got better not worse.\nIt is definitely ok to feel a sense of loss, this disease does suck. It's a constant mental and financial drain. Even in the 10 years since diagnosis though, it's amazing how far the treatment and technology has progressed. I mourn the loss of a working body, but am so amazed and grateful for the treatments that can make life pretty darn close to normal.<br/> <br/>\n            \n            <b>Comment:</b> I'm 18  (today was my birthday)  from Germany and got diagnosed 2 months ago \nI feel the same \nI just hope for (mental) recovery\nBut it fills me with Joy that others are now feeling better<br/> <br/>\n            \n            <b>Comment:</b> I was diagnosed at the age of 21, and honestly came to terms with it as soon as the doctor told me. It still feels like a dream and even if I wanted it to end, there's no way to stop it and it's just part of me now. \n\nIt's been almost 10 months since my diagnosis, and I don't think I'd change a thing. Sure times were better when I didn't have to worry about carbs, insulin, and constantly trying to monitor my sugar. But this is me, and I'm just thankful to still be alive.\n\nThe best part is knowing that I can still eat the same stuff that I was, maybe less portions of certain unhealthy foods, but it took me a few months to realize YES I can have a slice of cake. \n\nSometimes it's nice to look back on how things were though. I do remember waking up in the ICU, feeling like I was under the influence of something (Nope just insulin and fluids) looked over to the corner of the room, and on a table... A freaking gift basket with candy, chips, and plenty of things that I didnt really feel comfortable eating after such a scare.\n\nNow it's either with a meal or if my sugar is low, which sucks, because I'm a big sweets guy! It's okay though, honestly happy with how things are. I get a lot of pride out of knowing I'm doing well with my health, all things considered.<br/> <br/>\n            \n            <b>Comment:</b> I'm sorry you've had such a rough time, I think I might have ended up in a similar state if I was diagnosed at the age you were. I was 24 when I was diagnosed and had the advantage of a few more years (I struggled with an ed at 15). I always felt grateful I didnt have to cope with T1D through my teen years.\n\nIt took me at least 9 years to fully come to terms with it in all honesty, however ppl thought I was doing great. I really rebelled and took on an attitude of 'I'm not going to let this stop me live my life' and I partied way too hard, expected way too much from my body and took stupid risks and didnt really give my body the care it needed while stuck in this cycle of bravado (which I was actually praised for adopting!). As I always had good A1Cs I was never really pulled up on this.\n\nIt took diagnosis of another disorder to make me realise how precious our health is and that the real way to cope with this is to accept that it's now part of my life and the best thing I can do is learn how best to support my body and live the best life I can in harmony with my body instead of fighting against it.\n\nI was 33 when I finally called a cease fire in the war I had been raging on my own body for years. Whether it be battling over weight, forcing it way past its limitations (in terms of partying, fitness and working way too hard) or just despising it for its limitations and diseases. I'm finally slowly learning to accept my body and even be kind to it and I hope that helps me get a few more years out of it in the long run with a lot less pain!\n\nI wish you the best of luck in recovery with your ed and finding peace with your diagnosis. Xx<br/> <br/>\n            \n            <b>Comment:</b> Hey :) I was diagnosed at 10 so I can’t really speak to a later in life diagnosis- but I have suffered from anorexia (due to my diabetes) since I was around 13. Just want you to know that you’re not alone in the complicated ED diabetes relationship. The only advice I have for a later diagnosis is that as time goes on diabetes becomes easier to manage as you learn more about it and also it begins to feel more like your normal and less like this new thing. I guess eventually you just adjust. Sending you so much love. If you need someone to talk to about ED& diabetes feel free to message me.<br/> <br/>\n            \n            <b>Comment:</b> Dx at 24, and I absolutely went through a grieving process. I cried for days, thought about all the things that would change, would never be the same. I had to explain it to *everyone,* which was really hard. I never felt rebellious toward the use of insulin itself, but I certainly felt resentful. I think everyone, even kids, go through this process, of just wishing and wanting to be \"normal\".<br/> <br/>\n            \n            <b>Comment:</b> I was diagnosed at 24 years old. I was in college, had a boyfriend that I wanted to marry, new independence and was looking to move out of my parents house. I lost everything except the boyfriend (now husband) and a good chunk of my social group. \n\nOn top of that, I had lost my health to DKA so it was difficult to move or be active, difficult to recover since my body was weakened. All my time was taken up with sleep, physical therapy, or doctor's appointments. I couldn't even muster the brain power to pay attention to tv shows, read, or browse the internet. I was barely more than a vegetable. Even as I started to heal, I was stuck in depression. Nothing seemed worth doing because it was so hard to do things that had been so easy, and anything I enjoyed had to be planned around my illness.\n\nIt honestly took going to therapy in order to come to terms with my new normal.  I had to learn to forgive myself because this wasn't my fault. I had to learn to accept help from others but also to stand on my own two feet again. I had to get used to the idea of having to work around a new set of rules. \n\nIt helped a lot to frame this as like a food allergy and nearsightedness. The pump is just another tool to get me through the day, like glasses and my phone. Carb counting and dosing is just like checking for peanuts and making sure I take an antihistamine before going outside or a lactaid before milkshakes. It's just another set of daily rituals that we all have, I just didn't get to pick mine.\n\nIt also really helped to \"own\" my diabetes. I picked a cute case for my pump so I feel more in control of how it looks on me. I changed the tones of my cgm alarm to something more personal. I embroidered \"My Life\" on my supplies bag and made a T1 friendship bracelet to wear when the drugstore medical alert band clashes. It helps me feel more like I have a say in the day to day management of myself now that I have this new ~~burden~~ responsibility.\n\nI remember once likening it to having a toddler that I didn't ask for but now constantly have to manage. And I can't ever get a babysitter. \n\nBut just like with all things, the practice helps. I'm getting better at being a diabetic. I challenge myself to improve my time in range a little bit more every week. I practice dosing when I'm supposed to and remembering to check my bg before I eat and go to bed. I play little games with myself to guess the carbs before I check and try to memorize the doses for my favorite snacks. I get myself supplies to help like low-carb cookbooks so I can have variety and control. \n\nMost importantly, I let myself joke about it. My sister in law loves to bake and occasionally she'll describe what she's brought to gatherings and I clutch my insertion site in mock agony. \"Pecan pie swirled fudge brownies with marshmallow glaze? ... augh! I can feel that in my pump!\" \"Are you trying to kill me, woman? I'll have 2.\" Friends being sappy with each other, or a particularly sweet love scene in a show? \"Ah, my 'betus!\" \"I can feel my blood sugar spike just watching this.\"\n\nTL;DR - Therapy to help you forgive yourself and adjust to what is now your new normal set of rules, and humor and a deliberate set of choices about your management to feel like you are still in control. I chose how it looks and how I joke, but it can be anything.\n\n[Edit] OH! Also, I should mention, that while I lost about a year of my life to recovery because my DKA was so advanced (yay stubborn refusal to get checked out because \"I'm just tired\") I am back to better than ever. We call that year my \"crucible\" because it burned all the crap out of my life. The friends I lost were shallow friendships and the ones I kept are stronger than ever. I recognized what was important to me and focused on that during recovery as motivation and now I am in my chosen career moving towards my ideal position. I married my husband, have a stronger relationship with my family (my sister got a lot less catty when there was a real chance she'd have lost me) and the forced focus on my health means that I have had to develop much better habits than I'd had leading up to my diagnosis. So while my normal changed forever and I lost the normal that I'd had, my decisions moving in to the new normal gave me the chance to make it a better one. I am happier, healthier, and more focused because when the choice is live or die, it becomes surprisingly easy to choose life. But it *did* take professional help to guide me on that path and make the right choices, and it did take a *long* time. I finally feel \"normal\" again and I am a week past my 6th diabetiversary.<br/> <br/>\n            \n            <b>Comment:</b> Wow - I love this question. I was diagnosed at age 45 as a Type 2, and then as a Type 1 at 46.  Two different reactions...\n\nAs a new Type 2, I had a ton of optimism that I was going to beat it. I was already lean and had a decent diet, but I understood that I could just get hardcore (diet, exercise, intermittent fasting) and could get better. Insulin was a temporary thing, and the rest was on my shoulders. \n\nA year later, I was 15 pounds heavier despite my efforts, eating very little but gaining weight anyways. I was feeling like I was losing the Type 2 battle and feeling guilty, and then had the GAD test done that told me I was a Type 1.  \n\nThat was a shock!  This was a random thing that happened through no fault of my own, and I’m in this for life.  Diet and exercise isn’t going to fix it. I was going to have to rely on insulin for the rest of my life.\n\nThat shock only lasted for a few days, and I just “decided” to embrace it. I’m a practical person and don’t really dwell on stuff, so I just ordered a Medicalert tag and started learning from this sub on how to live with it. \n\nIt’s only been four years, but I’ve come to love learning more about myself and running experiments to see how to improve my life. What if I shift more basal to morning?  How many units at what time so I can indulge in a bowl of ramen?  Ya, it sucks that I have to think about it, but the more I learn the less this disease impacts me.<br/> <br/>\n            \n            <b>Comment:</b> I was 15 going on 16 when I was diagnosed. Nearly 30 years ago. I can still remember the feelings of devastation & loss. I went from being an invincible teenager on top of the world to a depressed dying child.  Insulin pumps, while they existed, weren’t an affordable technology and CGMs were only in their infancy of development. I had to learn how to mix my long acting & short acting insulins and had to learn how to make sure my blood sugar meter was calibrated properly for accurate readings.  I was a rebellious teen and didn’t want to do any of it. I absolutely did not understand why I was sick, I did nothing wrong. I wasn’t old, diabetes & needles were for old people.  30 years. I’ve learned that time & patience will cure you of damn near everything. Even the spinning out of control feelings of your body’s ultimate betrayal. Sometimes I absolutely hate being a type 1 diabetic. But mostly it’s become like the hum of electricity, it’s background noise that I miss when a storm knocks the power out. In many ways the diabetes has made me a stronger person, able to handle the many challenges that life has thrown at me, mainly because none, while bad, were as bad as that. I’m absolutely certain that you will do well & survive this. Diabetes is hard. Life is hard. You are stronger than both. Remember that, you will do well.<br/> <br/>\n            \n            <b>Comment:</b> I was diagnosed almost 3 years ago, I was 17 almost 18 and just finishing school. When I was admitted into hospital I knew what was going on and how serious I had to be about taking care of myself now, but it didn’t really sink in until  I got home 3 days later. A thing I was told when I was diagnosed is that: I have diabetes, diabetes doesn’t have me. \ndiabetes doesn’t define me as a person. And that really helped me early on and it’s something I really stand by. Don’t get me wrong, I still have days where I hate my illness. I still have days where I want to flush my insulin down the toilet and hope it’s a bad dream, and sometimes I do hate my body. I get frustrated and sad.  But it’s not all bad. You can still eat carbs and yummy food you just have to know your body (easier said then done I know) your allowed to not know things. You’re the perfect person to sneak food/drinks into a theatre because “it’s for my diabetes”  It’s a scary illness with scary consequences. So take time to come to terms with it. Talk to people about it because there are so many others who understand. \n\nHope this helps somehow :)<br/> <br/>\n            \n            <b>Comment:</b> Diagnosed at 27, my first thought was... \"ok, finally I know what's wrong with me and why do I feel like shit for the last 6 months,  now how do I deal with it...\".\n\nLife is ok, could be better,  could have ended up much worse<br/> <br/>\n            \n            <b>Comment:</b> I was diagnosed when I was 16, 14 years ago, and the main thing I would say is that in five or ten years you won't remember not being diabetic. Or at least you will have to think hard to remember what it was like before. As to coming to terms with it, I don't know that I have, but I have severe gastroparesis that interacts poorly with my diabetes so that I'm in and out of the hospital. I suggest a ton of therapy.<br/> <br/>\n            "}
{"id": "ho8kxl", "text": "\n        <div style='user-select:none;'><b>Post Title:</b> Correction dose<br/>\n        <b>Post Content:</b> How long does everyone wait after a meal to take a correction dose if you go to high? I know fast acting can last up to 4 hours. And I heard it was ok to take correction after 3 hours.<br/>\n        \n            <b>Comment:</b> I am not a doctor.\n\nI would say it depends on how your body uses insulin. It also depends on what you ate and it what order you ate your food groups in.<br/> <br/>\n            \n            <b>Comment:</b> I have the Inpen so it shows me how much active insulin I have.  I watch my dex trend and if I'm going up and dont have enough IOB I will correct, keeping in mind my correction factor.  My Inpen allows me to put in my current bs and will suggest a correction based on IOB and my correction factor.  Sometimes I'll only do a half unit correction but it can be prob within the first hour and a half to two hours if i'm just having a really bad diabetes day.<br/> <br/>\n            \n            <b>Comment:</b> i typically wait 2 hours! everyone & every meal is different!<br/> <br/>\n            \n            <b>Comment:</b> I usually wait a bit, but I’m not your doctor, ask them.<br/> <br/>\n            "}
{"id": "17ouu7y", "text": "\n        <div style='user-select:none;'><b>Post Title:</b> Can't get blood sugar up.<br/>\n        <b>Post Content:</b> My CGM said my blood sugar was around 70, so I ate some glucose tablets, turned auto correct off my pump, waited 15 minutes to check bg and it kept dropping.  I ate a cookie and it went up a couple of points, but not up to normal.  So I ate more glucose tablets and took my pump completely off.  Still below 60.  Ate a cookie 🍪 and drank a latte.  Still below 60.  I ate a spoonful of maple syrup and some guava and juice and an apple.  Still below 60.  Pump has been completely off for several hours.  WTH is going on?  I am sleepy and need a nap but there's no way I can get to sleep until my sugar goes to normal.  Has this ever happened to anyone else?<br/>\n        \n            <b>Comment:</b> Did you finger test?<br/> <br/>\n            \n            <b>Comment:</b> Did you do a finger stick or were these values all on your CGM?<br/> <br/>\n            \n            <b>Comment:</b> Are you on an airplane or in your honeymoon stage by any chance? Please test via fingerstick if possible and let us know please! Lows are super scary.<br/> <br/>\n            \n            <b>Comment:</b> Do a finger stick to verify. This is why you have glucagon, which I hope you filled! If you have baqsimi, keep it handy and don't be alone, keep feeding sugar tabs. \n\nIf you have regular glucagon, though, you can do a mini glucagon dose. Look at the mini glucagon dose instructions about halfway down this page\n: https://www.nationwidechildrens.org/family-resources-education/health-wellness-and-safety-resources/resources-for-parents-and-kids/managing-your-diabetes/chapter-11-glucagon-and-mini-dose-glucagon\n\nMost people don't realize they can do this! \n\nIf you use your glucagon, don't forget to call your doctor tomorrow and let them know so you can get a refill!<br/> <br/>\n            \n            <b>Comment:</b> A few things come to mind: do you have a menstrual cycle and if so what phase are you in? My ovulation week i barely need any insulin. Hormones can be crazy.\nWere you more active than normal earlier in the day or the previous day?\nAre you sick or getting sick? \nHave you started taking any new supplements?\nThese are all factors that have caused serious low episodes for me<br/> <br/>\n            \n            <b>Comment:</b> This has 100a% happened to me occasionally, and I still have no idea why. It goes on for hours, and it won't get back up! It's so frustrating, and I feel like it always happens around bedtime for me\n\n I'm just your bg is back up, but sorry you feel yucky from the high<br/> <br/>\n            \n            <b>Comment:</b> A few random thoughts—have you ever had delayed stomach emptying symptoms? It is common in diabetics.  Another thought is on any supplements you have started taking.  Some will delay stomach emptying like olive leaf extract. I had a similar experience to yours on a larger dose of OLE. Lastly, be prepared to correct the high once this finally hits.<br/> <br/>\n            \n            <b>Comment:</b> Yes have had this happen many times. Usually when I have some kind of stomach thing that I’m barely aware of. I also suspect sometimes my remaining islet cells (20 years now) sort of randomly wake up here and there.<br/> <br/>\n            \n            <b>Comment:</b> Have you done heavy lifting that day?  Even at that it shouldn’t drop it that much<br/> <br/>\n            \n            <b>Comment:</b> What kind of pump? Minimed Paradigm had an issue of the reservoir slipping & giving too much or too little. \n\nDid u recently change the site?When was last bolus? Was it a low 2 hrs after a meal? \n\nDid u feel the low? How many hours between first low & higher reading?\n\nCheck ur app to see what amount of basal & corrections u we’re getting. \n\nI’ve had this happen one time & still don’t know why. But after had a 500 high. So I guess my food was just very delayed. Pump at time had a pre set basal, no auto correction function.<br/> <br/>\n            \n            <b>Comment:</b> Do u have gastroparesis? My trainer for my new pump seemed to think it would effect my insulin absorption time. But I didn’t think it would effect the absorption of my food or insulin, just my digestion time.<br/> <br/>\n            \n            <b>Comment:</b> Every once in awhile, my pancreas likes to get a participation trophy and squeezes out some insulin and I have a day like this.. just adjust as best as possible<br/> <br/>\n            \n            <b>Comment:</b> For me, drinking hard alcohol makes me low. I can have a sweet drink & as long as there’s vodka in it I don’t need insulin.<br/> <br/>\n            "}
